[NoCoverage] StringLiteral
src/hooks/useAccessibility.ts:11:10
 
 const FONT_SIZE_MAP: Record<AccessibilityPreferences['fontSize'], string> = {
   default: '',
-  large: 'a11y-font-large',
+  large: "",
   xl: 'a11y-font-xl',
 };

[NoCoverage] StringLiteral
src/hooks/useAccessibility.ts:12:7
 const FONT_SIZE_MAP: Record<AccessibilityPreferences['fontSize'], string> = {
   default: '',
   large: 'a11y-font-large',
-  xl: 'a11y-font-xl',
+  xl: "",
 };
 

[NoCoverage] BlockStatement
src/hooks/useAccessibility.ts:15:74
   xl: 'a11y-font-xl',
 };
 
-export function useAccessibility(prefs?: AccessibilityPreferences): void {
-  useEffect(() => {
-    const root = document.documentElement;
-
-    // Font size
-    Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
-    const fontClass = FONT_SIZE_MAP[prefs?.fontSize || 'default'];
-    if (fontClass) root.classList.add(fontClass);
-
-    // High contrast
-    root.classList.toggle('a11y-high-contrast', !!prefs?.highContrast);
-
-    // Reduced motion
-    root.classList.toggle('a11y-reduced-motion', !!prefs?.reducedMotion);
-
-    return () => {
-      Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
-      root.classList.remove('a11y-high-contrast', 'a11y-reduced-motion');
-    };
-  }, [prefs?.fontSize, prefs?.highContrast, prefs?.reducedMotion]);
-}
+export function useAccessibility(prefs?: AccessibilityPreferences): void {}
 

[NoCoverage] BlockStatement
src/hooks/useAccessibility.ts:16:19
 };
 
 export function useAccessibility(prefs?: AccessibilityPreferences): void {
-  useEffect(() => {
-    const root = document.documentElement;
-
-    // Font size
-    Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
-    const fontClass = FONT_SIZE_MAP[prefs?.fontSize || 'default'];
-    if (fontClass) root.classList.add(fontClass);
-
-    // High contrast
-    root.classList.toggle('a11y-high-contrast', !!prefs?.highContrast);
-
-    // Reduced motion
-    root.classList.toggle('a11y-reduced-motion', !!prefs?.reducedMotion);
-
-    return () => {
-      Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
-      root.classList.remove('a11y-high-contrast', 'a11y-reduced-motion');
-    };
-  }, [prefs?.fontSize, prefs?.highContrast, prefs?.reducedMotion]);
+  useEffect(() => {}, [prefs?.fontSize, prefs?.highContrast, prefs?.reducedMotion]);
 }
 

[NoCoverage] ArrowFunction
src/hooks/useAccessibility.ts:20:58
     const root = document.documentElement;
 
     // Font size
-    Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
+    Object.values(FONT_SIZE_MAP).filter(Boolean).forEach(() => undefined);
     const fontClass = FONT_SIZE_MAP[prefs?.fontSize || 'default'];
     if (fontClass) root.classList.add(fontClass);

[NoCoverage] MethodExpression
src/hooks/useAccessibility.ts:20:5
     const root = document.documentElement;
 
     // Font size
-    Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
+    Object.values(FONT_SIZE_MAP).forEach((c) => root.classList.remove(c));
     const fontClass = FONT_SIZE_MAP[prefs?.fontSize || 'default'];
     if (fontClass) root.classList.add(fontClass);

[NoCoverage] ConditionalExpression
src/hooks/useAccessibility.ts:22:9
     // Font size
     Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
     const fontClass = FONT_SIZE_MAP[prefs?.fontSize || 'default'];
-    if (fontClass) root.classList.add(fontClass);
+    if (true) root.classList.add(fontClass);
 
     // High contrast

[NoCoverage] ConditionalExpression
src/hooks/useAccessibility.ts:22:9
     // Font size
     Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
     const fontClass = FONT_SIZE_MAP[prefs?.fontSize || 'default'];
-    if (fontClass) root.classList.add(fontClass);
+    if (false) root.classList.add(fontClass);
 
     // High contrast

[NoCoverage] BooleanLiteral
src/hooks/useAccessibility.ts:25:50
     if (fontClass) root.classList.add(fontClass);
 
     // High contrast
-    root.classList.toggle('a11y-high-contrast', !!prefs?.highContrast);
+    root.classList.toggle('a11y-high-contrast', !prefs?.highContrast);
 
     // Reduced motion

[NoCoverage] BooleanLiteral
src/hooks/useAccessibility.ts:28:50
     root.classList.toggle('a11y-high-contrast', !!prefs?.highContrast);
 
     // Reduced motion
-    root.classList.toggle('a11y-reduced-motion', !!prefs?.reducedMotion);
+    root.classList.toggle('a11y-reduced-motion', !prefs?.reducedMotion);
 
     return () => {

[NoCoverage] BlockStatement
src/hooks/useAccessibility.ts:30:18
     // Reduced motion
     root.classList.toggle('a11y-reduced-motion', !!prefs?.reducedMotion);
 
-    return () => {
-      Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
-      root.classList.remove('a11y-high-contrast', 'a11y-reduced-motion');
-    };
+    return () => {};
   }, [prefs?.fontSize, prefs?.highContrast, prefs?.reducedMotion]);
 }

[NoCoverage] ArrowFunction
src/hooks/useAccessibility.ts:31:60
     root.classList.toggle('a11y-reduced-motion', !!prefs?.reducedMotion);
 
     return () => {
-      Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
+      Object.values(FONT_SIZE_MAP).filter(Boolean).forEach(() => undefined);
       root.classList.remove('a11y-high-contrast', 'a11y-reduced-motion');
     };

[NoCoverage] MethodExpression
src/hooks/useAccessibility.ts:31:7
     root.classList.toggle('a11y-reduced-motion', !!prefs?.reducedMotion);
 
     return () => {
-      Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
+      Object.values(FONT_SIZE_MAP).forEach((c) => root.classList.remove(c));
       root.classList.remove('a11y-high-contrast', 'a11y-reduced-motion');
     };

[NoCoverage] ArrayDeclaration
src/hooks/useAccessibility.ts:34:6
       Object.values(FONT_SIZE_MAP).filter(Boolean).forEach((c) => root.classList.remove(c));
       root.classList.remove('a11y-high-contrast', 'a11y-reduced-motion');
     };
-  }, [prefs?.fontSize, prefs?.highContrast, prefs?.reducedMotion]);
+  }, []);
 }
 
