[Killed] ObjectLiteral
src/hooks/useCommitmentService.ts:24:47
   useCommitmentResetEffect(user, rawTasks);
 
   const tasks = useMemo(() => {
-    const timeOrder: Record<string, number> = { 'morning': 1, 'afternoon': 2, 'evening': 3, 'any': 4 };
+    const timeOrder: Record<string, number> = {};
     return [...rawTasks].sort((a, b) => {
       if (a.completed !== b.completed) return a.completed ? 1 : -1;
killedBy: useCommitmentService Task Fetching and Sorting should sort daily tasks by time of day
statusReason: expected 'Any Time' to be 'Morning' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] MethodExpression
src/hooks/useCommitmentService.ts:25:12
 
   const tasks = useMemo(() => {
     const timeOrder: Record<string, number> = { 'morning': 1, 'afternoon': 2, 'evening': 3, 'any': 4 };
-    return [...rawTasks].sort((a, b) => {
-      if (a.completed !== b.completed) return a.completed ? 1 : -1;
-      if (a.type === 'daily' && b.type === 'daily') {
-        return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] || 4);
-      }
-      return 0;
-    });
+    return [...rawTasks];
   }, [rawTasks]);
 
killedBy: useCommitmentService Task Fetching and Sorting should sort completed tasks to the bottom
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] EqualityOperator
src/hooks/useCommitmentService.ts:26:11
   const tasks = useMemo(() => {
     const timeOrder: Record<string, number> = { 'morning': 1, 'afternoon': 2, 'evening': 3, 'any': 4 };
     return [...rawTasks].sort((a, b) => {
-      if (a.completed !== b.completed) return a.completed ? 1 : -1;
+      if (a.completed === b.completed) return a.completed ? 1 : -1;
       if (a.type === 'daily' && b.type === 'daily') {
         return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] || 4);
killedBy: useCommitmentService Task Fetching and Sorting should sort completed tasks to the bottom
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] UnaryOperator
src/hooks/useCommitmentService.ts:26:65
   const tasks = useMemo(() => {
     const timeOrder: Record<string, number> = { 'morning': 1, 'afternoon': 2, 'evening': 3, 'any': 4 };
     return [...rawTasks].sort((a, b) => {
-      if (a.completed !== b.completed) return a.completed ? 1 : -1;
+      if (a.completed !== b.completed) return a.completed ? 1 : +1;
       if (a.type === 'daily' && b.type === 'daily') {
         return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] || 4);
killedBy: useCommitmentService Task Fetching and Sorting should sort completed tasks to the bottom
statusReason: expected true to be false // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] EqualityOperator
src/hooks/useCommitmentService.ts:27:33
     const timeOrder: Record<string, number> = { 'morning': 1, 'afternoon': 2, 'evening': 3, 'any': 4 };
     return [...rawTasks].sort((a, b) => {
       if (a.completed !== b.completed) return a.completed ? 1 : -1;
-      if (a.type === 'daily' && b.type === 'daily') {
+      if (a.type === 'daily' && b.type !== 'daily') {
         return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] || 4);
       }
killedBy: useCommitmentService Task Fetching and Sorting should sort daily tasks by time of day
statusReason: expected 'Any Time' to be 'Morning' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] ConditionalExpression
src/hooks/useCommitmentService.ts:27:11
     const timeOrder: Record<string, number> = { 'morning': 1, 'afternoon': 2, 'evening': 3, 'any': 4 };
     return [...rawTasks].sort((a, b) => {
       if (a.completed !== b.completed) return a.completed ? 1 : -1;
-      if (a.type === 'daily' && b.type === 'daily') {
+      if (false) {
         return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] || 4);
       }
killedBy: useCommitmentService Task Fetching and Sorting should sort daily tasks by time of day
statusReason: expected 'Any Time' to be 'Morning' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] LogicalOperator
src/hooks/useCommitmentService.ts:28:58
     return [...rawTasks].sort((a, b) => {
       if (a.completed !== b.completed) return a.completed ? 1 : -1;
       if (a.type === 'daily' && b.type === 'daily') {
-        return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] || 4);
+        return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] && 4);
       }
       return 0;
killedBy: useCommitmentService Task Fetching and Sorting should sort daily tasks by time of day
statusReason: expected 'Afternoon' to be 'Morning' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] ArithmeticOperator
src/hooks/useCommitmentService.ts:28:16
     return [...rawTasks].sort((a, b) => {
       if (a.completed !== b.completed) return a.completed ? 1 : -1;
       if (a.type === 'daily' && b.type === 'daily') {
-        return (timeOrder[a.timeOfDay || 'any'] || 4) - (timeOrder[b.timeOfDay || 'any'] || 4);
+        return (timeOrder[a.timeOfDay || 'any'] || 4) + (timeOrder[b.timeOfDay || 'any'] || 4);
       }
       return 0;
killedBy: useCommitmentService Task Fetching and Sorting should sort daily tasks by time of day
statusReason: expected 'Any Time' to be 'Morning' // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>

[Killed] BlockStatement
src/hooks/useCommitmentService.ts:34:85
     });
   }, [rawTasks]);
 
-  const addTask = useCallback(async (task: Omit<AnchorTask, 'id' | 'createdAt'>) => {
-    if (!user) return;
-
-    // Rate limit: 20 commitments per hour
-    const rateCheck = checkRateLimit(`commitmentCreate:${user.uid}`, RATE_LIMIT_CONFIGS.commitmentCreate);
-    if (rateCheck.isLimited) {
-      throw new Error(`Too many commitments created. Please try again in ${formatRetryTime(rateCheck.retryAfterMs || 0)}.`);
-    }
-
-    const docRef = await createCommitment(user.uid, task);
-    // AUDIT: Log commitment creation
-    auditCommitments.created(docRef.id, task.title);
-    queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
-  }, [user, queryClient]);
+  const addTask = useCallback(async (task: Omit<AnchorTask, 'id' | 'createdAt'>) => {}, [user, queryClient]);
 
   /**
killedBy: useCommitmentService Task Management Functions should add a task
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Number of calls: 0

[NoCoverage] ConditionalExpression
src/hooks/useCommitmentService.ts:73:15
         if (!old) return old;
 
         return old.map(task => {
-          if (task.id !== id) return task;
+          if (false) return task;
 
           // Calculate updates (same logic as Firestore transaction)

[NoCoverage] ConditionalExpression
src/hooks/useCommitmentService.ts:73:15
         if (!old) return old;
 
         return old.map(task => {
-          if (task.id !== id) return task;
+          if (true) return task;
 
           // Calculate updates (same logic as Firestore transaction)

[NoCoverage] BooleanLiteral
src/hooks/useCommitmentService.ts:76:61
           if (task.id !== id) return task;
 
           // Calculate updates (same logic as Firestore transaction)
-          const updates: Partial<AnchorTask> = { completed: !currentStatus };
+          const updates: Partial<AnchorTask> = { completed: currentStatus };
 
           if (!currentStatus) {

[NoCoverage] BlockStatement
src/hooks/useCommitmentService.ts:78:31
           // Calculate updates (same logic as Firestore transaction)
           const updates: Partial<AnchorTask> = { completed: !currentStatus };
 
-          if (!currentStatus) {
-            // Completing
-            updates.lastCompletedAt = new Date().toISOString();
-            const currentStreak = task.currentStreak || 0;
-            const newStreak = currentStreak + 1;
-            updates.currentStreak = newStreak;
-            updates.longestStreak = Math.max(newStreak, task.longestStreak || 0);
-          } else {
+          if (!currentStatus) {} else {
             // Uncompleting
             const currentStreak = task.currentStreak || 0;

[NoCoverage] ConditionalExpression
src/hooks/useCommitmentService.ts:78:15
           // Calculate updates (same logic as Firestore transaction)
           const updates: Partial<AnchorTask> = { completed: !currentStatus };
 
-          if (!currentStatus) {
+          if (false) {
             // Completing
             updates.lastCompletedAt = new Date().toISOString();

[NoCoverage] ArithmeticOperator
src/hooks/useCommitmentService.ts:82:31
             // Completing
             updates.lastCompletedAt = new Date().toISOString();
             const currentStreak = task.currentStreak || 0;
-            const newStreak = currentStreak + 1;
+            const newStreak = currentStreak - 1;
             updates.currentStreak = newStreak;
             updates.longestStreak = Math.max(newStreak, task.longestStreak || 0);

[NoCoverage] MethodExpression
src/hooks/useCommitmentService.ts:84:37
             const currentStreak = task.currentStreak || 0;
             const newStreak = currentStreak + 1;
             updates.currentStreak = newStreak;
-            updates.longestStreak = Math.max(newStreak, task.longestStreak || 0);
+            updates.longestStreak = Math.min(newStreak, task.longestStreak || 0);
           } else {
             // Uncompleting

[NoCoverage] BlockStatement
src/hooks/useCommitmentService.ts:85:18
             const newStreak = currentStreak + 1;
             updates.currentStreak = newStreak;
             updates.longestStreak = Math.max(newStreak, task.longestStreak || 0);
-          } else {
-            // Uncompleting
-            const currentStreak = task.currentStreak || 0;
-            if (currentStreak > 0) {
-              updates.currentStreak = currentStreak - 1;
-            }
-          }
+          } else {}
 
           return { ...task, ...updates };

[NoCoverage] EqualityOperator
src/hooks/useCommitmentService.ts:88:17
           } else {
             // Uncompleting
             const currentStreak = task.currentStreak || 0;
-            if (currentStreak > 0) {
+            if (currentStreak <= 0) {
               updates.currentStreak = currentStreak - 1;
             }

[NoCoverage] ConditionalExpression
src/hooks/useCommitmentService.ts:88:17
           } else {
             // Uncompleting
             const currentStreak = task.currentStreak || 0;
-            if (currentStreak > 0) {
+            if (false) {
               updates.currentStreak = currentStreak - 1;
             }

[NoCoverage] ArithmeticOperator
src/hooks/useCommitmentService.ts:89:39
             // Uncompleting
             const currentStreak = task.currentStreak || 0;
             if (currentStreak > 0) {
-              updates.currentStreak = currentStreak - 1;
+              updates.currentStreak = currentStreak + 1;
             }
           }

[Killed] BlockStatement
src/hooks/useCommitmentService.ts:100:9
 
     // Execute Firestore transaction
     // onSnapshot listener will automatically sync the final state from Firestore
-    try {
-      await toggleCommitmentCompletion(user.uid, id, currentStatus);
-
-      // ✅ NO REFETCH NEEDED: onSnapshot listener handles real-time sync automatically
-      // The listener will fire when Firestore confirms the update, ensuring UI stays in sync
-
-    } catch (error) {
+    try {} catch (error) {
       // ❌ ROLLBACK: If Firestore fails, invalidate cache to trigger onSnapshot refetch
       console.error('[toggleTask] Firestore transaction failed, rolling back optimistic update:', error);
killedBy: useCommitmentService Task Management Functions should toggle task completion with atomic transaction
statusReason: expected "vi.fn()" to be called at least once

[NoCoverage] BlockStatement
src/hooks/useCommitmentService.ts:106:21
       // ✅ NO REFETCH NEEDED: onSnapshot listener handles real-time sync automatically
       // The listener will fire when Firestore confirms the update, ensuring UI stays in sync
 
-    } catch (error) {
-      // ❌ ROLLBACK: If Firestore fails, invalidate cache to trigger onSnapshot refetch
-      console.error('[toggleTask] Firestore transaction failed, rolling back optimistic update:', error);
-      queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
-      throw error;
-    }
+    } catch (error) {}
 
     // AUDIT: Log completion (only when completing, not uncompleting)

[NoCoverage] StringLiteral
src/hooks/useCommitmentService.ts:108:21
 
     } catch (error) {
       // ❌ ROLLBACK: If Firestore fails, invalidate cache to trigger onSnapshot refetch
-      console.error('[toggleTask] Firestore transaction failed, rolling back optimistic update:', error);
+      console.error("", error);
       queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
       throw error;

[Killed] BlockStatement
src/hooks/useCommitmentService.ts:114:25
     }
 
     // AUDIT: Log completion (only when completing, not uncompleting)
-    if (!currentStatus) {
-      auditCommitments.completed(id);
-    }
+    if (!currentStatus) {}
   }, [user, queryClient]);
 
killedBy: useCommitmentService toggleTask updates cache optimistically and runs transaction
statusReason: expected "vi.fn()" to be called with arguments: [ 't1' ]

Number of calls: 0

[Killed] ConditionalExpression
src/hooks/useCommitmentService.ts:114:9
     }
 
     // AUDIT: Log completion (only when completing, not uncompleting)
-    if (!currentStatus) {
+    if (true) {
       auditCommitments.completed(id);
     }
killedBy: useCommitmentService toggleTask does not audit when uncompleting
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      "t1",

[Killed] BlockStatement
src/hooks/useCommitmentService.ts:119:56
     }
   }, [user, queryClient]);
 
-  const deleteTask = useCallback(async (id: string) => {
-    if (!user) return;
-    // AUDIT: Log commitment deletion
-    auditCommitments.deleted(id);
-    await deleteCommitment(user.uid, id);
-    queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
-  }, [user, queryClient]);
+  const deleteTask = useCallback(async (id: string) => {}, [user, queryClient]);
 
   const updateTask = useCallback(async (id: string, updates: Partial<Omit<AnchorTask, 'id' | 'createdAt' | 'type'>>) => {
killedBy: useCommitmentService Task Management Functions should delete task
statusReason: expected "vi.fn()" to be called at least once

[Survived] ObjectLiteral
src/hooks/useCommitmentService.ts:124:35
     // AUDIT: Log commitment deletion
     auditCommitments.deleted(id);
     await deleteCommitment(user.uid, id);
-    queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
+    queryClient.invalidateQueries({});
   }, [user, queryClient]);
 

[Killed] BlockStatement
src/hooks/useCommitmentService.ts:127:121
     queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
   }, [user, queryClient]);
 
-  const updateTask = useCallback(async (id: string, updates: Partial<Omit<AnchorTask, 'id' | 'createdAt' | 'type'>>) => {
-    if (!user) return;
-    await updateCommitment(user.uid, id, updates);
-    queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
-  }, [user, queryClient]);
+  const updateTask = useCallback(async (id: string, updates: Partial<Omit<AnchorTask, 'id' | 'createdAt' | 'type'>>) => {}, [user, queryClient]);
 
   return useMemo(() => ({
killedBy: useCommitmentService updateTask updates Firestore document
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, { title: 'Updated' } ]

Number of calls: 0

[Survived] ArrayDeclaration
src/hooks/useCommitmentService.ts:131:6
     if (!user) return;
     await updateCommitment(user.uid, id, updates);
     queryClient.invalidateQueries({ queryKey: TASK_KEYS.list(user.uid) });
-  }, [user, queryClient]);
+  }, []);
 
   return useMemo(() => ({

[Killed] ArrayDeclaration
src/hooks/useCommitmentService.ts:135:7
 
   return useMemo(() => ({
     tasks, addTask, toggleTask, deleteTask, updateTask, loadingTasks: isLoading
-  }), [tasks, addTask, toggleTask, deleteTask, updateTask, isLoading]);
+  }), []);
 };
 
killedBy: useCommitmentService Initialization and State should fetch tasks when user is provided
statusReason: expected [] to have a length of 1 but got +0

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
