[NoCoverage] ArithmeticOperator
src/hooks/useVersionCheck.ts:16:27
 
 import { useEffect, useRef, useCallback } from 'react';
 
-const CHECK_INTERVAL_MS = 60 * 1000; // Check every 60 seconds
+const CHECK_INTERVAL_MS = 60 / 1000; // Check every 60 seconds
 const RELOAD_DELAY_MS = 2000; // Show notification for 2 seconds before reload
 

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:26:52
     return match ? match[1] : null;
 }
 
-export function useVersionCheck(enabled: boolean = true) {
+export function useVersionCheck(enabled: boolean = false) {
     const currentHashRef = useRef<string | null>(null);
     const isCheckingRef = useRef(false);

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:28:34
 
 export function useVersionCheck(enabled: boolean = true) {
     const currentHashRef = useRef<string | null>(null);
-    const isCheckingRef = useRef(false);
+    const isCheckingRef = useRef(true);
 
     const checkForUpdate = useCallback(async () => {

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:31:13
     const isCheckingRef = useRef(false);
 
     const checkForUpdate = useCallback(async () => {
-        if (isCheckingRef.current) return;
+        if (false) return;
         isCheckingRef.current = true;
 

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:31:13
     const isCheckingRef = useRef(false);
 
     const checkForUpdate = useCallback(async () => {
-        if (isCheckingRef.current) return;
+        if (true) return;
         isCheckingRef.current = true;
 

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:32:33
 
     const checkForUpdate = useCallback(async () => {
         if (isCheckingRef.current) return;
-        isCheckingRef.current = true;
+        isCheckingRef.current = false;
 
         try {

[NoCoverage] StringLiteral
src/hooks/useVersionCheck.ts:39:38
             const response = await fetch('/', {
                 method: 'GET',
                 headers: {
-                    'Cache-Control': 'no-cache, no-store, must-revalidate',
+                    'Cache-Control': "",
                     'Pragma': 'no-cache',
                 },

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:46:41
             });
 
             if (!response.ok) {
-                isCheckingRef.current = false;
+                isCheckingRef.current = true;
                 return;
             }

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:53:30
             const html = await response.text();
             const latestHash = extractBundleHash(html);
 
-            if (!latestHash) {
-                isCheckingRef.current = false;
-                return;
-            }
+            if (!latestHash) {}
 
             // First run - store the current hash

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:53:17
             const html = await response.text();
             const latestHash = extractBundleHash(html);
 
-            if (!latestHash) {
+            if (latestHash) {
                 isCheckingRef.current = false;
                 return;

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:54:41
             const latestHash = extractBundleHash(html);
 
             if (!latestHash) {
-                isCheckingRef.current = false;
+                isCheckingRef.current = true;
                 return;
             }

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:59:17
             }
 
             // First run - store the current hash
-            if (currentHashRef.current === null) {
+            if (true) {
                 currentHashRef.current = latestHash;
                 isCheckingRef.current = false;

[NoCoverage] EqualityOperator
src/hooks/useVersionCheck.ts:59:17
             }
 
             // First run - store the current hash
-            if (currentHashRef.current === null) {
+            if (currentHashRef.current !== null) {
                 currentHashRef.current = latestHash;
                 isCheckingRef.current = false;

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:61:41
             // First run - store the current hash
             if (currentHashRef.current === null) {
                 currentHashRef.current = latestHash;
-                isCheckingRef.current = false;
+                isCheckingRef.current = true;
                 return;
             }

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:66:17
             }
 
             // Check if hash has changed
-            if (latestHash !== currentHashRef.current) {
+            if (false) {
                 if (import.meta.env.DEV) console.info('[VersionCheck] New version detected! Reloading...');
 

[NoCoverage] EqualityOperator
src/hooks/useVersionCheck.ts:66:17
             }
 
             // Check if hash has changed
-            if (latestHash !== currentHashRef.current) {
+            if (latestHash === currentHashRef.current) {
                 if (import.meta.env.DEV) console.info('[VersionCheck] New version detected! Reloading...');
 

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:67:21
 
             // Check if hash has changed
             if (latestHash !== currentHashRef.current) {
-                if (import.meta.env.DEV) console.info('[VersionCheck] New version detected! Reloading...');
+                if (false) console.info('[VersionCheck] New version detected! Reloading...');
 
                 // Brief notification before reload

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:67:21
 
             // Check if hash has changed
             if (latestHash !== currentHashRef.current) {
-                if (import.meta.env.DEV) console.info('[VersionCheck] New version detected! Reloading...');
+                if (true) console.info('[VersionCheck] New version detected! Reloading...');
 
                 // Brief notification before reload

[NoCoverage] StringLiteral
src/hooks/useVersionCheck.ts:70:54
                 if (import.meta.env.DEV) console.info('[VersionCheck] New version detected! Reloading...');
 
                 // Brief notification before reload
-                const toast = document.createElement('div');
+                const toast = document.createElement("");
                 toast.className = 'fixed bottom-4 left-1/2 -translate-x-1/2 bg-primary-600 text-white px-6 py-3 rounded-full shadow-lg z-[9999] animate-pulse font-bold text-sm';
                 toast.textContent = '🚀 New version available! Refreshing...';

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:76:34
                 document.body.appendChild(toast);
 
                 // Reload after brief delay
-                setTimeout(() => {
-                    window.location.reload();
-                }, RELOAD_DELAY_MS);
+                setTimeout(() => {}, RELOAD_DELAY_MS);
             }
         } catch (error) {

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:80:25
                     window.location.reload();
                 }, RELOAD_DELAY_MS);
             }
-        } catch (error) {
-            // Silently fail - network issues shouldn't break the app
-            console.debug('[VersionCheck] Check failed:', error);
-        } finally {
+        } catch (error) {} finally {
             isCheckingRef.current = false;
         }

[NoCoverage] StringLiteral
src/hooks/useVersionCheck.ts:82:27
             }
         } catch (error) {
             // Silently fail - network issues shouldn't break the app
-            console.debug('[VersionCheck] Check failed:', error);
+            console.debug("", error);
         } finally {
             isCheckingRef.current = false;

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:83:19
         } catch (error) {
             // Silently fail - network issues shouldn't break the app
             console.debug('[VersionCheck] Check failed:', error);
-        } finally {
-            isCheckingRef.current = false;
-        }
+        } finally {}
     }, []);
 

[NoCoverage] BooleanLiteral
src/hooks/useVersionCheck.ts:84:37
             // Silently fail - network issues shouldn't break the app
             console.debug('[VersionCheck] Check failed:', error);
         } finally {
-            isCheckingRef.current = false;
+            isCheckingRef.current = true;
         }
     }, []);

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:89:13
     }, []);
 
     useEffect(() => {
-        if (!enabled) return;
+        if (false) return;
 
         // Only run on deployed environments (dev, staging, production Firebase hosting)

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:89:13
     }, []);
 
     useEffect(() => {
-        if (!enabled) return;
+        if (true) return;
 
         // Only run on deployed environments (dev, staging, production Firebase hosting)

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:93:29
 
         // Only run on deployed environments (dev, staging, production Firebase hosting)
         // Skip if running locally via Vite dev server (localhost or Tailscale)
-        const isLocalhost = window.location.hostname === 'localhost' || 
-                           window.location.hostname === '127.0.0.1' ||
-                           window.location.hostname.startsWith('192.168.') ||
-                           window.location.hostname.startsWith('100.'); // Tailscale IPs
+        const isLocalhost = false; // Tailscale IPs
         
         if (isLocalhost) {

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:93:29
 
         // Only run on deployed environments (dev, staging, production Firebase hosting)
         // Skip if running locally via Vite dev server (localhost or Tailscale)
-        const isLocalhost = window.location.hostname === 'localhost' || 
-                           window.location.hostname === '127.0.0.1' ||
-                           window.location.hostname.startsWith('192.168.') ||
+        const isLocalhost = false ||
                            window.location.hostname.startsWith('100.'); // Tailscale IPs
         

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:94:28
         // Only run on deployed environments (dev, staging, production Firebase hosting)
         // Skip if running locally via Vite dev server (localhost or Tailscale)
         const isLocalhost = window.location.hostname === 'localhost' || 
-                           window.location.hostname === '127.0.0.1' ||
+                           false ||
                            window.location.hostname.startsWith('192.168.') ||
                            window.location.hostname.startsWith('100.'); // Tailscale IPs

[NoCoverage] EqualityOperator
src/hooks/useVersionCheck.ts:94:28
         // Only run on deployed environments (dev, staging, production Firebase hosting)
         // Skip if running locally via Vite dev server (localhost or Tailscale)
         const isLocalhost = window.location.hostname === 'localhost' || 
-                           window.location.hostname === '127.0.0.1' ||
+                           window.location.hostname !== '127.0.0.1' ||
                            window.location.hostname.startsWith('192.168.') ||
                            window.location.hostname.startsWith('100.'); // Tailscale IPs

[NoCoverage] MethodExpression
src/hooks/useVersionCheck.ts:95:28
         // Skip if running locally via Vite dev server (localhost or Tailscale)
         const isLocalhost = window.location.hostname === 'localhost' || 
                            window.location.hostname === '127.0.0.1' ||
-                           window.location.hostname.startsWith('192.168.') ||
+                           window.location.hostname.endsWith('192.168.') ||
                            window.location.hostname.startsWith('100.'); // Tailscale IPs
         

[NoCoverage] StringLiteral
src/hooks/useVersionCheck.ts:95:64
         // Skip if running locally via Vite dev server (localhost or Tailscale)
         const isLocalhost = window.location.hostname === 'localhost' || 
                            window.location.hostname === '127.0.0.1' ||
-                           window.location.hostname.startsWith('192.168.') ||
+                           window.location.hostname.startsWith("") ||
                            window.location.hostname.startsWith('100.'); // Tailscale IPs
         

[NoCoverage] MethodExpression
src/hooks/useVersionCheck.ts:96:28
         const isLocalhost = window.location.hostname === 'localhost' || 
                            window.location.hostname === '127.0.0.1' ||
                            window.location.hostname.startsWith('192.168.') ||
-                           window.location.hostname.startsWith('100.'); // Tailscale IPs
+                           window.location.hostname.endsWith('100.'); // Tailscale IPs
         
         if (isLocalhost) {

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:98:26
                            window.location.hostname.startsWith('192.168.') ||
                            window.location.hostname.startsWith('100.'); // Tailscale IPs
         
-        if (isLocalhost) {
-            console.debug('[VersionCheck] Disabled for local development');
-            return;
-        }
+        if (isLocalhost) {}
 
         // Initial check after 5 seconds (to not block initial load)

[NoCoverage] StringLiteral
src/hooks/useVersionCheck.ts:99:27
                            window.location.hostname.startsWith('100.'); // Tailscale IPs
         
         if (isLocalhost) {
-            console.debug('[VersionCheck] Disabled for local development');
+            console.debug("");
             return;
         }

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:110:46
         const interval = setInterval(checkForUpdate, CHECK_INTERVAL_MS);
 
         // Also check when tab becomes visible (user returns to app)
-        const handleVisibilityChange = () => {
-            if (document.visibilityState === 'visible') {
-                checkForUpdate();
-            }
-        };
+        const handleVisibilityChange = () => {};
         document.addEventListener('visibilitychange', handleVisibilityChange);
 

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:111:57
 
         // Also check when tab becomes visible (user returns to app)
         const handleVisibilityChange = () => {
-            if (document.visibilityState === 'visible') {
-                checkForUpdate();
-            }
+            if (document.visibilityState === 'visible') {}
         };
         document.addEventListener('visibilitychange', handleVisibilityChange);

[NoCoverage] ConditionalExpression
src/hooks/useVersionCheck.ts:111:17
 
         // Also check when tab becomes visible (user returns to app)
         const handleVisibilityChange = () => {
-            if (document.visibilityState === 'visible') {
+            if (false) {
                 checkForUpdate();
             }

[NoCoverage] StringLiteral
src/hooks/useVersionCheck.ts:115:35
                 checkForUpdate();
             }
         };
-        document.addEventListener('visibilitychange', handleVisibilityChange);
+        document.addEventListener("", handleVisibilityChange);
 
         return () => {

[NoCoverage] BlockStatement
src/hooks/useVersionCheck.ts:117:22
         };
         document.addEventListener('visibilitychange', handleVisibilityChange);
 
-        return () => {
-            clearTimeout(initialTimeout);
-            clearInterval(interval);
-            document.removeEventListener('visibilitychange', handleVisibilityChange);
-        };
+        return () => {};
     }, [enabled, checkForUpdate]);
 }

[NoCoverage] StringLiteral
src/hooks/useVersionCheck.ts:120:42
         return () => {
             clearTimeout(initialTimeout);
             clearInterval(interval);
-            document.removeEventListener('visibilitychange', handleVisibilityChange);
+            document.removeEventListener("", handleVisibilityChange);
         };
     }, [enabled, checkForUpdate]);
