[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:4:7
 import type { FabricContext, SpecialContext } from '../../types';
 
 function resolveTimeOfDay(hour: number): FabricContext['timeOfDay'] {
-  if (hour >= 5 && hour <= 11) return 'morning';
+  if (true) return 'morning';
   if (hour >= 12 && hour <= 16) return 'afternoon';
   if (hour >= 17 && hour <= 20) return 'evening';
killedBy: getAmbientContext detects afternoon context
statusReason: expected 'morning' to be 'afternoon' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:4:7
 import type { FabricContext, SpecialContext } from '../../types';
 
 function resolveTimeOfDay(hour: number): FabricContext['timeOfDay'] {
-  if (hour >= 5 && hour <= 11) return 'morning';
+  if (false) return 'morning';
   if (hour >= 12 && hour <= 16) return 'afternoon';
   if (hour >= 17 && hour <= 20) return 'evening';
killedBy: getAmbientContext detects morning context
statusReason: expected 'night' to be 'morning' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:5:7
 
 function resolveTimeOfDay(hour: number): FabricContext['timeOfDay'] {
   if (hour >= 5 && hour <= 11) return 'morning';
-  if (hour >= 12 && hour <= 16) return 'afternoon';
+  if (hour < 12 && hour <= 16) return 'afternoon';
   if (hour >= 17 && hour <= 20) return 'evening';
   return 'night';
killedBy: getAmbientContext detects afternoon context
statusReason: expected 'night' to be 'afternoon' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:5:21
 
 function resolveTimeOfDay(hour: number): FabricContext['timeOfDay'] {
   if (hour >= 5 && hour <= 11) return 'morning';
-  if (hour >= 12 && hour <= 16) return 'afternoon';
+  if (hour >= 12 && true) return 'afternoon';
   if (hour >= 17 && hour <= 20) return 'evening';
   return 'night';
killedBy: getAmbientContext detects evening context
statusReason: expected 'afternoon' to be 'evening' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:6:7
 function resolveTimeOfDay(hour: number): FabricContext['timeOfDay'] {
   if (hour >= 5 && hour <= 11) return 'morning';
   if (hour >= 12 && hour <= 16) return 'afternoon';
-  if (hour >= 17 && hour <= 20) return 'evening';
+  if (hour < 17 && hour <= 20) return 'evening';
   return 'night';
 }
killedBy: getAmbientContext detects evening context
statusReason: expected 'night' to be 'evening' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:6:21
 function resolveTimeOfDay(hour: number): FabricContext['timeOfDay'] {
   if (hour >= 5 && hour <= 11) return 'morning';
   if (hour >= 12 && hour <= 16) return 'afternoon';
-  if (hour >= 17 && hour <= 20) return 'evening';
+  if (hour >= 17 && hour > 20) return 'evening';
   return 'night';
 }
killedBy: getAmbientContext detects evening context
statusReason: expected 'night' to be 'evening' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:11:7
 }
 
 function resolveSpecialContext(month: number, dayOfMonth: number): SpecialContext | null {
-  if (month === 0 && dayOfMonth <= 7) return 'new_year';
+  if (false) return 'new_year';
   if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
   if (month >= 10 && month <= 11) return 'holiday_season';
killedBy: getAmbientContext detects special contexts
statusReason: expected 'tax_season' to be 'new_year' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:11:22
 }
 
 function resolveSpecialContext(month: number, dayOfMonth: number): SpecialContext | null {
-  if (month === 0 && dayOfMonth <= 7) return 'new_year';
+  if (month === 0 && dayOfMonth > 7) return 'new_year';
   if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
   if (month >= 10 && month <= 11) return 'holiday_season';
killedBy: getAmbientContext detects special contexts
statusReason: expected 'tax_season' to be 'new_year' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:12:23
 
 function resolveSpecialContext(month: number, dayOfMonth: number): SpecialContext | null {
   if (month === 0 && dayOfMonth <= 7) return 'new_year';
-  if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
+  if (month === 11 && dayOfMonth < 25) return 'end_of_year';
   if (month >= 10 && month <= 11) return 'holiday_season';
   if (month >= 0 && month <= 3) return 'tax_season';
killedBy: getAmbientContext detects special contexts
statusReason: expected 'holiday_season' to be 'end_of_year' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:12:7
 
 function resolveSpecialContext(month: number, dayOfMonth: number): SpecialContext | null {
   if (month === 0 && dayOfMonth <= 7) return 'new_year';
-  if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
+  if (true) return 'end_of_year';
   if (month >= 10 && month <= 11) return 'holiday_season';
   if (month >= 0 && month <= 3) return 'tax_season';
killedBy: getAmbientContext detects special contexts
statusReason: expected 'end_of_year' to be 'tax_season' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:13:7
 function resolveSpecialContext(month: number, dayOfMonth: number): SpecialContext | null {
   if (month === 0 && dayOfMonth <= 7) return 'new_year';
   if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
-  if (month >= 10 && month <= 11) return 'holiday_season';
+  if (true) return 'holiday_season';
   if (month >= 0 && month <= 3) return 'tax_season';
   return null;
killedBy: getAmbientContext detects special contexts
statusReason: expected 'holiday_season' to be 'tax_season' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:13:7
 function resolveSpecialContext(month: number, dayOfMonth: number): SpecialContext | null {
   if (month === 0 && dayOfMonth <= 7) return 'new_year';
   if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
-  if (month >= 10 && month <= 11) return 'holiday_season';
+  if (true && month <= 11) return 'holiday_season';
   if (month >= 0 && month <= 3) return 'tax_season';
   return null;
killedBy: getAmbientContext detects special contexts
statusReason: expected 'holiday_season' to be 'tax_season' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:14:21
   if (month === 0 && dayOfMonth <= 7) return 'new_year';
   if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
   if (month >= 10 && month <= 11) return 'holiday_season';
-  if (month >= 0 && month <= 3) return 'tax_season';
+  if (month >= 0 && month > 3) return 'tax_season';
   return null;
 }
killedBy: getAmbientContext detects special contexts
statusReason: expected null to be 'tax_season' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:14:7
   if (month === 0 && dayOfMonth <= 7) return 'new_year';
   if (month === 11 && dayOfMonth >= 25) return 'end_of_year';
   if (month >= 10 && month <= 11) return 'holiday_season';
-  if (month >= 0 && month <= 3) return 'tax_season';
+  if (month < 0 && month <= 3) return 'tax_season';
   return null;
 }
killedBy: getAmbientContext detects special contexts
statusReason: expected null to be 'tax_season' // Object.is equality

[Survived] ArithmeticOperator
src/services/fabric/AmbientContext.ts:24:47
   const dayOfMonth = now.getUTCDate();
   const month = now.getUTCMonth();
   const year = now.getUTCFullYear();
-  const daysInMonth = new Date(Date.UTC(year, month + 1, 0)).getUTCDate();
+  const daysInMonth = new Date(Date.UTC(year, month - 1, 0)).getUTCDate();
 
   return {

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:29:16
   return {
     timeOfDay: resolveTimeOfDay(hour),
     dayOfWeek,
-    isWeekend: dayOfWeek === 0 || dayOfWeek === 6,
+    isWeekend: false,
     isFirstOfMonth: dayOfMonth === 1,
     isEndOfMonth: dayOfMonth >= daysInMonth - 2,
killedBy: getAmbientContext detects weekend and month boundaries
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:29:16
   return {
     timeOfDay: resolveTimeOfDay(hour),
     dayOfWeek,
-    isWeekend: dayOfWeek === 0 || dayOfWeek === 6,
+    isWeekend: false || dayOfWeek === 6,
     isFirstOfMonth: dayOfMonth === 1,
     isEndOfMonth: dayOfMonth >= daysInMonth - 2,
killedBy: getAmbientContext detects weekend and month boundaries
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:30:21
     timeOfDay: resolveTimeOfDay(hour),
     dayOfWeek,
     isWeekend: dayOfWeek === 0 || dayOfWeek === 6,
-    isFirstOfMonth: dayOfMonth === 1,
+    isFirstOfMonth: dayOfMonth !== 1,
     isEndOfMonth: dayOfMonth >= daysInMonth - 2,
     dayOfMonth,
killedBy: getAmbientContext detects weekend and month boundaries
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/AmbientContext.ts:30:21
     timeOfDay: resolveTimeOfDay(hour),
     dayOfWeek,
     isWeekend: dayOfWeek === 0 || dayOfWeek === 6,
-    isFirstOfMonth: dayOfMonth === 1,
+    isFirstOfMonth: false,
     isEndOfMonth: dayOfMonth >= daysInMonth - 2,
     dayOfMonth,
killedBy: getAmbientContext detects weekend and month boundaries
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/AmbientContext.ts:31:33
     dayOfWeek,
     isWeekend: dayOfWeek === 0 || dayOfWeek === 6,
     isFirstOfMonth: dayOfMonth === 1,
-    isEndOfMonth: dayOfMonth >= daysInMonth - 2,
+    isEndOfMonth: dayOfMonth >= daysInMonth + 2,
     dayOfMonth,
     hour,
killedBy: getAmbientContext detects weekend and month boundaries
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/AmbientContext.ts:31:19
     dayOfWeek,
     isWeekend: dayOfWeek === 0 || dayOfWeek === 6,
     isFirstOfMonth: dayOfMonth === 1,
-    isEndOfMonth: dayOfMonth >= daysInMonth - 2,
+    isEndOfMonth: dayOfMonth < daysInMonth - 2,
     dayOfMonth,
     hour,
killedBy: getAmbientContext detects weekend and month boundaries
statusReason: expected false to be true // Object.is equality
