[Killed] ArrowFunction
src/services/fabric/BehavioralEngine.ts:32:46
     this.state.recentActions.push({ trigger, action, timestamp: nowIso });
     this.pruneRecentActions();
 
-    const pattern = this.state.patterns.find((item) => toSignature(item.trigger, item.followUpAction) === signature);
+    const pattern = this.state.patterns.find(() => undefined);
     const recentOccurrences = this.countRecentOccurrences(signature);
 
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected [ { …(10) }, { …(10) } ] to have a length of 1 but got 2

[Killed] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:32:56
     this.state.recentActions.push({ trigger, action, timestamp: nowIso });
     this.pruneRecentActions();
 
-    const pattern = this.state.patterns.find((item) => toSignature(item.trigger, item.followUpAction) === signature);
+    const pattern = this.state.patterns.find((item) => false);
     const recentOccurrences = this.countRecentOccurrences(signature);
 
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected [ { …(10) }, { …(10) } ] to have a length of 1 but got 2

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:35:18
     const pattern = this.state.patterns.find((item) => toSignature(item.trigger, item.followUpAction) === signature);
     const recentOccurrences = this.countRecentOccurrences(signature);
 
-    if (pattern) {
-      pattern.frequency += 1;
-      pattern.lastOccurred = nowIso;
-      pattern.updatedAt = nowIso;
-      pattern.confidence = calculateConfidence(pattern.frequency, pattern.dismissed, recentOccurrences);
-      this.syncConfirmedPattern(pattern);
-    } else {
+    if (pattern) {} else {
       const created: UserPattern = {
         id: crypto.randomUUID(),
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 1 to be 2 // Object.is equality

[Killed] AssignmentOperator
src/services/fabric/BehavioralEngine.ts:36:7
     const recentOccurrences = this.countRecentOccurrences(signature);
 
     if (pattern) {
-      pattern.frequency += 1;
+      pattern.frequency -= 1;
       pattern.lastOccurred = nowIso;
       pattern.updatedAt = nowIso;
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected +0 to be 2 // Object.is equality

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:41:12
       pattern.updatedAt = nowIso;
       pattern.confidence = calculateConfidence(pattern.frequency, pattern.dismissed, recentOccurrences);
       this.syncConfirmedPattern(pattern);
-    } else {
-      const created: UserPattern = {
-        id: crypto.randomUUID(),
-        trigger,
-        followUpAction: action,
-        frequency: 1,
-        confidence: calculateConfidence(1, 0, recentOccurrences),
-        lastOccurred: nowIso,
-        averageDelayMs: 0,
-        dismissed: 0,
-        createdAt: nowIso,
-        updatedAt: nowIso,
-      };
-      this.state.patterns.push(created);
-      this.syncConfirmedPattern(created);
-    }
+    } else {}
   }
 
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected [] to have a length of 1 but got +0

[NoCoverage] BlockStatement
src/services/fabric/BehavioralEngine.ts:59:43
     }
   }
 
-  dismissPattern(patternId: string): void {
-    const nowIso = this.nowProvider().toISOString();
-    this.state.dismissedPatterns = Array.from(new Set([...this.state.dismissedPatterns, patternId]));
-
-    const updatePattern = (pattern: UserPattern) => {
-      if (pattern.id !== patternId) return pattern;
-      const next = { ...pattern };
-      next.dismissed += 1;
-      next.updatedAt = nowIso;
-      next.confidence = calculateConfidence(next.frequency, next.dismissed, this.countRecentOccurrences(toSignature(next.trigger, next.followUpAction)));
-      return next;
-    };
-
-    this.state.patterns = this.state.patterns.map(updatePattern);
-    this.state.confirmedPatterns = this.state.confirmedPatterns.map(updatePattern).filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
-  }
+  dismissPattern(patternId: string): void {}
 
   deletePattern(patternId: string): void {

[NoCoverage] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:64:11
     this.state.dismissedPatterns = Array.from(new Set([...this.state.dismissedPatterns, patternId]));
 
     const updatePattern = (pattern: UserPattern) => {
-      if (pattern.id !== patternId) return pattern;
+      if (true) return pattern;
       const next = { ...pattern };
       next.dismissed += 1;

[NoCoverage] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:64:11
     this.state.dismissedPatterns = Array.from(new Set([...this.state.dismissedPatterns, patternId]));
 
     const updatePattern = (pattern: UserPattern) => {
-      if (pattern.id !== patternId) return pattern;
+      if (false) return pattern;
       const next = { ...pattern };
       next.dismissed += 1;

[NoCoverage] AssignmentOperator
src/services/fabric/BehavioralEngine.ts:66:7
     const updatePattern = (pattern: UserPattern) => {
       if (pattern.id !== patternId) return pattern;
       const next = { ...pattern };
-      next.dismissed += 1;
+      next.dismissed -= 1;
       next.updatedAt = nowIso;
       next.confidence = calculateConfidence(next.frequency, next.dismissed, this.countRecentOccurrences(toSignature(next.trigger, next.followUpAction)));

[NoCoverage] MethodExpression
src/services/fabric/BehavioralEngine.ts:73:36
     };
 
     this.state.patterns = this.state.patterns.map(updatePattern);
-    this.state.confirmedPatterns = this.state.confirmedPatterns.map(updatePattern).filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
+    this.state.confirmedPatterns = this.state.confirmedPatterns.map(updatePattern);
   }
 

[NoCoverage] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:73:104
     };
 
     this.state.patterns = this.state.patterns.map(updatePattern);
-    this.state.confirmedPatterns = this.state.confirmedPatterns.map(updatePattern).filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
+    this.state.confirmedPatterns = this.state.confirmedPatterns.map(updatePattern).filter((pattern) => true);
   }
 

[NoCoverage] BlockStatement
src/services/fabric/BehavioralEngine.ts:76:42
     this.state.confirmedPatterns = this.state.confirmedPatterns.map(updatePattern).filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
   }
 
-  deletePattern(patternId: string): void {
-    this.state.patterns = this.state.patterns.filter((pattern) => pattern.id !== patternId);
-    this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id !== patternId);
-    this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => id !== patternId);
-  }
+  deletePattern(patternId: string): void {}
 
   getPatterns(): UserPattern[] {

[NoCoverage] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:77:67
   }
 
   deletePattern(patternId: string): void {
-    this.state.patterns = this.state.patterns.filter((pattern) => pattern.id !== patternId);
+    this.state.patterns = this.state.patterns.filter((pattern) => true);
     this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id !== patternId);
     this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => id !== patternId);

[NoCoverage] EqualityOperator
src/services/fabric/BehavioralEngine.ts:77:67
   }
 
   deletePattern(patternId: string): void {
-    this.state.patterns = this.state.patterns.filter((pattern) => pattern.id !== patternId);
+    this.state.patterns = this.state.patterns.filter((pattern) => pattern.id === patternId);
     this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id !== patternId);
     this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => id !== patternId);

[NoCoverage] ArrowFunction
src/services/fabric/BehavioralEngine.ts:78:72
 
   deletePattern(patternId: string): void {
     this.state.patterns = this.state.patterns.filter((pattern) => pattern.id !== patternId);
-    this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id !== patternId);
+    this.state.confirmedPatterns = this.state.confirmedPatterns.filter(() => undefined);
     this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => id !== patternId);
   }

[NoCoverage] EqualityOperator
src/services/fabric/BehavioralEngine.ts:78:85
 
   deletePattern(patternId: string): void {
     this.state.patterns = this.state.patterns.filter((pattern) => pattern.id !== patternId);
-    this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id !== patternId);
+    this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id === patternId);
     this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => id !== patternId);
   }

[NoCoverage] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:79:80
   deletePattern(patternId: string): void {
     this.state.patterns = this.state.patterns.filter((pattern) => pattern.id !== patternId);
     this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id !== patternId);
-    this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => id !== patternId);
+    this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => true);
   }
 

[NoCoverage] ArrowFunction
src/services/fabric/BehavioralEngine.ts:79:72
   deletePattern(patternId: string): void {
     this.state.patterns = this.state.patterns.filter((pattern) => pattern.id !== patternId);
     this.state.confirmedPatterns = this.state.confirmedPatterns.filter((pattern) => pattern.id !== patternId);
-    this.state.dismissedPatterns = this.state.dismissedPatterns.filter((id) => id !== patternId);
+    this.state.dismissedPatterns = this.state.dismissedPatterns.filter(() => undefined);
   }
 

[Survived] MethodExpression
src/services/fabric/BehavioralEngine.ts:84:12
 
   getPatterns(): UserPattern[] {
     this.refreshConfidence();
-    return [...this.state.patterns].sort((a, b) => b.confidence - a.confidence);
+    return [...this.state.patterns];
   }
 

[Survived] ArithmeticOperator
src/services/fabric/BehavioralEngine.ts:84:52
 
   getPatterns(): UserPattern[] {
     this.refreshConfidence();
-    return [...this.state.patterns].sort((a, b) => b.confidence - a.confidence);
+    return [...this.state.patterns].sort((a, b) => b.confidence + a.confidence);
   }
 

[Survived] MethodExpression
src/services/fabric/BehavioralEngine.ts:89:12
 
   getConfirmedPatterns(): UserPattern[] {
     this.refreshConfidence();
-    return [...this.state.confirmedPatterns].sort((a, b) => b.confidence - a.confidence);
+    return [...this.state.confirmedPatterns];
   }
 

[NoCoverage] ArithmeticOperator
src/services/fabric/BehavioralEngine.ts:89:61
 
   getConfirmedPatterns(): UserPattern[] {
     this.refreshConfidence();
-    return [...this.state.confirmedPatterns].sort((a, b) => b.confidence - a.confidence);
+    return [...this.state.confirmedPatterns].sort((a, b) => b.confidence + a.confidence);
   }
 

[Killed] ArrayDeclaration
src/services/fabric/BehavioralEngine.ts:93:12
   }
 
   getRecentActions(): RecentAction[] {
-    return [...this.state.recentActions];
+    return [];
   }
 
killedBy: BehavioralEngine keeps recent actions bounded by TTL and max length
statusReason: expected [] to have a length of 100 but got +0

[Survived] BlockStatement
src/services/fabric/BehavioralEngine.ts:96:17
     return [...this.state.recentActions];
   }
 
-  reset(): void {
-    this.state = initialBehaviorState(this.nowProvider().toISOString());
-  }
+  reset(): void {}
 
   async loadBehavior(userId: string): Promise<void> {

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:100:53
     this.state = initialBehaviorState(this.nowProvider().toISOString());
   }
 
-  async loadBehavior(userId: string): Promise<void> {
-    const persisted = await secureDb.getDocument<BehaviorState>(userId, ['fabric_behavior', 'state']);
-    this.state = {
-      ...initialBehaviorState(this.nowProvider().toISOString()),
-      ...(persisted ?? {}),
-      patterns: persisted?.patterns ?? [],
-      confirmedPatterns: persisted?.confirmedPatterns ?? [],
-      recentActions: persisted?.recentActions ?? [],
-      dismissedPatterns: persisted?.dismissedPatterns ?? [],
-      updatedAt: persisted?.updatedAt ?? this.nowProvider().toISOString(),
-    };
-    this.pruneRecentActions();
-  }
+  async loadBehavior(userId: string): Promise<void> {}
 
   async saveBehavior(userId: string): Promise<void> {
killedBy: BehavioralEngine loads and saves behavior state via secureDb
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(1) ]

Number of calls: 0

[Killed] StringLiteral
src/services/fabric/BehavioralEngine.ts:101:93
   }
 
   async loadBehavior(userId: string): Promise<void> {
-    const persisted = await secureDb.getDocument<BehaviorState>(userId, ['fabric_behavior', 'state']);
+    const persisted = await secureDb.getDocument<BehaviorState>(userId, ['fabric_behavior', ""]);
     this.state = {
       ...initialBehaviorState(this.nowProvider().toISOString()),
killedBy: BehavioralEngine loads and saves behavior state via secureDb
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(1) ]

Received: 

  1st vi.fn() call:

  [
    "user-1",

[Survived] LogicalOperator
src/services/fabric/BehavioralEngine.ts:104:11
     const persisted = await secureDb.getDocument<BehaviorState>(userId, ['fabric_behavior', 'state']);
     this.state = {
       ...initialBehaviorState(this.nowProvider().toISOString()),
-      ...(persisted ?? {}),
+      ...(persisted && {}),
       patterns: persisted?.patterns ?? [],
       confirmedPatterns: persisted?.confirmedPatterns ?? [],

[Survived] ArrayDeclaration
src/services/fabric/BehavioralEngine.ts:108:58
       patterns: persisted?.patterns ?? [],
       confirmedPatterns: persisted?.confirmedPatterns ?? [],
       recentActions: persisted?.recentActions ?? [],
-      dismissedPatterns: persisted?.dismissedPatterns ?? [],
+      dismissedPatterns: persisted?.dismissedPatterns ?? ["Stryker was here"],
       updatedAt: persisted?.updatedAt ?? this.nowProvider().toISOString(),
     };

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:114:53
     this.pruneRecentActions();
   }
 
-  async saveBehavior(userId: string): Promise<void> {
-    this.state.updatedAt = this.nowProvider().toISOString();
-    await secureDb.setDocument(userId, ['fabric_behavior', 'state'], this.state as unknown as Record<string, unknown>);
-  }
+  async saveBehavior(userId: string): Promise<void> {}
 
   seedFromHistory(transactions: AnchorTransaction[], commitments: AnchorTask[]): void {
killedBy: FabricService debounces persistence when learnFrom is called rapidly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] StringLiteral
src/services/fabric/BehavioralEngine.ts:116:41
 
   async saveBehavior(userId: string): Promise<void> {
     this.state.updatedAt = this.nowProvider().toISOString();
-    await secureDb.setDocument(userId, ['fabric_behavior', 'state'], this.state as unknown as Record<string, unknown>);
+    await secureDb.setDocument(userId, ["", 'state'], this.state as unknown as Record<string, unknown>);
   }
 
killedBy: FabricService debounces persistence when learnFrom is called rapidly
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:119:87
     await secureDb.setDocument(userId, ['fabric_behavior', 'state'], this.state as unknown as Record<string, unknown>);
   }
 
-  seedFromHistory(transactions: AnchorTransaction[], commitments: AnchorTask[]): void {
-    const nowIso = this.nowProvider().toISOString();
-    const seededPatterns = buildSeedPatterns(transactions, commitments, nowIso);
-    seededPatterns.forEach((pattern) => this.upsertPattern(pattern));
-  }
+  seedFromHistory(transactions: AnchorTransaction[], commitments: AnchorTask[]): void {}
 
   private upsertPattern(pattern: UserPattern): void {
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
src/services/fabric/BehavioralEngine.ts:122:28
   seedFromHistory(transactions: AnchorTransaction[], commitments: AnchorTask[]): void {
     const nowIso = this.nowProvider().toISOString();
     const seededPatterns = buildSeedPatterns(transactions, commitments, nowIso);
-    seededPatterns.forEach((pattern) => this.upsertPattern(pattern));
+    seededPatterns.forEach(() => undefined);
   }
 
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:125:53
     seededPatterns.forEach((pattern) => this.upsertPattern(pattern));
   }
 
-  private upsertPattern(pattern: UserPattern): void {
-    const index = this.state.patterns.findIndex((item) => item.id === pattern.id);
-    if (index >= 0) {
-      this.state.patterns[index] = pattern;
-    } else {
-      this.state.patterns.push(pattern);
-    }
-    this.syncConfirmedPattern(pattern);
-  }
+  private upsertPattern(pattern: UserPattern): void {}
 
   private syncConfirmedPattern(pattern: UserPattern): void {
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected 0 to be greater than 0

[Killed] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:126:59
   }
 
   private upsertPattern(pattern: UserPattern): void {
-    const index = this.state.patterns.findIndex((item) => item.id === pattern.id);
+    const index = this.state.patterns.findIndex((item) => true);
     if (index >= 0) {
       this.state.patterns[index] = pattern;
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/BehavioralEngine.ts:126:59
   }
 
   private upsertPattern(pattern: UserPattern): void {
-    const index = this.state.patterns.findIndex((item) => item.id === pattern.id);
+    const index = this.state.patterns.findIndex((item) => item.id !== pattern.id);
     if (index >= 0) {
       this.state.patterns[index] = pattern;
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:127:9
 
   private upsertPattern(pattern: UserPattern): void {
     const index = this.state.patterns.findIndex((item) => item.id === pattern.id);
-    if (index >= 0) {
+    if (true) {
       this.state.patterns[index] = pattern;
     } else {
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/services/fabric/BehavioralEngine.ts:127:9
 
   private upsertPattern(pattern: UserPattern): void {
     const index = this.state.patterns.findIndex((item) => item.id === pattern.id);
-    if (index >= 0) {
+    if (index < 0) {
       this.state.patterns[index] = pattern;
     } else {
killedBy: FabricService seeds history on first initialize when behavior store is empty
statusReason: expected 0 to be greater than 0

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:129:12
     const index = this.state.patterns.findIndex((item) => item.id === pattern.id);
     if (index >= 0) {
       this.state.patterns[index] = pattern;
-    } else {
-      this.state.patterns.push(pattern);
-    }
+    } else {}
     this.syncConfirmedPattern(pattern);
   }
killedBy: FabricService seeds history on first initialize when behavior store is empty
statusReason: expected 0 to be greater than 0

[Survived] BlockStatement
src/services/fabric/BehavioralEngine.ts:135:60
     this.syncConfirmedPattern(pattern);
   }
 
-  private syncConfirmedPattern(pattern: UserPattern): void {
-    const index = this.state.confirmedPatterns.findIndex((item) => item.id === pattern.id);
-    if (pattern.confidence > CONFIRMED_THRESHOLD) {
-      if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };
-      else this.state.confirmedPatterns.push({ ...pattern });
-    } else if (index >= 0) {
-      this.state.confirmedPatterns.splice(index, 1);
-    }
-  }
+  private syncConfirmedPattern(pattern: UserPattern): void {}
 
   private refreshConfidence(): void {

[Survived] ArrowFunction
src/services/fabric/BehavioralEngine.ts:136:58
   }
 
   private syncConfirmedPattern(pattern: UserPattern): void {
-    const index = this.state.confirmedPatterns.findIndex((item) => item.id === pattern.id);
+    const index = this.state.confirmedPatterns.findIndex(() => undefined);
     if (pattern.confidence > CONFIRMED_THRESHOLD) {
       if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };

[Survived] EqualityOperator
src/services/fabric/BehavioralEngine.ts:136:68
   }
 
   private syncConfirmedPattern(pattern: UserPattern): void {
-    const index = this.state.confirmedPatterns.findIndex((item) => item.id === pattern.id);
+    const index = this.state.confirmedPatterns.findIndex((item) => item.id !== pattern.id);
     if (pattern.confidence > CONFIRMED_THRESHOLD) {
       if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };

[Survived] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:137:9
 
   private syncConfirmedPattern(pattern: UserPattern): void {
     const index = this.state.confirmedPatterns.findIndex((item) => item.id === pattern.id);
-    if (pattern.confidence > CONFIRMED_THRESHOLD) {
+    if (false) {
       if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };
       else this.state.confirmedPatterns.push({ ...pattern });

[Survived] EqualityOperator
src/services/fabric/BehavioralEngine.ts:137:9
 
   private syncConfirmedPattern(pattern: UserPattern): void {
     const index = this.state.confirmedPatterns.findIndex((item) => item.id === pattern.id);
-    if (pattern.confidence > CONFIRMED_THRESHOLD) {
+    if (pattern.confidence >= CONFIRMED_THRESHOLD) {
       if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };
       else this.state.confirmedPatterns.push({ ...pattern });

[Survived] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:138:11
   private syncConfirmedPattern(pattern: UserPattern): void {
     const index = this.state.confirmedPatterns.findIndex((item) => item.id === pattern.id);
     if (pattern.confidence > CONFIRMED_THRESHOLD) {
-      if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };
+      if (false) this.state.confirmedPatterns[index] = { ...pattern };
       else this.state.confirmedPatterns.push({ ...pattern });
     } else if (index >= 0) {

[Survived] EqualityOperator
src/services/fabric/BehavioralEngine.ts:138:11
   private syncConfirmedPattern(pattern: UserPattern): void {
     const index = this.state.confirmedPatterns.findIndex((item) => item.id === pattern.id);
     if (pattern.confidence > CONFIRMED_THRESHOLD) {
-      if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };
+      if (index < 0) this.state.confirmedPatterns[index] = { ...pattern };
       else this.state.confirmedPatterns.push({ ...pattern });
     } else if (index >= 0) {

[NoCoverage] BlockStatement
src/services/fabric/BehavioralEngine.ts:140:28
     if (pattern.confidence > CONFIRMED_THRESHOLD) {
       if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };
       else this.state.confirmedPatterns.push({ ...pattern });
-    } else if (index >= 0) {
-      this.state.confirmedPatterns.splice(index, 1);
-    }
+    } else if (index >= 0) {}
   }
 

[Survived] EqualityOperator
src/services/fabric/BehavioralEngine.ts:140:16
     if (pattern.confidence > CONFIRMED_THRESHOLD) {
       if (index >= 0) this.state.confirmedPatterns[index] = { ...pattern };
       else this.state.confirmedPatterns.push({ ...pattern });
-    } else if (index >= 0) {
+    } else if (index > 0) {
       this.state.confirmedPatterns.splice(index, 1);
     }

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:145:37
     }
   }
 
-  private refreshConfidence(): void {
-    this.pruneRecentActions();
-    this.state.patterns = this.state.patterns.map((pattern) => {
-      const signature = toSignature(pattern.trigger, pattern.followUpAction);
-      return {
-        ...pattern,
-        confidence: calculateConfidence(pattern.frequency, pattern.dismissed, this.countRecentOccurrences(signature)),
-      };
-    });
-    this.state.confirmedPatterns = this.state.patterns.filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
-  }
+  private refreshConfidence(): void {}
 
   private pruneRecentActions(): void {
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected 0.6 to be greater than 0.7143

[Killed] ArrowFunction
src/services/fabric/BehavioralEngine.ts:154:63
         confidence: calculateConfidence(pattern.frequency, pattern.dismissed, this.countRecentOccurrences(signature)),
       };
     });
-    this.state.confirmedPatterns = this.state.patterns.filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
+    this.state.confirmedPatterns = this.state.patterns.filter(() => undefined);
   }
 
killedBy: BehavioralEngine promotes patterns above confidence threshold to confirmedPatterns
statusReason: expected [] to have a length of 1 but got +0

[Killed] EqualityOperator
src/services/fabric/BehavioralEngine.ts:154:76
         confidence: calculateConfidence(pattern.frequency, pattern.dismissed, this.countRecentOccurrences(signature)),
       };
     });
-    this.state.confirmedPatterns = this.state.patterns.filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
+    this.state.confirmedPatterns = this.state.patterns.filter((pattern) => pattern.confidence <= CONFIRMED_THRESHOLD);
   }
 
killedBy: BehavioralEngine promotes patterns above confidence threshold to confirmedPatterns
statusReason: expected [] to have a length of 1 but got +0

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:157:38
     this.state.confirmedPatterns = this.state.patterns.filter((pattern) => pattern.confidence > CONFIRMED_THRESHOLD);
   }
 
-  private pruneRecentActions(): void {
-    const nowMs = this.nowProvider().getTime();
-    const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
-    this.state.recentActions = this.state.recentActions
-      .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)
-      .slice(-MAX_RECENT_ACTIONS);
-  }
+  private pruneRecentActions(): void {}
 
   private countRecentOccurrences(signature: string): number {
killedBy: BehavioralEngine keeps recent actions bounded by TTL and max length
statusReason: expected [ { …(3) }, …(120) ] to have a length of 100 but got 121

[Survived] ArithmeticOperator
src/services/fabric/BehavioralEngine.ts:159:19
 
   private pruneRecentActions(): void {
     const nowMs = this.nowProvider().getTime();
-    const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
+    const ttlMs = RECENT_ACTION_TTL_DAYS / 24 * 60 * 60 * 1000;
     this.state.recentActions = this.state.recentActions
       .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)

[Survived] ArithmeticOperator
src/services/fabric/BehavioralEngine.ts:159:19
 
   private pruneRecentActions(): void {
     const nowMs = this.nowProvider().getTime();
-    const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
+    const ttlMs = RECENT_ACTION_TTL_DAYS * 24 / 60 * 60 * 1000;
     this.state.recentActions = this.state.recentActions
       .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)

[Killed] MethodExpression
src/services/fabric/BehavioralEngine.ts:160:32
   private pruneRecentActions(): void {
     const nowMs = this.nowProvider().getTime();
     const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
-    this.state.recentActions = this.state.recentActions
-      .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)
-      .slice(-MAX_RECENT_ACTIONS);
+    this.state.recentActions = this.state.recentActions.filter(entry => nowMs - Date.parse(entry.timestamp) <= ttlMs);
   }
 
killedBy: BehavioralEngine keeps recent actions bounded by TTL and max length
statusReason: expected [ { trigger: { …(2) }, …(2) }, …(119) ] to have a length of 100 but got 120

[Survived] MethodExpression
src/services/fabric/BehavioralEngine.ts:160:32
   private pruneRecentActions(): void {
     const nowMs = this.nowProvider().getTime();
     const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
-    this.state.recentActions = this.state.recentActions
-      .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)
+    this.state.recentActions = this.state.recentActions
       .slice(-MAX_RECENT_ACTIONS);
   }

[Killed] EqualityOperator
src/services/fabric/BehavioralEngine.ts:161:26
     const nowMs = this.nowProvider().getTime();
     const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
     this.state.recentActions = this.state.recentActions
-      .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)
+      .filter((entry) => nowMs - Date.parse(entry.timestamp) > ttlMs)
       .slice(-MAX_RECENT_ACTIONS);
   }
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4
