[Killed] ArrowFunction
src/services/fabric/BehavioralEngine.ts:161:15
     const nowMs = this.nowProvider().getTime();
     const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
     this.state.recentActions = this.state.recentActions
-      .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)
+      .filter(() => undefined)
       .slice(-MAX_RECENT_ACTIONS);
   }
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] UnaryOperator
src/services/fabric/BehavioralEngine.ts:162:14
     const ttlMs = RECENT_ACTION_TTL_DAYS * 24 * 60 * 60 * 1000;
     this.state.recentActions = this.state.recentActions
       .filter((entry) => nowMs - Date.parse(entry.timestamp) <= ttlMs)
-      .slice(-MAX_RECENT_ACTIONS);
+      .slice(+MAX_RECENT_ACTIONS);
   }
 
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] ArithmeticOperator
src/services/fabric/BehavioralEngine.ts:166:22
   }
 
   private countRecentOccurrences(signature: string): number {
-    const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
+    const cutoffMs = this.nowProvider().getTime() + RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
     return this.state.recentActions.filter((entry) => {
       if (Date.parse(entry.timestamp) < cutoffMs) return false;
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Survived] ArithmeticOperator
src/services/fabric/BehavioralEngine.ts:166:53
   }
 
   private countRecentOccurrences(signature: string): number {
-    const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
+    const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 / 60 * 1000;
     return this.state.recentActions.filter((entry) => {
       if (Date.parse(entry.timestamp) < cutoffMs) return false;

[Killed] MethodExpression
src/services/fabric/BehavioralEngine.ts:167:12
 
   private countRecentOccurrences(signature: string): number {
     const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
-    return this.state.recentActions.filter((entry) => {
-      if (Date.parse(entry.timestamp) < cutoffMs) return false;
-      return toSignature(entry.trigger, entry.action) === signature;
-    }).length;
+    return this.state.recentActions.length;
   }
 }
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected 0.6 to be greater than 0.6286

[Killed] BlockStatement
src/services/fabric/BehavioralEngine.ts:167:55
 
   private countRecentOccurrences(signature: string): number {
     const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
-    return this.state.recentActions.filter((entry) => {
-      if (Date.parse(entry.timestamp) < cutoffMs) return false;
-      return toSignature(entry.trigger, entry.action) === signature;
-    }).length;
+    return this.state.recentActions.filter((entry) => {}).length;
   }
 }
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] EqualityOperator
src/services/fabric/BehavioralEngine.ts:168:11
   private countRecentOccurrences(signature: string): number {
     const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
     return this.state.recentActions.filter((entry) => {
-      if (Date.parse(entry.timestamp) < cutoffMs) return false;
+      if (Date.parse(entry.timestamp) >= cutoffMs) return false;
       return toSignature(entry.trigger, entry.action) === signature;
     }).length;
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:168:11
   private countRecentOccurrences(signature: string): number {
     const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
     return this.state.recentActions.filter((entry) => {
-      if (Date.parse(entry.timestamp) < cutoffMs) return false;
+      if (true) return false;
       return toSignature(entry.trigger, entry.action) === signature;
     }).length;
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] ConditionalExpression
src/services/fabric/BehavioralEngine.ts:169:14
     const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
     return this.state.recentActions.filter((entry) => {
       if (Date.parse(entry.timestamp) < cutoffMs) return false;
-      return toSignature(entry.trigger, entry.action) === signature;
+      return false;
     }).length;
   }
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] EqualityOperator
src/services/fabric/BehavioralEngine.ts:169:14
     const cutoffMs = this.nowProvider().getTime() - RECENCY_WINDOW_DAYS * 24 * 60 * 60 * 1000;
     return this.state.recentActions.filter((entry) => {
       if (Date.parse(entry.timestamp) < cutoffMs) return false;
-      return toSignature(entry.trigger, entry.action) === signature;
+      return toSignature(entry.trigger, entry.action) !== signature;
     }).length;
   }
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4
