[NoCoverage] BlockStatement
src/services/fabric/DailyBriefingEngine.ts:13:39
   const dayIdx = now.getDay();
   const dayLetter = DAY_LETTERS[dayIdx];
 
-  return commitments.filter((task) => {
-    if (task.type === 'daily') return true;
-    if (task.type === 'todo') return true; // show all outstanding todos
-    if (task.type === 'weekly') {
-      // daysOfWeek is an array like ['M','T','F'] – match on letter
-      return task.daysOfWeek?.includes(dayLetter) ?? false;
-    }
-    if (task.type === 'monthly') {
-      const dom = now.getDate();
-      if (task.daysOfMonth?.length) return task.daysOfMonth.includes(dom);
-      if (task.dayOfMonth) return task.dayOfMonth === dom;
-    }
-    return false;
-  });
+  return commitments.filter((task) => {});
 }
 

[NoCoverage] MethodExpression
src/services/fabric/DailyBriefingEngine.ts:13:10
   const dayIdx = now.getDay();
   const dayLetter = DAY_LETTERS[dayIdx];
 
-  return commitments.filter((task) => {
-    if (task.type === 'daily') return true;
-    if (task.type === 'todo') return true; // show all outstanding todos
-    if (task.type === 'weekly') {
-      // daysOfWeek is an array like ['M','T','F'] – match on letter
-      return task.daysOfWeek?.includes(dayLetter) ?? false;
-    }
-    if (task.type === 'monthly') {
-      const dom = now.getDate();
-      if (task.daysOfMonth?.length) return task.daysOfMonth.includes(dom);
-      if (task.dayOfMonth) return task.dayOfMonth === dom;
-    }
-    return false;
-  });
+  return commitments;
 }
 

[NoCoverage] BooleanLiteral
src/services/fabric/DailyBriefingEngine.ts:14:39
   const dayLetter = DAY_LETTERS[dayIdx];
 
   return commitments.filter((task) => {
-    if (task.type === 'daily') return true;
+    if (task.type === 'daily') return false;
     if (task.type === 'todo') return true; // show all outstanding todos
     if (task.type === 'weekly') {

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:14:9
   const dayLetter = DAY_LETTERS[dayIdx];
 
   return commitments.filter((task) => {
-    if (task.type === 'daily') return true;
+    if (false) return true;
     if (task.type === 'todo') return true; // show all outstanding todos
     if (task.type === 'weekly') {

[NoCoverage] BooleanLiteral
src/services/fabric/DailyBriefingEngine.ts:15:38
 
   return commitments.filter((task) => {
     if (task.type === 'daily') return true;
-    if (task.type === 'todo') return true; // show all outstanding todos
+    if (task.type === 'todo') return false; // show all outstanding todos
     if (task.type === 'weekly') {
       // daysOfWeek is an array like ['M','T','F'] – match on letter

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:15:9
 
   return commitments.filter((task) => {
     if (task.type === 'daily') return true;
-    if (task.type === 'todo') return true; // show all outstanding todos
+    if (false) return true; // show all outstanding todos
     if (task.type === 'weekly') {
       // daysOfWeek is an array like ['M','T','F'] – match on letter

[NoCoverage] BlockStatement
src/services/fabric/DailyBriefingEngine.ts:16:33
   return commitments.filter((task) => {
     if (task.type === 'daily') return true;
     if (task.type === 'todo') return true; // show all outstanding todos
-    if (task.type === 'weekly') {
-      // daysOfWeek is an array like ['M','T','F'] – match on letter
-      return task.daysOfWeek?.includes(dayLetter) ?? false;
-    }
+    if (task.type === 'weekly') {}
     if (task.type === 'monthly') {
       const dom = now.getDate();

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:16:9
   return commitments.filter((task) => {
     if (task.type === 'daily') return true;
     if (task.type === 'todo') return true; // show all outstanding todos
-    if (task.type === 'weekly') {
+    if (false) {
       // daysOfWeek is an array like ['M','T','F'] – match on letter
       return task.daysOfWeek?.includes(dayLetter) ?? false;

[NoCoverage] BooleanLiteral
src/services/fabric/DailyBriefingEngine.ts:18:54
     if (task.type === 'todo') return true; // show all outstanding todos
     if (task.type === 'weekly') {
       // daysOfWeek is an array like ['M','T','F'] – match on letter
-      return task.daysOfWeek?.includes(dayLetter) ?? false;
+      return task.daysOfWeek?.includes(dayLetter) ?? true;
     }
     if (task.type === 'monthly') {

[NoCoverage] LogicalOperator
src/services/fabric/DailyBriefingEngine.ts:18:14
     if (task.type === 'todo') return true; // show all outstanding todos
     if (task.type === 'weekly') {
       // daysOfWeek is an array like ['M','T','F'] – match on letter
-      return task.daysOfWeek?.includes(dayLetter) ?? false;
+      return task.daysOfWeek?.includes(dayLetter) && false;
     }
     if (task.type === 'monthly') {

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:20:9
       // daysOfWeek is an array like ['M','T','F'] – match on letter
       return task.daysOfWeek?.includes(dayLetter) ?? false;
     }
-    if (task.type === 'monthly') {
+    if (true) {
       const dom = now.getDate();
       if (task.daysOfMonth?.length) return task.daysOfMonth.includes(dom);

[NoCoverage] BlockStatement
src/services/fabric/DailyBriefingEngine.ts:20:34
       // daysOfWeek is an array like ['M','T','F'] – match on letter
       return task.daysOfWeek?.includes(dayLetter) ?? false;
     }
-    if (task.type === 'monthly') {
-      const dom = now.getDate();
-      if (task.daysOfMonth?.length) return task.daysOfMonth.includes(dom);
-      if (task.dayOfMonth) return task.dayOfMonth === dom;
-    }
+    if (task.type === 'monthly') {}
     return false;
   });

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:23:35
     if (task.type === 'monthly') {
       const dom = now.getDate();
       if (task.daysOfMonth?.length) return task.daysOfMonth.includes(dom);
-      if (task.dayOfMonth) return task.dayOfMonth === dom;
+      if (task.dayOfMonth) return false;
     }
     return false;

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:23:35
     if (task.type === 'monthly') {
       const dom = now.getDate();
       if (task.daysOfMonth?.length) return task.daysOfMonth.includes(dom);
-      if (task.dayOfMonth) return task.dayOfMonth === dom;
+      if (task.dayOfMonth) return true;
     }
     return false;

[NoCoverage] MethodExpression
src/services/fabric/DailyBriefingEngine.ts:39:3
   todayMidnight.setHours(0, 0, 0, 0);
 
   const cutoff = new Date(todayMidnight);
-  cutoff.setDate(cutoff.getDate() + windowDays);
+  cutoff.setTime(cutoff.getDate() + windowDays);
 
   const MS_PER_DAY = 24 * 60 * 60 * 1000;

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:39:18
   todayMidnight.setHours(0, 0, 0, 0);
 
   const cutoff = new Date(todayMidnight);
-  cutoff.setDate(cutoff.getDate() + windowDays);
+  cutoff.setDate(cutoff.getDate() - windowDays);
 
   const MS_PER_DAY = 24 * 60 * 60 * 1000;

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:41:22
   const cutoff = new Date(todayMidnight);
   cutoff.setDate(cutoff.getDate() + windowDays);
 
-  const MS_PER_DAY = 24 * 60 * 60 * 1000;
+  const MS_PER_DAY = 24 * 60 / 60 * 1000;
 
   return recurring

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:41:22
   const cutoff = new Date(todayMidnight);
   cutoff.setDate(cutoff.getDate() + windowDays);
 
-  const MS_PER_DAY = 24 * 60 * 60 * 1000;
+  const MS_PER_DAY = 24 / 60 * 60 * 1000;
 
   return recurring

[NoCoverage] MethodExpression
src/services/fabric/DailyBriefingEngine.ts:43:10
 
   const MS_PER_DAY = 24 * 60 * 60 * 1000;
 
-  return recurring
-    .filter((r) => r.status === 'active')
+  return recurring
     .reduce<UpcomingItem[]>((acc, r) => {
       const due = toDate(r.nextRunAt);

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:44:20
   const MS_PER_DAY = 24 * 60 * 60 * 1000;
 
   return recurring
-    .filter((r) => r.status === 'active')
+    .filter((r) => false)
     .reduce<UpcomingItem[]>((acc, r) => {
       const due = toDate(r.nextRunAt);

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:44:20
   const MS_PER_DAY = 24 * 60 * 60 * 1000;
 
   return recurring
-    .filter((r) => r.status === 'active')
+    .filter((r) => true)
     .reduce<UpcomingItem[]>((acc, r) => {
       const due = toDate(r.nextRunAt);

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:47:19
     .filter((r) => r.status === 'active')
     .reduce<UpcomingItem[]>((acc, r) => {
       const due = toDate(r.nextRunAt);
-      if (!due || due > cutoff) return acc;
+      if (!due || false) return acc;
 
       const dueMidnight = new Date(due);

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:47:19
     .filter((r) => r.status === 'active')
     .reduce<UpcomingItem[]>((acc, r) => {
       const due = toDate(r.nextRunAt);
-      if (!due || due > cutoff) return acc;
+      if (!due || due >= cutoff) return acc;
 
       const dueMidnight = new Date(due);

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:51:37
 
       const dueMidnight = new Date(due);
       dueMidnight.setHours(0, 0, 0, 0);
-      const daysUntil = Math.round((dueMidnight.getTime() - todayMidnight.getTime()) / MS_PER_DAY);
+      const daysUntil = Math.round((dueMidnight.getTime() + todayMidnight.getTime()) / MS_PER_DAY);
       if (daysUntil < 0) return acc; // already passed
 

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:51:36
 
       const dueMidnight = new Date(due);
       dueMidnight.setHours(0, 0, 0, 0);
-      const daysUntil = Math.round((dueMidnight.getTime() - todayMidnight.getTime()) / MS_PER_DAY);
+      const daysUntil = Math.round((dueMidnight.getTime() - todayMidnight.getTime()) * MS_PER_DAY);
       if (daysUntil < 0) return acc; // already passed
 

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:52:11
       const dueMidnight = new Date(due);
       dueMidnight.setHours(0, 0, 0, 0);
       const daysUntil = Math.round((dueMidnight.getTime() - todayMidnight.getTime()) / MS_PER_DAY);
-      if (daysUntil < 0) return acc; // already passed
+      if (daysUntil <= 0) return acc; // already passed
 
       acc.push({

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:52:11
       const dueMidnight = new Date(due);
       dueMidnight.setHours(0, 0, 0, 0);
       const daysUntil = Math.round((dueMidnight.getTime() - todayMidnight.getTime()) / MS_PER_DAY);
-      if (daysUntil < 0) return acc; // already passed
+      if (false) return acc; // already passed
 
       acc.push({

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:62:18
         amountCents: r.amountCents,
         currency: undefined,
         category: r.category,
-        isToday: daysUntil === 0,
+        isToday: false,
         isTomorrow: daysUntil === 1,
         daysUntil,

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:62:18
         amountCents: r.amountCents,
         currency: undefined,
         category: r.category,
-        isToday: daysUntil === 0,
+        isToday: true,
         isTomorrow: daysUntil === 1,
         daysUntil,

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:63:21
         currency: undefined,
         category: r.category,
         isToday: daysUntil === 0,
-        isTomorrow: daysUntil === 1,
+        isTomorrow: false,
         daysUntil,
       });

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:63:21
         currency: undefined,
         category: r.category,
         isToday: daysUntil === 0,
-        isTomorrow: daysUntil === 1,
+        isTomorrow: daysUntil !== 1,
         daysUntil,
       });

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:68:21
       });
       return acc;
     }, [])
-    .sort((a, b) => a.daysUntil - b.daysUntil);
+    .sort((a, b) => a.daysUntil + b.daysUntil);
 }
 

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:74:7
 function buildSubtitle(todayStats: TodayStats, upcoming: UpcomingItem[]): string {
   const parts: string[] = [];
 
-  if (todayStats.totalTasks > 0) {
+  if (false) {
     if (todayStats.pendingTasks === 0) {
       parts.push('All tasks done today');

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:74:7
 function buildSubtitle(todayStats: TodayStats, upcoming: UpcomingItem[]): string {
   const parts: string[] = [];
 
-  if (todayStats.totalTasks > 0) {
+  if (todayStats.totalTasks <= 0) {
     if (todayStats.pendingTasks === 0) {
       parts.push('All tasks done today');

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:75:9
   const parts: string[] = [];
 
   if (todayStats.totalTasks > 0) {
-    if (todayStats.pendingTasks === 0) {
+    if (true) {
       parts.push('All tasks done today');
     } else {

[NoCoverage] BlockStatement
src/services/fabric/DailyBriefingEngine.ts:75:40
   const parts: string[] = [];
 
   if (todayStats.totalTasks > 0) {
-    if (todayStats.pendingTasks === 0) {
-      parts.push('All tasks done today');
-    } else {
+    if (todayStats.pendingTasks === 0) {} else {
       parts.push(`${todayStats.pendingTasks} task${todayStats.pendingTasks === 1 ? '' : 's'} remaining`);
     }

[NoCoverage] StringLiteral
src/services/fabric/DailyBriefingEngine.ts:76:18
 
   if (todayStats.totalTasks > 0) {
     if (todayStats.pendingTasks === 0) {
-      parts.push('All tasks done today');
+      parts.push("");
     } else {
       parts.push(`${todayStats.pendingTasks} task${todayStats.pendingTasks === 1 ? '' : 's'} remaining`);

[NoCoverage] BlockStatement
src/services/fabric/DailyBriefingEngine.ts:77:12
   if (todayStats.totalTasks > 0) {
     if (todayStats.pendingTasks === 0) {
       parts.push('All tasks done today');
-    } else {
-      parts.push(`${todayStats.pendingTasks} task${todayStats.pendingTasks === 1 ? '' : 's'} remaining`);
-    }
+    } else {}
   }
 

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:78:52
     if (todayStats.pendingTasks === 0) {
       parts.push('All tasks done today');
     } else {
-      parts.push(`${todayStats.pendingTasks} task${todayStats.pendingTasks === 1 ? '' : 's'} remaining`);
+      parts.push(`${todayStats.pendingTasks} task${true ? '' : 's'} remaining`);
     }
   }

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:78:52
     if (todayStats.pendingTasks === 0) {
       parts.push('All tasks done today');
     } else {
-      parts.push(`${todayStats.pendingTasks} task${todayStats.pendingTasks === 1 ? '' : 's'} remaining`);
+      parts.push(`${todayStats.pendingTasks} task${todayStats.pendingTasks !== 1 ? '' : 's'} remaining`);
     }
   }

[NoCoverage] BlockStatement
src/services/fabric/DailyBriefingEngine.ts:82:35
     }
   }
 
-  if (todayStats.streakHighlight) {
-    parts.push(`${todayStats.streakHighlight.days}-day streak`);
-  }
+  if (todayStats.streakHighlight) {}
 
   const nextBill = upcoming.at(0);

[NoCoverage] BlockStatement
src/services/fabric/DailyBriefingEngine.ts:87:17
   }
 
   const nextBill = upcoming.at(0);
-  if (nextBill) {
-    const when = nextBill.isToday ? 'today' : nextBill.isTomorrow ? 'tomorrow' : `in ${nextBill.daysUntil}d`;
-    parts.push(`${nextBill.title} due ${when}`);
-  }
+  if (nextBill) {}
 
   return parts.join(' · ') || 'Your personal AI companion';

[NoCoverage] StringLiteral
src/services/fabric/DailyBriefingEngine.ts:89:16
   const nextBill = upcoming.at(0);
   if (nextBill) {
     const when = nextBill.isToday ? 'today' : nextBill.isTomorrow ? 'tomorrow' : `in ${nextBill.daysUntil}d`;
-    parts.push(`${nextBill.title} due ${when}`);
+    parts.push(``);
   }
 

[NoCoverage] LogicalOperator
src/services/fabric/DailyBriefingEngine.ts:92:10
     parts.push(`${nextBill.title} due ${when}`);
   }
 
-  return parts.join(' · ') || 'Your personal AI companion';
+  return parts.join(' · ') && 'Your personal AI companion';
 }
 

[NoCoverage] ObjectLiteral
src/services/fabric/DailyBriefingEngine.ts:105:47
   const currency = detectPrimaryCurrency(transactions);
 
   // Greeting
-  const greetingMap: Record<string, string> = {
-    morning: 'Good morning',
-    afternoon: 'Good afternoon',
-    evening: 'Good evening',
-  };
+  const greetingMap: Record<string, string> = {};
   const greeting = greetingMap[timeOfDay] ?? 'Hello';
 

[NoCoverage] StringLiteral
src/services/fabric/DailyBriefingEngine.ts:106:14
 
   // Greeting
   const greetingMap: Record<string, string> = {
-    morning: 'Good morning',
+    morning: "",
     afternoon: 'Good afternoon',
     evening: 'Good evening',

[NoCoverage] StringLiteral
src/services/fabric/DailyBriefingEngine.ts:108:14
   const greetingMap: Record<string, string> = {
     morning: 'Good morning',
     afternoon: 'Good afternoon',
-    evening: 'Good evening',
+    evening: "",
   };
   const greeting = greetingMap[timeOfDay] ?? 'Hello';

[NoCoverage] LogicalOperator
src/services/fabric/DailyBriefingEngine.ts:110:20
     afternoon: 'Good afternoon',
     evening: 'Good evening',
   };
-  const greeting = greetingMap[timeOfDay] ?? 'Hello';
+  const greeting = greetingMap[timeOfDay] && 'Hello';
 
   // Today's tasks

[NoCoverage] StringLiteral
src/services/fabric/DailyBriefingEngine.ts:110:46
     afternoon: 'Good afternoon',
     evening: 'Good evening',
   };
-  const greeting = greetingMap[timeOfDay] ?? 'Hello';
+  const greeting = greetingMap[timeOfDay] ?? "";
 
   // Today's tasks

[NoCoverage] MethodExpression
src/services/fabric/DailyBriefingEngine.ts:114:26
 
   // Today's tasks
   const todayTasks = getTodayTasks(commitments, now);
-  const completedTasks = todayTasks.filter((t) => t.completed).length;
+  const completedTasks = todayTasks.length;
   const pendingTasks = todayTasks.length - completedTasks;
 

[NoCoverage] ArrowFunction
src/services/fabric/DailyBriefingEngine.ts:114:44
 
   // Today's tasks
   const todayTasks = getTodayTasks(commitments, now);
-  const completedTasks = todayTasks.filter((t) => t.completed).length;
+  const completedTasks = todayTasks.filter(() => undefined).length;
   const pendingTasks = todayTasks.length - completedTasks;
 

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:115:24
   // Today's tasks
   const todayTasks = getTodayTasks(commitments, now);
   const completedTasks = todayTasks.filter((t) => t.completed).length;
-  const pendingTasks = todayTasks.length - completedTasks;
+  const pendingTasks = todayTasks.length + completedTasks;
 
   // Best active streak (>= 3 days)

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:120:9
   // Best active streak (>= 3 days)
   const streakTask = commitments.reduce<AnchorTask | null>((best, t) => {
     const s = t.currentStreak ?? 0;
-    if (s < 3) return best;
+    if (s <= 3) return best;
     return !best || s > (best.currentStreak ?? 0) ? t : best;
   }, null);

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:120:9
   // Best active streak (>= 3 days)
   const streakTask = commitments.reduce<AnchorTask | null>((best, t) => {
     const s = t.currentStreak ?? 0;
-    if (s < 3) return best;
+    if (false) return best;
     return !best || s > (best.currentStreak ?? 0) ? t : best;
   }, null);

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:121:21
   const streakTask = commitments.reduce<AnchorTask | null>((best, t) => {
     const s = t.currentStreak ?? 0;
     if (s < 3) return best;
-    return !best || s > (best.currentStreak ?? 0) ? t : best;
+    return !best || s <= (best.currentStreak ?? 0) ? t : best;
   }, null);
 

[NoCoverage] ConditionalExpression
src/services/fabric/DailyBriefingEngine.ts:121:12
   const streakTask = commitments.reduce<AnchorTask | null>((best, t) => {
     const s = t.currentStreak ?? 0;
     if (s < 3) return best;
-    return !best || s > (best.currentStreak ?? 0) ? t : best;
+    return true ? t : best;
   }, null);
 

[NoCoverage] MethodExpression
src/services/fabric/DailyBriefingEngine.ts:138:28
 
   // This week's spending
   const { start: weekStart, end: weekEnd } = getDateRange('this_week', now);
-  const spendingThisWeek = transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, weekStart, weekEnd))
+  const spendingThisWeek = transactions
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[NoCoverage] EqualityOperator
src/services/fabric/DailyBriefingEngine.ts:139:21
   // This week's spending
   const { start: weekStart, end: weekEnd } = getDateRange('this_week', now);
   const spendingThisWeek = transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, weekStart, weekEnd))
+    .filter((tx) => tx.type !== 'expense' && !tx.isSoftDeleted && withinRange(tx.date, weekStart, weekEnd))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[NoCoverage] ArrowFunction
src/services/fabric/DailyBriefingEngine.ts:139:13
   // This week's spending
   const { start: weekStart, end: weekEnd } = getDateRange('this_week', now);
   const spendingThisWeek = transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, weekStart, weekEnd))
+    .filter(() => undefined)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[NoCoverage] ArithmeticOperator
src/services/fabric/DailyBriefingEngine.ts:140:26
   const { start: weekStart, end: weekEnd } = getDateRange('this_week', now);
   const spendingThisWeek = transactions
     .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, weekStart, weekEnd))
-    .reduce((sum, tx) => sum + tx.amountCents, 0);
+    .reduce((sum, tx) => sum - tx.amountCents, 0);
 
   const subtitle = buildSubtitle(todayStats, upcoming);
