[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:20:29
 
   // Scope to current month for relevance
   const { start, end } = getDateRange('this_month', now);
-  const thisMonthExpenses = transactions.filter(
-    (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
-  );
+  const thisMonthExpenses = transactions;
   if (thisMonthExpenses.length === 0) return null;
 

[Killed] BooleanLiteral
src/services/fabric/InsightsEngine.ts:21:38
   // Scope to current month for relevance
   const { start, end } = getDateRange('this_month', now);
   const thisMonthExpenses = transactions.filter(
-    (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
+    (tx) => tx.type === 'expense' && tx.isSoftDeleted && withinRange(tx.date, start, end),
   );
   if (thisMonthExpenses.length === 0) return null;
killedBy: buildInsights builds finance insights
statusReason: expected 0 to be greater than 0

[Killed] ArrowFunction
src/services/fabric/InsightsEngine.ts:21:5
   // Scope to current month for relevance
   const { start, end } = getDateRange('this_month', now);
   const thisMonthExpenses = transactions.filter(
-    (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
+    () => undefined,
   );
   if (thisMonthExpenses.length === 0) return null;
killedBy: buildInsights builds finance insights
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/services/fabric/InsightsEngine.ts:23:7
   const thisMonthExpenses = transactions.filter(
     (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
   );
-  if (thisMonthExpenses.length === 0) return null;
+  if (thisMonthExpenses.length !== 0) return null;
 
   const byCategory = sumByCategory(thisMonthExpenses);
killedBy: buildInsights builds finance insights
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:23:7
   const thisMonthExpenses = transactions.filter(
     (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
   );
-  if (thisMonthExpenses.length === 0) return null;
+  if (false) return null;
 
   const byCategory = sumByCategory(thisMonthExpenses);

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:27:20
 
   const byCategory = sumByCategory(thisMonthExpenses);
 
-  const topEntry = Object.entries(byCategory).sort((a, b) => b[1] - a[1]).at(0);
+  const topEntry = Object.entries(byCategory).at(0);
   if (!topEntry) return null;
   const [category, total] = topEntry;

[NoCoverage] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:27:62
 
   const byCategory = sumByCategory(thisMonthExpenses);
 
-  const topEntry = Object.entries(byCategory).sort((a, b) => b[1] - a[1]).at(0);
+  const topEntry = Object.entries(byCategory).sort((a, b) => b[1] + a[1]).at(0);
   if (!topEntry) return null;
   const [category, total] = topEntry;

[Survived] StringLiteral
src/services/fabric/InsightsEngine.ts:32:59
   const [category, total] = topEntry;
 
   // Previous month for comparison
-  const { start: prevStart, end: prevEnd } = getDateRange('last_month', now);
+  const { start: prevStart, end: prevEnd } = getDateRange("", now);
   const prevExpenses = transactions.filter(
     (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd),

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:33:24
 
   // Previous month for comparison
   const { start: prevStart, end: prevEnd } = getDateRange('last_month', now);
-  const prevExpenses = transactions.filter(
-    (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd),
-  );
+  const prevExpenses = transactions;
   const prevByCategory = sumByCategory(prevExpenses);
   const prevTotal = prevByCategory[category] ?? 0;

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:34:13
   // Previous month for comparison
   const { start: prevStart, end: prevEnd } = getDateRange('last_month', now);
   const prevExpenses = transactions.filter(
-    (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd),
+    (tx) => false,
   );
   const prevByCategory = sumByCategory(prevExpenses);

[Survived] LogicalOperator
src/services/fabric/InsightsEngine.ts:34:13
   // Previous month for comparison
   const { start: prevStart, end: prevEnd } = getDateRange('last_month', now);
   const prevExpenses = transactions.filter(
-    (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd),
+    (tx) => tx.type === 'expense' && !tx.isSoftDeleted || withinRange(tx.date, prevStart, prevEnd),
   );
   const prevByCategory = sumByCategory(prevExpenses);

[Survived] LogicalOperator
src/services/fabric/InsightsEngine.ts:37:21
     (tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd),
   );
   const prevByCategory = sumByCategory(prevExpenses);
-  const prevTotal = prevByCategory[category] ?? 0;
+  const prevTotal = prevByCategory[category] && 0;
 
   const trend: Insight['trend'] = prevTotal === 0 ? 'stable'

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:39:35
   const prevByCategory = sumByCategory(prevExpenses);
   const prevTotal = prevByCategory[category] ?? 0;
 
-  const trend: Insight['trend'] = prevTotal === 0 ? 'stable'
+  const trend: Insight['trend'] = true ? 'stable'
     : total > prevTotal * 1.1 ? 'up'
     : total < prevTotal * 0.9 ? 'down'

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:39:35
   const prevByCategory = sumByCategory(prevExpenses);
   const prevTotal = prevByCategory[category] ?? 0;
 
-  const trend: Insight['trend'] = prevTotal === 0 ? 'stable'
+  const trend: Insight['trend'] = prevTotal !== 0 ? 'stable'
     : total > prevTotal * 1.1 ? 'up'
     : total < prevTotal * 0.9 ? 'down'

[NoCoverage] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:40:15
   const prevTotal = prevByCategory[category] ?? 0;
 
   const trend: Insight['trend'] = prevTotal === 0 ? 'stable'
-    : total > prevTotal * 1.1 ? 'up'
+    : total > prevTotal / 1.1 ? 'up'
     : total < prevTotal * 0.9 ? 'down'
     : 'stable';

[NoCoverage] EqualityOperator
src/services/fabric/InsightsEngine.ts:40:7
   const prevTotal = prevByCategory[category] ?? 0;
 
   const trend: Insight['trend'] = prevTotal === 0 ? 'stable'
-    : total > prevTotal * 1.1 ? 'up'
+    : total >= prevTotal * 1.1 ? 'up'
     : total < prevTotal * 0.9 ? 'down'
     : 'stable';

[NoCoverage] EqualityOperator
src/services/fabric/InsightsEngine.ts:41:7
 
   const trend: Insight['trend'] = prevTotal === 0 ? 'stable'
     : total > prevTotal * 1.1 ? 'up'
-    : total < prevTotal * 0.9 ? 'down'
+    : total >= prevTotal * 0.9 ? 'down'
     : 'stable';
 

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:41:7
 
   const trend: Insight['trend'] = prevTotal === 0 ? 'stable'
     : total > prevTotal * 1.1 ? 'up'
-    : total < prevTotal * 0.9 ? 'down'
+    : false ? 'down'
     : 'stable';
 

[Survived] StringLiteral
src/services/fabric/InsightsEngine.ts:47:15
   return {
     id: 'insight-spending-top-category',
     category: 'spending',
-    headline: `Top spend this month: ${category}`,
+    headline: ``,
     detail: `${formatCents(total, currency)} in ${category}${prevTotal > 0 ? ` — ${trend === 'up' ? '↑' : trend === 'down' ? '↓' : '≈'} vs last month (${formatCents(prevTotal, currency)})` : ''}.`,
     trend,

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:48:62
     id: 'insight-spending-top-category',
     category: 'spending',
     headline: `Top spend this month: ${category}`,
-    detail: `${formatCents(total, currency)} in ${category}${prevTotal > 0 ? ` — ${trend === 'up' ? '↑' : trend === 'down' ? '↓' : '≈'} vs last month (${formatCents(prevTotal, currency)})` : ''}.`,
+    detail: `${formatCents(total, currency)} in ${category}${prevTotal <= 0 ? ` — ${trend === 'up' ? '↑' : trend === 'down' ? '↓' : '≈'} vs last month (${formatCents(prevTotal, currency)})` : ''}.`,
     trend,
     severity: trend === 'up' ? 'attention' : 'neutral',

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:48:62
     id: 'insight-spending-top-category',
     category: 'spending',
     headline: `Top spend this month: ${category}`,
-    detail: `${formatCents(total, currency)} in ${category}${prevTotal > 0 ? ` — ${trend === 'up' ? '↑' : trend === 'down' ? '↓' : '≈'} vs last month (${formatCents(prevTotal, currency)})` : ''}.`,
+    detail: `${formatCents(total, currency)} in ${category}${prevTotal >= 0 ? ` — ${trend === 'up' ? '↑' : trend === 'down' ? '↓' : '≈'} vs last month (${formatCents(prevTotal, currency)})` : ''}.`,
     trend,
     severity: trend === 'up' ? 'attention' : 'neutral',

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:50:15
     headline: `Top spend this month: ${category}`,
     detail: `${formatCents(total, currency)} in ${category}${prevTotal > 0 ? ` — ${trend === 'up' ? '↑' : trend === 'down' ? '↓' : '≈'} vs last month (${formatCents(prevTotal, currency)})` : ''}.`,
     trend,
-    severity: trend === 'up' ? 'attention' : 'neutral',
+    severity: true ? 'attention' : 'neutral',
     metric: {
       current: Number((total / 100).toFixed(2)),

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:50:15
     headline: `Top spend this month: ${category}`,
     detail: `${formatCents(total, currency)} in ${category}${prevTotal > 0 ? ` — ${trend === 'up' ? '↑' : trend === 'down' ? '↓' : '≈'} vs last month (${formatCents(prevTotal, currency)})` : ''}.`,
     trend,
-    severity: trend === 'up' ? 'attention' : 'neutral',
+    severity: trend !== 'up' ? 'attention' : 'neutral',
     metric: {
       current: Number((total / 100).toFixed(2)),

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:52:24
     trend,
     severity: trend === 'up' ? 'attention' : 'neutral',
     metric: {
-      current: Number((total / 100).toFixed(2)),
+      current: Number((total * 100).toFixed(2)),
       previous: Number((prevTotal / 100).toFixed(2)),
       unit: currency,

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:53:25
     severity: trend === 'up' ? 'attention' : 'neutral',
     metric: {
       current: Number((total / 100).toFixed(2)),
-      previous: Number((prevTotal / 100).toFixed(2)),
+      previous: Number((prevTotal * 100).toFixed(2)),
       unit: currency,
     },

[Survived] StringLiteral
src/services/fabric/InsightsEngine.ts:56:17
       previous: Number((prevTotal / 100).toFixed(2)),
       unit: currency,
     },
-    actionLink: '/finance',
+    actionLink: "",
     createdAt: now.toISOString(),
   };

[Killed] ConditionalExpression
src/services/fabric/InsightsEngine.ts:62:7
 }
 
 function buildCommitmentInsight(commitments: AnchorTask[], now: Date): Insight | null {
-  if (commitments.length === 0) return null;
+  if (true) return null;
 
   // Scope to tasks created in the last 30 days for recency
killedBy: buildInsights builds commitment insights
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/InsightsEngine.ts:62:7
 }
 
 function buildCommitmentInsight(commitments: AnchorTask[], now: Date): Insight | null {
-  if (commitments.length === 0) return null;
+  if (commitments.length !== 0) return null;
 
   // Scope to tasks created in the last 30 days for recency
killedBy: buildInsights builds commitment insights
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:66:3
 
   // Scope to tasks created in the last 30 days for recency
   const cutoff = new Date(now);
-  cutoff.setDate(cutoff.getDate() - 30);
+  cutoff.setTime(cutoff.getDate() - 30);
   const recent = commitments.filter((task) => {
     const d = toDate(task.createdAt ?? null);

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:66:18
 
   // Scope to tasks created in the last 30 days for recency
   const cutoff = new Date(now);
-  cutoff.setDate(cutoff.getDate() - 30);
+  cutoff.setDate(cutoff.getDate() + 30);
   const recent = commitments.filter((task) => {
     const d = toDate(task.createdAt ?? null);

[Survived] BlockStatement
src/services/fabric/InsightsEngine.ts:67:47
   // Scope to tasks created in the last 30 days for recency
   const cutoff = new Date(now);
   cutoff.setDate(cutoff.getDate() - 30);
-  const recent = commitments.filter((task) => {
-    const d = toDate(task.createdAt ?? null);
-    return !d || d >= cutoff;
-  });
+  const recent = commitments.filter((task) => {});
   const pool = recent.length > 0 ? recent : commitments;
 

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:67:18
   // Scope to tasks created in the last 30 days for recency
   const cutoff = new Date(now);
   cutoff.setDate(cutoff.getDate() - 30);
-  const recent = commitments.filter((task) => {
-    const d = toDate(task.createdAt ?? null);
-    return !d || d >= cutoff;
-  });
+  const recent = commitments;
   const pool = recent.length > 0 ? recent : commitments;
 

[Survived] LogicalOperator
src/services/fabric/InsightsEngine.ts:68:22
   const cutoff = new Date(now);
   cutoff.setDate(cutoff.getDate() - 30);
   const recent = commitments.filter((task) => {
-    const d = toDate(task.createdAt ?? null);
+    const d = toDate(task.createdAt && null);
     return !d || d >= cutoff;
   });

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:69:18
   cutoff.setDate(cutoff.getDate() - 30);
   const recent = commitments.filter((task) => {
     const d = toDate(task.createdAt ?? null);
-    return !d || d >= cutoff;
+    return !d || d < cutoff;
   });
   const pool = recent.length > 0 ? recent : commitments;

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:69:12
   cutoff.setDate(cutoff.getDate() - 30);
   const recent = commitments.filter((task) => {
     const d = toDate(task.createdAt ?? null);
-    return !d || d >= cutoff;
+    return true;
   });
   const pool = recent.length > 0 ? recent : commitments;

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:71:16
     const d = toDate(task.createdAt ?? null);
     return !d || d >= cutoff;
   });
-  const pool = recent.length > 0 ? recent : commitments;
+  const pool = true ? recent : commitments;
 
   const completed = pool.filter((task) => task.completed).length;

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:71:16
     const d = toDate(task.createdAt ?? null);
     return !d || d >= cutoff;
   });
-  const pool = recent.length > 0 ? recent : commitments;
+  const pool = false ? recent : commitments;
 
   const completed = pool.filter((task) => task.completed).length;

[Survived] ArrowFunction
src/services/fabric/InsightsEngine.ts:73:33
   });
   const pool = recent.length > 0 ? recent : commitments;
 
-  const completed = pool.filter((task) => task.completed).length;
+  const completed = pool.filter(() => undefined).length;
   const rate = Math.round((completed / pool.length) * 100);
 

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:73:21
   });
   const pool = recent.length > 0 ? recent : commitments;
 
-  const completed = pool.filter((task) => task.completed).length;
+  const completed = pool.length;
   const rate = Math.round((completed / pool.length) * 100);
 

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:74:28
   const pool = recent.length > 0 ? recent : commitments;
 
   const completed = pool.filter((task) => task.completed).length;
-  const rate = Math.round((completed / pool.length) * 100);
+  const rate = Math.round((completed * pool.length) * 100);
 
   // Find best streak for the detail line

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:74:27
   const pool = recent.length > 0 ? recent : commitments;
 
   const completed = pool.filter((task) => task.completed).length;
-  const rate = Math.round((completed / pool.length) * 100);
+  const rate = Math.round(completed / pool.length / 100);
 
   // Find best streak for the detail line

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:77:46
   const rate = Math.round((completed / pool.length) * 100);
 
   // Find best streak for the detail line
-  const bestStreak = pool.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
+  const bestStreak = pool.reduce((max, t) => Math.min(max, t.currentStreak ?? 0), 0);
   const streakNote = bestStreak >= 3 ? ` Best streak: ${bestStreak} days.` : '';
 

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:78:22
 
   // Find best streak for the detail line
   const bestStreak = pool.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
-  const streakNote = bestStreak >= 3 ? ` Best streak: ${bestStreak} days.` : '';
+  const streakNote = bestStreak < 3 ? ` Best streak: ${bestStreak} days.` : '';
 
   return {

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:78:22
 
   // Find best streak for the detail line
   const bestStreak = pool.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
-  const streakNote = bestStreak >= 3 ? ` Best streak: ${bestStreak} days.` : '';
+  const streakNote = false ? ` Best streak: ${bestStreak} days.` : '';
 
   return {

[Survived] StringLiteral
src/services/fabric/InsightsEngine.ts:84:13
     id: 'insight-commitment-completion',
     category: 'commitments',
     headline: `Commitment completion: ${rate}%`,
-    detail: `${completed} of ${pool.length} done in the last 30 days.${streakNote}`,
+    detail: ``,
     trend: rate >= 80 ? 'up' : rate >= 50 ? 'stable' : 'down',
     severity: rate >= 70 ? 'positive' : 'attention',

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:85:12
     category: 'commitments',
     headline: `Commitment completion: ${rate}%`,
     detail: `${completed} of ${pool.length} done in the last 30 days.${streakNote}`,
-    trend: rate >= 80 ? 'up' : rate >= 50 ? 'stable' : 'down',
+    trend: false ? 'up' : rate >= 50 ? 'stable' : 'down',
     severity: rate >= 70 ? 'positive' : 'attention',
     metric: { current: rate, previous: 0, unit: '%' },

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:85:32
     category: 'commitments',
     headline: `Commitment completion: ${rate}%`,
     detail: `${completed} of ${pool.length} done in the last 30 days.${streakNote}`,
-    trend: rate >= 80 ? 'up' : rate >= 50 ? 'stable' : 'down',
+    trend: rate >= 80 ? 'up' : rate < 50 ? 'stable' : 'down',
     severity: rate >= 70 ? 'positive' : 'attention',
     metric: { current: rate, previous: 0, unit: '%' },

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:86:15
     headline: `Commitment completion: ${rate}%`,
     detail: `${completed} of ${pool.length} done in the last 30 days.${streakNote}`,
     trend: rate >= 80 ? 'up' : rate >= 50 ? 'stable' : 'down',
-    severity: rate >= 70 ? 'positive' : 'attention',
+    severity: true ? 'positive' : 'attention',
     metric: { current: rate, previous: 0, unit: '%' },
     actionLink: '/commitments',

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:86:15
     headline: `Commitment completion: ${rate}%`,
     detail: `${completed} of ${pool.length} done in the last 30 days.${streakNote}`,
     trend: rate >= 80 ? 'up' : rate >= 50 ? 'stable' : 'down',
-    severity: rate >= 70 ? 'positive' : 'attention',
+    severity: rate < 70 ? 'positive' : 'attention',
     metric: { current: rate, previous: 0, unit: '%' },
     actionLink: '/commitments',

[Survived] StringLiteral
src/services/fabric/InsightsEngine.ts:88:17
     trend: rate >= 80 ? 'up' : rate >= 50 ? 'stable' : 'down',
     severity: rate >= 70 ? 'positive' : 'attention',
     metric: { current: rate, previous: 0, unit: '%' },
-    actionLink: '/commitments',
+    actionLink: "",
     createdAt: now.toISOString(),
   };

[Survived] StringLiteral
src/services/fabric/InsightsEngine.ts:97:39
   const currency = detectPrimaryCurrency(transactions);
 
   // Surface shared account activity volume this month
-  const { start, end } = getDateRange('this_month', now);
+  const { start, end } = getDateRange("", now);
   const familyTxns = transactions.filter(
     (tx) => tx.scope === 'family' && !tx.isSoftDeleted && withinRange(tx.date, start, end),

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:98:22
 
   // Surface shared account activity volume this month
   const { start, end } = getDateRange('this_month', now);
-  const familyTxns = transactions.filter(
-    (tx) => tx.scope === 'family' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
-  );
+  const familyTxns = transactions;
   if (familyTxns.length === 0) return null;
 

[Survived] LogicalOperator
src/services/fabric/InsightsEngine.ts:99:13
   // Surface shared account activity volume this month
   const { start, end } = getDateRange('this_month', now);
   const familyTxns = transactions.filter(
-    (tx) => tx.scope === 'family' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
+    (tx) => tx.scope === 'family' && !tx.isSoftDeleted || withinRange(tx.date, start, end),
   );
   if (familyTxns.length === 0) return null;

[Survived] ArrowFunction
src/services/fabric/InsightsEngine.ts:99:5
   // Surface shared account activity volume this month
   const { start, end } = getDateRange('this_month', now);
   const familyTxns = transactions.filter(
-    (tx) => tx.scope === 'family' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
+    () => undefined,
   );
   if (familyTxns.length === 0) return null;

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:101:7
   const familyTxns = transactions.filter(
     (tx) => tx.scope === 'family' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
   );
-  if (familyTxns.length === 0) return null;
+  if (familyTxns.length !== 0) return null;
 
   const totalSpent = familyTxns

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:101:7
   const familyTxns = transactions.filter(
     (tx) => tx.scope === 'family' && !tx.isSoftDeleted && withinRange(tx.date, start, end),
   );
-  if (familyTxns.length === 0) return null;
+  if (true) return null;
 
   const totalSpent = familyTxns

[NoCoverage] MethodExpression
src/services/fabric/InsightsEngine.ts:103:22
   );
   if (familyTxns.length === 0) return null;
 
-  const totalSpent = familyTxns
-    .filter((tx) => tx.type === 'expense')
+  const totalSpent = familyTxns
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[NoCoverage] ArrowFunction
src/services/fabric/InsightsEngine.ts:104:13
   if (familyTxns.length === 0) return null;
 
   const totalSpent = familyTxns
-    .filter((tx) => tx.type === 'expense')
+    .filter(() => undefined)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:104:21
   if (familyTxns.length === 0) return null;
 
   const totalSpent = familyTxns
-    .filter((tx) => tx.type === 'expense')
+    .filter((tx) => true)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[NoCoverage] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:105:26
 
   const totalSpent = familyTxns
     .filter((tx) => tx.type === 'expense')
-    .reduce((sum, tx) => sum + tx.amountCents, 0);
+    .reduce((sum, tx) => sum - tx.amountCents, 0);
 
   return {

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:108:9
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   return {
-    id: 'insight-family-activity',
+    id: "",
     category: 'household',
     headline: `${familyTxns.length} shared transactions this month`,

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:110:15
   return {
     id: 'insight-family-activity',
     category: 'household',
-    headline: `${familyTxns.length} shared transactions this month`,
+    headline: ``,
     detail: `${formatCents(totalSpent, currency)} in shared account expenses.`,
     trend: 'stable',

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:111:13
     id: 'insight-family-activity',
     category: 'household',
     headline: `${familyTxns.length} shared transactions this month`,
-    detail: `${formatCents(totalSpent, currency)} in shared account expenses.`,
+    detail: ``,
     trend: 'stable',
     severity: 'neutral',

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:114:62
     detail: `${formatCents(totalSpent, currency)} in shared account expenses.`,
     trend: 'stable',
     severity: 'neutral',
-    metric: { current: familyTxns.length, previous: 0, unit: 'transactions' },
+    metric: { current: familyTxns.length, previous: 0, unit: "" },
     actionLink: '/finance',
     createdAt: now.toISOString(),

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:115:17
     trend: 'stable',
     severity: 'neutral',
     metric: { current: familyTxns.length, previous: 0, unit: 'transactions' },
-    actionLink: '/finance',
+    actionLink: "",
     createdAt: now.toISOString(),
   };

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:123:9
 /** Celebrate a commitment that has a streak of 5+ days. */
 function buildStreakInsight(commitments: AnchorTask[], now: Date): Insight | null {
   const best = commitments.reduce<AnchorTask | null>((acc, t) => {
-    if ((t.currentStreak ?? 0) < 5) return acc;
+    if (false) return acc;
     return !acc || (t.currentStreak ?? 0) > (acc.currentStreak ?? 0) ? t : acc;
   }, null);

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:123:9
 /** Celebrate a commitment that has a streak of 5+ days. */
 function buildStreakInsight(commitments: AnchorTask[], now: Date): Insight | null {
   const best = commitments.reduce<AnchorTask | null>((acc, t) => {
-    if ((t.currentStreak ?? 0) < 5) return acc;
+    if ((t.currentStreak ?? 0) >= 5) return acc;
     return !acc || (t.currentStreak ?? 0) > (acc.currentStreak ?? 0) ? t : acc;
   }, null);

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:124:12
 function buildStreakInsight(commitments: AnchorTask[], now: Date): Insight | null {
   const best = commitments.reduce<AnchorTask | null>((acc, t) => {
     if ((t.currentStreak ?? 0) < 5) return acc;
-    return !acc || (t.currentStreak ?? 0) > (acc.currentStreak ?? 0) ? t : acc;
+    return true ? t : acc;
   }, null);
   if (!best) return null;

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:124:12
 function buildStreakInsight(commitments: AnchorTask[], now: Date): Insight | null {
   const best = commitments.reduce<AnchorTask | null>((acc, t) => {
     if ((t.currentStreak ?? 0) < 5) return acc;
-    return !acc || (t.currentStreak ?? 0) > (acc.currentStreak ?? 0) ? t : acc;
+    return false ? t : acc;
   }, null);
   if (!best) return null;

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:132:15
   return {
     id: `insight-streak-${best.id}`,
     category: 'commitments',
-    headline: `${days}-day streak on "${best.title}"`,
+    headline: ``,
     detail: days >= 30
       ? `An incredible month-long habit — you've built something real.`

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:133:13
     id: `insight-streak-${best.id}`,
     category: 'commitments',
     headline: `${days}-day streak on "${best.title}"`,
-    detail: days >= 30
+    detail: true
       ? `An incredible month-long habit — you've built something real.`
       : days >= 14

[NoCoverage] EqualityOperator
src/services/fabric/InsightsEngine.ts:133:13
     id: `insight-streak-${best.id}`,
     category: 'commitments',
     headline: `${days}-day streak on "${best.title}"`,
-    detail: days >= 30
+    detail: days > 30
       ? `An incredible month-long habit — you've built something real.`
       : days >= 14

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:134:9
     category: 'commitments',
     headline: `${days}-day streak on "${best.title}"`,
     detail: days >= 30
-      ? `An incredible month-long habit — you've built something real.`
+      ? ``
       : days >= 14
         ? `Two solid weeks in a row. Keep the momentum going.`

[NoCoverage] EqualityOperator
src/services/fabric/InsightsEngine.ts:135:9
     headline: `${days}-day streak on "${best.title}"`,
     detail: days >= 30
       ? `An incredible month-long habit — you've built something real.`
-      : days >= 14
+      : days > 14
         ? `Two solid weeks in a row. Keep the momentum going.`
         : `Great consistency — you're building a lasting habit.`,

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:135:9
     headline: `${days}-day streak on "${best.title}"`,
     detail: days >= 30
       ? `An incredible month-long habit — you've built something real.`
-      : days >= 14
+      : false
         ? `Two solid weeks in a row. Keep the momentum going.`
         : `Great consistency — you're building a lasting habit.`,

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:136:11
     detail: days >= 30
       ? `An incredible month-long habit — you've built something real.`
       : days >= 14
-        ? `Two solid weeks in a row. Keep the momentum going.`
+        ? ``
         : `Great consistency — you're building a lasting habit.`,
     trend: 'up',
