[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:140:49
         : `Great consistency — you're building a lasting habit.`,
     trend: 'up',
     severity: 'positive',
-    metric: { current: days, previous: 0, unit: 'days' },
+    metric: { current: days, previous: 0, unit: "" },
     actionLink: '/commitments',
     createdAt: now.toISOString(),

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:152:16
   currency: 'NGN' | 'USD',
   now: Date,
 ): Insight | null {
-  const subs = recurring.filter(
-    (r) => r.status === 'active' && r.frequency === 'monthly' && r.type === 'expense',
-  );
+  const subs = recurring;
   if (subs.length === 0) return null;
 

[NoCoverage] LogicalOperator
src/services/fabric/InsightsEngine.ts:153:12
   now: Date,
 ): Insight | null {
   const subs = recurring.filter(
-    (r) => r.status === 'active' && r.frequency === 'monthly' && r.type === 'expense',
+    (r) => r.status === 'active' && r.frequency === 'monthly' || r.type === 'expense',
   );
   if (subs.length === 0) return null;

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:153:12
   now: Date,
 ): Insight | null {
   const subs = recurring.filter(
-    (r) => r.status === 'active' && r.frequency === 'monthly' && r.type === 'expense',
+    (r) => true,
   );
   if (subs.length === 0) return null;

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:155:7
   const subs = recurring.filter(
     (r) => r.status === 'active' && r.frequency === 'monthly' && r.type === 'expense',
   );
-  if (subs.length === 0) return null;
+  if (false) return null;
 
   const totalCents = subs.reduce((sum, r) => sum + r.amountCents, 0);

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:155:7
   const subs = recurring.filter(
     (r) => r.status === 'active' && r.frequency === 'monthly' && r.type === 'expense',
   );
-  if (subs.length === 0) return null;
+  if (true) return null;
 
   const totalCents = subs.reduce((sum, r) => sum + r.amountCents, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:157:46
   );
   if (subs.length === 0) return null;
 
-  const totalCents = subs.reduce((sum, r) => sum + r.amountCents, 0);
+  const totalCents = subs.reduce((sum, r) => sum - r.amountCents, 0);
   const cur = currency;
 

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:163:52
   return {
     id: 'insight-subscriptions',
     category: 'spending',
-    headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
+    headline: `${subs.length} active subscription${false ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
     detail: subs.length <= 4
       ? subs.map((s) => s.title).join(', ') + '.'

[NoCoverage] EqualityOperator
src/services/fabric/InsightsEngine.ts:163:52
   return {
     id: 'insight-subscriptions',
     category: 'spending',
-    headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
+    headline: `${subs.length} active subscription${subs.length !== 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
     detail: subs.length <= 4
       ? subs.map((s) => s.title).join(', ') + '.'

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:164:13
     id: 'insight-subscriptions',
     category: 'spending',
     headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
-    detail: subs.length <= 4
+    detail: false
       ? subs.map((s) => s.title).join(', ') + '.'
       : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length - 3} more.`,

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:164:13
     id: 'insight-subscriptions',
     category: 'spending',
     headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
-    detail: subs.length <= 4
+    detail: true
       ? subs.map((s) => s.title).join(', ') + '.'
       : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length - 3} more.`,

[NoCoverage] ArrowFunction
src/services/fabric/InsightsEngine.ts:165:18
     category: 'spending',
     headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
     detail: subs.length <= 4
-      ? subs.map((s) => s.title).join(', ') + '.'
+      ? subs.map(() => undefined).join(', ') + '.'
       : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length - 3} more.`,
     trend: 'stable',

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:165:47
     category: 'spending',
     headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
     detail: subs.length <= 4
-      ? subs.map((s) => s.title).join(', ') + '.'
+      ? subs.map((s) => s.title).join(', ') + ""
       : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length - 3} more.`,
     trend: 'stable',

[NoCoverage] ArrowFunction
src/services/fabric/InsightsEngine.ts:166:43
     headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
     detail: subs.length <= 4
       ? subs.map((s) => s.title).join(', ') + '.'
-      : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length - 3} more.`,
+      : `Including ${subs.slice(0, 3).map(() => undefined).join(', ')} and ${subs.length - 3} more.`,
     trend: 'stable',
     severity: 'neutral',

[NoCoverage] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:166:77
     headline: `${subs.length} active subscription${subs.length === 1 ? '' : 's'} — ${formatCents(totalCents, cur)}/month`,
     detail: subs.length <= 4
       ? subs.map((s) => s.title).join(', ') + '.'
-      : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length - 3} more.`,
+      : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length + 3} more.`,
     trend: 'stable',
     severity: 'neutral',

[NoCoverage] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:169:32
       : `Including ${subs.slice(0, 3).map((s) => s.title).join(', ')} and ${subs.length - 3} more.`,
     trend: 'stable',
     severity: 'neutral',
-    metric: { current: Number((totalCents / 100).toFixed(2)), previous: 0, unit: cur },
+    metric: { current: Number((totalCents * 100).toFixed(2)), previous: 0, unit: cur },
     actionLink: '/finance',
     createdAt: now.toISOString(),

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:170:17
     trend: 'stable',
     severity: 'neutral',
     metric: { current: Number((totalCents / 100).toFixed(2)), previous: 0, unit: cur },
-    actionLink: '/finance',
+    actionLink: "",
     createdAt: now.toISOString(),
   };

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:180:18
   const currency = detectPrimaryCurrency(transactions);
   const { start, end } = getDateRange('this_month', now);
 
-  const income = transactions
-    .filter((tx) => tx.type === 'income' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
+  const income = transactions
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] ArrowFunction
src/services/fabric/InsightsEngine.ts:181:13
   const { start, end } = getDateRange('this_month', now);
 
   const income = transactions
-    .filter((tx) => tx.type === 'income' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
+    .filter(() => undefined)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:181:21
   const { start, end } = getDateRange('this_month', now);
 
   const income = transactions
-    .filter((tx) => tx.type === 'income' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
+    .filter((tx) => tx.type !== 'income' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:182:26
 
   const income = transactions
     .filter((tx) => tx.type === 'income' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
-    .reduce((sum, tx) => sum + tx.amountCents, 0);
+    .reduce((sum, tx) => sum - tx.amountCents, 0);
 
   if (income === 0) return null;

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:184:7
     .filter((tx) => tx.type === 'income' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  if (income === 0) return null;
+  if (income !== 0) return null;
 
   const expenses = transactions

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:184:7
     .filter((tx) => tx.type === 'income' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  if (income === 0) return null;
+  if (false) return null;
 
   const expenses = transactions

[Survived] MethodExpression
src/services/fabric/InsightsEngine.ts:186:20
 
   if (income === 0) return null;
 
-  const expenses = transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
+  const expenses = transactions
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] ArrowFunction
src/services/fabric/InsightsEngine.ts:187:13
   if (income === 0) return null;
 
   const expenses = transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
+    .filter(() => undefined)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] LogicalOperator
src/services/fabric/InsightsEngine.ts:187:21
   if (income === 0) return null;
 
   const expenses = transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
+    .filter((tx) => tx.type === 'expense' || !tx.isSoftDeleted && withinRange(tx.date, start, end))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:188:26
 
   const expenses = transactions
     .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
-    .reduce((sum, tx) => sum + tx.amountCents, 0);
+    .reduce((sum, tx) => sum - tx.amountCents, 0);
 
   const savingsRate = Math.round(((income - expenses) / income) * 100);

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:190:34
     .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  const savingsRate = Math.round(((income - expenses) / income) * 100);
+  const savingsRate = Math.round((income - expenses) / income / 100);
   const savedCents = income - expenses;
 

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:190:36
     .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, start, end))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  const savingsRate = Math.round(((income - expenses) / income) * 100);
+  const savingsRate = Math.round(((income + expenses) / income) * 100);
   const savedCents = income - expenses;
 

[Survived] ArithmeticOperator
src/services/fabric/InsightsEngine.ts:191:22
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   const savingsRate = Math.round(((income - expenses) / income) * 100);
-  const savedCents = income - expenses;
+  const savedCents = income + expenses;
 
   const trend: Insight['trend'] = savingsRate >= 20 ? 'up' : savingsRate >= 0 ? 'stable' : 'down';

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:193:35
   const savingsRate = Math.round(((income - expenses) / income) * 100);
   const savedCents = income - expenses;
 
-  const trend: Insight['trend'] = savingsRate >= 20 ? 'up' : savingsRate >= 0 ? 'stable' : 'down';
+  const trend: Insight['trend'] = true ? 'up' : savingsRate >= 0 ? 'stable' : 'down';
 
   return {

[NoCoverage] EqualityOperator
src/services/fabric/InsightsEngine.ts:193:62
   const savingsRate = Math.round(((income - expenses) / income) * 100);
   const savedCents = income - expenses;
 
-  const trend: Insight['trend'] = savingsRate >= 20 ? 'up' : savingsRate >= 0 ? 'stable' : 'down';
+  const trend: Insight['trend'] = savingsRate >= 20 ? 'up' : savingsRate > 0 ? 'stable' : 'down';
 
   return {

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:198:15
   return {
     id: 'insight-savings-rate',
     category: 'spending',
-    headline: savingsRate >= 0
+    headline: savingsRate > 0
       ? `Saving ${savingsRate}% of income this month`
       : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:198:15
   return {
     id: 'insight-savings-rate',
     category: 'spending',
-    headline: savingsRate >= 0
+    headline: savingsRate < 0
       ? `Saving ${savingsRate}% of income this month`
       : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:200:9
     category: 'spending',
     headline: savingsRate >= 0
       ? `Saving ${savingsRate}% of income this month`
-      : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,
+      : ``,
     detail: savingsRate >= 20
       ? `You kept ${formatCents(savedCents, currency)} from ${formatCents(income, currency)} earned — solid month.`

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:201:13
     headline: savingsRate >= 0
       ? `Saving ${savingsRate}% of income this month`
       : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,
-    detail: savingsRate >= 20
+    detail: savingsRate > 20
       ? `You kept ${formatCents(savedCents, currency)} from ${formatCents(income, currency)} earned — solid month.`
       : savingsRate >= 0

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:201:13
     headline: savingsRate >= 0
       ? `Saving ${savingsRate}% of income this month`
       : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,
-    detail: savingsRate >= 20
+    detail: false
       ? `You kept ${formatCents(savedCents, currency)} from ${formatCents(income, currency)} earned — solid month.`
       : savingsRate >= 0

[Survived] StringLiteral
src/services/fabric/InsightsEngine.ts:202:9
       ? `Saving ${savingsRate}% of income this month`
       : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,
     detail: savingsRate >= 20
-      ? `You kept ${formatCents(savedCents, currency)} from ${formatCents(income, currency)} earned — solid month.`
+      ? ``
       : savingsRate >= 0
         ? `You saved ${formatCents(savedCents, currency)} of ${formatCents(income, currency)} earned. Aim for 20% to build a buffer.`

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:203:9
       : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,
     detail: savingsRate >= 20
       ? `You kept ${formatCents(savedCents, currency)} from ${formatCents(income, currency)} earned — solid month.`
-      : savingsRate >= 0
+      : false
         ? `You saved ${formatCents(savedCents, currency)} of ${formatCents(income, currency)} earned. Aim for 20% to build a buffer.`
         : `Your expenses outpaced your income this month. Review discretionary spending.`,

[NoCoverage] EqualityOperator
src/services/fabric/InsightsEngine.ts:203:9
       : `Spending exceeds income by ${formatCents(Math.abs(savedCents), currency)}`,
     detail: savingsRate >= 20
       ? `You kept ${formatCents(savedCents, currency)} from ${formatCents(income, currency)} earned — solid month.`
-      : savingsRate >= 0
+      : savingsRate > 0
         ? `You saved ${formatCents(savedCents, currency)} of ${formatCents(income, currency)} earned. Aim for 20% to build a buffer.`
         : `Your expenses outpaced your income this month. Review discretionary spending.`,

[NoCoverage] StringLiteral
src/services/fabric/InsightsEngine.ts:204:11
     detail: savingsRate >= 20
       ? `You kept ${formatCents(savedCents, currency)} from ${formatCents(income, currency)} earned — solid month.`
       : savingsRate >= 0
-        ? `You saved ${formatCents(savedCents, currency)} of ${formatCents(income, currency)} earned. Aim for 20% to build a buffer.`
+        ? ``
         : `Your expenses outpaced your income this month. Review discretionary spending.`,
     trend,

[NoCoverage] ConditionalExpression
src/services/fabric/InsightsEngine.ts:207:48
         ? `You saved ${formatCents(savedCents, currency)} of ${formatCents(income, currency)} earned. Aim for 20% to build a buffer.`
         : `Your expenses outpaced your income this month. Review discretionary spending.`,
     trend,
-    severity: savingsRate >= 20 ? 'positive' : savingsRate >= 0 ? 'neutral' : 'attention',
+    severity: savingsRate >= 20 ? 'positive' : true ? 'neutral' : 'attention',
     metric: { current: savingsRate, previous: 0, unit: '%' },
     actionLink: '/finance',

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:207:15
         ? `You saved ${formatCents(savedCents, currency)} of ${formatCents(income, currency)} earned. Aim for 20% to build a buffer.`
         : `Your expenses outpaced your income this month. Review discretionary spending.`,
     trend,
-    severity: savingsRate >= 20 ? 'positive' : savingsRate >= 0 ? 'neutral' : 'attention',
+    severity: savingsRate > 20 ? 'positive' : savingsRate >= 0 ? 'neutral' : 'attention',
     metric: { current: savingsRate, previous: 0, unit: '%' },
     actionLink: '/finance',

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:223:7
   const subscriptions = buildSubscriptionInsight(input.recurring, currency, input.now);
   const savings = buildSavingsRateInsight(input.transactions, input.now);
 
-  if (input.feature === 'finance') {
+  if (false) {
     return [spending, subscriptions, savings].filter((i): i is Insight => !!i);
   }

[Survived] BlockStatement
src/services/fabric/InsightsEngine.ts:223:36
   const subscriptions = buildSubscriptionInsight(input.recurring, currency, input.now);
   const savings = buildSavingsRateInsight(input.transactions, input.now);
 
-  if (input.feature === 'finance') {
-    return [spending, subscriptions, savings].filter((i): i is Insight => !!i);
-  }
+  if (input.feature === 'finance') {}
   if (input.feature === 'commitments') {
     return [commitment, streak].filter((i): i is Insight => !!i);

[Killed] BooleanLiteral
src/services/fabric/InsightsEngine.ts:224:76
   const savings = buildSavingsRateInsight(input.transactions, input.now);
 
   if (input.feature === 'finance') {
-    return [spending, subscriptions, savings].filter((i): i is Insight => !!i);
+    return [spending, subscriptions, savings].filter((i): i is Insight => !i);
   }
   if (input.feature === 'commitments') {
killedBy: buildInsights builds finance insights
statusReason: Cannot read properties of null (reading 'category')

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:226:7
   if (input.feature === 'finance') {
     return [spending, subscriptions, savings].filter((i): i is Insight => !!i);
   }
-  if (input.feature === 'commitments') {
+  if (false) {
     return [commitment, streak].filter((i): i is Insight => !!i);
   }

[Survived] BlockStatement
src/services/fabric/InsightsEngine.ts:226:40
   if (input.feature === 'finance') {
     return [spending, subscriptions, savings].filter((i): i is Insight => !!i);
   }
-  if (input.feature === 'commitments') {
-    return [commitment, streak].filter((i): i is Insight => !!i);
-  }
+  if (input.feature === 'commitments') {}
   if (input.feature === 'family') return family ? [family] : [];
 

[Killed] BooleanLiteral
src/services/fabric/InsightsEngine.ts:227:61
     return [spending, subscriptions, savings].filter((i): i is Insight => !!i);
   }
   if (input.feature === 'commitments') {
-    return [commitment, streak].filter((i): i is Insight => !!i);
+    return [commitment, streak].filter((i): i is Insight => !i);
   }
   if (input.feature === 'family') return family ? [family] : [];
killedBy: buildInsights builds commitment insights
statusReason: Cannot read properties of null (reading 'category')

[Survived] ConditionalExpression
src/services/fabric/InsightsEngine.ts:229:7
   if (input.feature === 'commitments') {
     return [commitment, streak].filter((i): i is Insight => !!i);
   }
-  if (input.feature === 'family') return family ? [family] : [];
+  if (true) return family ? [family] : [];
 
   // Dashboard: spending + commitments + streak + savings

[Survived] EqualityOperator
src/services/fabric/InsightsEngine.ts:229:7
   if (input.feature === 'commitments') {
     return [commitment, streak].filter((i): i is Insight => !!i);
   }
-  if (input.feature === 'family') return family ? [family] : [];
+  if (input.feature !== 'family') return family ? [family] : [];
 
   // Dashboard: spending + commitments + streak + savings

[Survived] BooleanLiteral
src/services/fabric/InsightsEngine.ts:232:79
   if (input.feature === 'family') return family ? [family] : [];
 
   // Dashboard: spending + commitments + streak + savings
-  return [spending, commitment, streak, savings].filter((i): i is Insight => !!i);
+  return [spending, commitment, streak, savings].filter((i): i is Insight => !i);
 }
 
