[Survived] Regex
src/services/fabric/IntentParser.ts:16:5
 function parseAmount(input: string): number | undefined {
   const patterns = [
     // Explicit currency markers first (highest priority)
-    /(?:₦|NGN)\s*([\d,]+(?:\.\d{1,2})?)/i,
+    /(?:₦|NGN)\s*([\d,](?:\.\d{1,2})?)/i,
     /\$([\d,]+(?:\.\d{1,2})?)/,
     /([\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,

[Survived] Regex
src/services/fabric/IntentParser.ts:16:5
 function parseAmount(input: string): number | undefined {
   const patterns = [
     // Explicit currency markers first (highest priority)
-    /(?:₦|NGN)\s*([\d,]+(?:\.\d{1,2})?)/i,
+    /(?:₦|NGN)\s*([\D,]+(?:\.\d{1,2})?)/i,
     /\$([\d,]+(?:\.\d{1,2})?)/,
     /([\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,

[Survived] Regex
src/services/fabric/IntentParser.ts:18:5
     // Explicit currency markers first (highest priority)
     /(?:₦|NGN)\s*([\d,]+(?:\.\d{1,2})?)/i,
     /\$([\d,]+(?:\.\d{1,2})?)/,
-    /([\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,
+    /([\d,]+(?:\.\d{1,2})?)\s(?:naira|ngn)/i,
     /([\d,]+(?:\.\d{1,2})?)\s*(?:dollars?|usd)/i,
     // Bare numbers — require 2+ digits to avoid matching unit counts ("5 items")

[Survived] Regex
src/services/fabric/IntentParser.ts:18:5
     // Explicit currency markers first (highest priority)
     /(?:₦|NGN)\s*([\d,]+(?:\.\d{1,2})?)/i,
     /\$([\d,]+(?:\.\d{1,2})?)/,
-    /([\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,
+    /([^\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,
     /([\d,]+(?:\.\d{1,2})?)\s*(?:dollars?|usd)/i,
     // Bare numbers — require 2+ digits to avoid matching unit counts ("5 items")

[Survived] Regex
src/services/fabric/IntentParser.ts:19:5
     /(?:₦|NGN)\s*([\d,]+(?:\.\d{1,2})?)/i,
     /\$([\d,]+(?:\.\d{1,2})?)/,
     /([\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,
-    /([\d,]+(?:\.\d{1,2})?)\s*(?:dollars?|usd)/i,
+    /([\d,]+(?:\.\d{1,2}))\s*(?:dollars?|usd)/i,
     // Bare numbers — require 2+ digits to avoid matching unit counts ("5 items")
     /(?:^|[\s(])(\d{2,}(?:[,\d]*)?(?:\.\d{1,2})?)(?:$|[\s)])/,

[Survived] Regex
src/services/fabric/IntentParser.ts:19:5
     /(?:₦|NGN)\s*([\d,]+(?:\.\d{1,2})?)/i,
     /\$([\d,]+(?:\.\d{1,2})?)/,
     /([\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,
-    /([\d,]+(?:\.\d{1,2})?)\s*(?:dollars?|usd)/i,
+    /([^\d,]+(?:\.\d{1,2})?)\s*(?:dollars?|usd)/i,
     // Bare numbers — require 2+ digits to avoid matching unit counts ("5 items")
     /(?:^|[\s(])(\d{2,}(?:[,\d]*)?(?:\.\d{1,2})?)(?:$|[\s)])/,

[Survived] Regex
src/services/fabric/IntentParser.ts:21:5
     /([\d,]+(?:\.\d{1,2})?)\s*(?:naira|ngn)/i,
     /([\d,]+(?:\.\d{1,2})?)\s*(?:dollars?|usd)/i,
     // Bare numbers — require 2+ digits to avoid matching unit counts ("5 items")
-    /(?:^|[\s(])(\d{2,}(?:[,\d]*)?(?:\.\d{1,2})?)(?:$|[\s)])/,
+    /(?:^|[\s(])(\d{2,}(?:[,\D]*)?(?:\.\d{1,2})?)(?:$|[\s)])/,
   ];
 

[Killed] BlockStatement
src/services/fabric/IntentParser.ts:24:35
     /(?:^|[\s(])(\d{2,}(?:[,\d]*)?(?:\.\d{1,2})?)(?:$|[\s)])/,
   ];
 
-  for (const pattern of patterns) {
-    const match = input.match(pattern);
-    if (match?.[1]) {
-      const num = Number.parseFloat(match[1].replace(/,/g, ''));
-      if (!Number.isNaN(num) && num > 0) return num;
-    }
-  }
+  for (const pattern of patterns) {}
   return undefined;
 }
killedBy: parseIntent parses record expense with amount and category
statusReason: expected undefined to be 45 // Object.is equality

[Killed] BlockStatement
src/services/fabric/IntentParser.ts:26:21
 
   for (const pattern of patterns) {
     const match = input.match(pattern);
-    if (match?.[1]) {
-      const num = Number.parseFloat(match[1].replace(/,/g, ''));
-      if (!Number.isNaN(num) && num > 0) return num;
-    }
+    if (match?.[1]) {}
   }
   return undefined;
killedBy: parseIntent parses record expense with amount and category
statusReason: expected undefined to be 45 // Object.is equality

[Killed] BooleanLiteral
src/services/fabric/IntentParser.ts:28:11
     const match = input.match(pattern);
     if (match?.[1]) {
       const num = Number.parseFloat(match[1].replace(/,/g, ''));
-      if (!Number.isNaN(num) && num > 0) return num;
+      if (Number.isNaN(num) && num > 0) return num;
     }
   }
killedBy: parseIntent parses record expense with amount and category
statusReason: expected undefined to be 45 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:28:11
     const match = input.match(pattern);
     if (match?.[1]) {
       const num = Number.parseFloat(match[1].replace(/,/g, ''));
-      if (!Number.isNaN(num) && num > 0) return num;
+      if (false) return num;
     }
   }
killedBy: parseIntent parses record expense with amount and category
statusReason: expected undefined to be 45 // Object.is equality

[Survived] ObjectLiteral
src/services/fabric/IntentParser.ts:36:45
 
 // ── Time period parsing ───────────────────────────────────────────────────────
 
-const MONTH_INDEX: Record<string, number> = {
-  jan: 1, january: 1, feb: 2, february: 2, mar: 3, march: 3,
-  apr: 4, april: 4, may: 5, jun: 6, june: 6, jul: 7, july: 7,
-  aug: 8, august: 8, sep: 9, september: 9, oct: 10, october: 10,
-  nov: 11, november: 11, dec: 12, december: 12,
-};
+const MONTH_INDEX: Record<string, number> = {};
 const MONTH_PATTERN = '(?:jan(?:uary)?|feb(?:ruary)?|mar(?:ch)?|apr(?:il)?|may|jun(?:e)?|jul(?:y)?|aug(?:ust)?|sep(?:tember)?|oct(?:ober)?|nov(?:ember)?|dec(?:ember)?)';
 

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:46:7
 
 function parseTimePeriod(input: string): string | undefined {
   // Named relative periods (highest priority — most specific first)
-  if (/\byesterday\b/.test(input)) return 'yesterday';
+  if (false) return 'yesterday';
   if (/\btoday\b/.test(input)) return 'today';
   if (/\blast\s+week\b/.test(input)) return 'last_week';

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:47:7
 function parseTimePeriod(input: string): string | undefined {
   // Named relative periods (highest priority — most specific first)
   if (/\byesterday\b/.test(input)) return 'yesterday';
-  if (/\btoday\b/.test(input)) return 'today';
+  if (false) return 'today';
   if (/\blast\s+week\b/.test(input)) return 'last_week';
   if (/\bthis\s+week\b/.test(input)) return 'this_week';

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:48:7
   // Named relative periods (highest priority — most specific first)
   if (/\byesterday\b/.test(input)) return 'yesterday';
   if (/\btoday\b/.test(input)) return 'today';
-  if (/\blast\s+week\b/.test(input)) return 'last_week';
+  if (false) return 'last_week';
   if (/\bthis\s+week\b/.test(input)) return 'this_week';
   if (/\blast\s+month\b/.test(input)) return 'last_month';

[Survived] Regex
src/services/fabric/IntentParser.ts:48:7
   // Named relative periods (highest priority — most specific first)
   if (/\byesterday\b/.test(input)) return 'yesterday';
   if (/\btoday\b/.test(input)) return 'today';
-  if (/\blast\s+week\b/.test(input)) return 'last_week';
+  if (/\blast\sweek\b/.test(input)) return 'last_week';
   if (/\bthis\s+week\b/.test(input)) return 'this_week';
   if (/\blast\s+month\b/.test(input)) return 'last_month';

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:49:7
   if (/\byesterday\b/.test(input)) return 'yesterday';
   if (/\btoday\b/.test(input)) return 'today';
   if (/\blast\s+week\b/.test(input)) return 'last_week';
-  if (/\bthis\s+week\b/.test(input)) return 'this_week';
+  if (false) return 'this_week';
   if (/\blast\s+month\b/.test(input)) return 'last_month';
   if (/\bthis\s+month\b/.test(input)) return 'this_month';
killedBy: parseIntent parses commitments query intent
statusReason: expected undefined to be 'this_week' // Object.is equality

[Killed] StringLiteral
src/services/fabric/IntentParser.ts:49:45
   if (/\byesterday\b/.test(input)) return 'yesterday';
   if (/\btoday\b/.test(input)) return 'today';
   if (/\blast\s+week\b/.test(input)) return 'last_week';
-  if (/\bthis\s+week\b/.test(input)) return 'this_week';
+  if (/\bthis\s+week\b/.test(input)) return "";
   if (/\blast\s+month\b/.test(input)) return 'last_month';
   if (/\bthis\s+month\b/.test(input)) return 'this_month';
killedBy: parseIntent parses commitments query intent
statusReason: expected '' to be 'this_week' // Object.is equality

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:50:7
   if (/\btoday\b/.test(input)) return 'today';
   if (/\blast\s+week\b/.test(input)) return 'last_week';
   if (/\bthis\s+week\b/.test(input)) return 'this_week';
-  if (/\blast\s+month\b/.test(input)) return 'last_month';
+  if (false) return 'last_month';
   if (/\bthis\s+month\b/.test(input)) return 'this_month';
   if (/\bthis\s+year\b/.test(input)) return 'this_year';

[Survived] Regex
src/services/fabric/IntentParser.ts:50:7
   if (/\btoday\b/.test(input)) return 'today';
   if (/\blast\s+week\b/.test(input)) return 'last_week';
   if (/\bthis\s+week\b/.test(input)) return 'this_week';
-  if (/\blast\s+month\b/.test(input)) return 'last_month';
+  if (/\blast\S+month\b/.test(input)) return 'last_month';
   if (/\bthis\s+month\b/.test(input)) return 'this_month';
   if (/\bthis\s+year\b/.test(input)) return 'this_year';

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:51:7
   if (/\blast\s+week\b/.test(input)) return 'last_week';
   if (/\bthis\s+week\b/.test(input)) return 'this_week';
   if (/\blast\s+month\b/.test(input)) return 'last_month';
-  if (/\bthis\s+month\b/.test(input)) return 'this_month';
+  if (false) return 'this_month';
   if (/\bthis\s+year\b/.test(input)) return 'this_year';
   if (/\blast\s+year\b/.test(input)) return 'last_year';
killedBy: parseIntent parses spending queries with time period
statusReason: expected undefined to be 'this_month' // Object.is equality

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:52:7
   if (/\bthis\s+week\b/.test(input)) return 'this_week';
   if (/\blast\s+month\b/.test(input)) return 'last_month';
   if (/\bthis\s+month\b/.test(input)) return 'this_month';
-  if (/\bthis\s+year\b/.test(input)) return 'this_year';
+  if (false) return 'this_year';
   if (/\blast\s+year\b/.test(input)) return 'last_year';
 

[Survived] Regex
src/services/fabric/IntentParser.ts:52:7
   if (/\bthis\s+week\b/.test(input)) return 'this_week';
   if (/\blast\s+month\b/.test(input)) return 'last_month';
   if (/\bthis\s+month\b/.test(input)) return 'this_month';
-  if (/\bthis\s+year\b/.test(input)) return 'this_year';
+  if (/\bthis\S+year\b/.test(input)) return 'this_year';
   if (/\blast\s+year\b/.test(input)) return 'last_year';
 

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:53:7
   if (/\blast\s+month\b/.test(input)) return 'last_month';
   if (/\bthis\s+month\b/.test(input)) return 'this_month';
   if (/\bthis\s+year\b/.test(input)) return 'this_year';
-  if (/\blast\s+year\b/.test(input)) return 'last_year';
+  if (false) return 'last_year';
 
   // Rolling N months: "last 3 months", "past 3 months", "3 months ago"

[Survived] Regex
src/services/fabric/IntentParser.ts:56:31
   if (/\blast\s+year\b/.test(input)) return 'last_year';
 
   // Rolling N months: "last 3 months", "past 3 months", "3 months ago"
-  const nMonths = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+months?\b|\b(\d+)\s+months?\s+ago\b/i);
+  const nMonths = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\S+months?\b|\b(\d+)\s+months?\s+ago\b/i);
   if (nMonths) return `last_${nMonths[1] ?? nMonths[2]}_months`;
 

[Survived] Regex
src/services/fabric/IntentParser.ts:56:31
   if (/\blast\s+year\b/.test(input)) return 'last_year';
 
   // Rolling N months: "last 3 months", "past 3 months", "3 months ago"
-  const nMonths = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+months?\b|\b(\d+)\s+months?\s+ago\b/i);
+  const nMonths = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d)\s+months?\b|\b(\d+)\s+months?\s+ago\b/i);
   if (nMonths) return `last_${nMonths[1] ?? nMonths[2]}_months`;
 

[NoCoverage] LogicalOperator
src/services/fabric/IntentParser.ts:57:31
 
   // Rolling N months: "last 3 months", "past 3 months", "3 months ago"
   const nMonths = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+months?\b|\b(\d+)\s+months?\s+ago\b/i);
-  if (nMonths) return `last_${nMonths[1] ?? nMonths[2]}_months`;
+  if (nMonths) return `last_${nMonths[1] && nMonths[2]}_months`;
 
   // Rolling N weeks: "last 2 weeks", "past 4 weeks"

[Survived] Regex
src/services/fabric/IntentParser.ts:60:30
   if (nMonths) return `last_${nMonths[1] ?? nMonths[2]}_months`;
 
   // Rolling N weeks: "last 2 weeks", "past 4 weeks"
-  const nWeeks = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+weeks?\b|\b(\d+)\s+weeks?\s+ago\b/i);
+  const nWeeks = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+weeks?\b|\b(\d+)\s+weeks?\sago\b/i);
   if (nWeeks) return `last_${nWeeks[1] ?? nWeeks[2]}_weeks`;
 

[Survived] Regex
src/services/fabric/IntentParser.ts:60:30
   if (nMonths) return `last_${nMonths[1] ?? nMonths[2]}_months`;
 
   // Rolling N weeks: "last 2 weeks", "past 4 weeks"
-  const nWeeks = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+weeks?\b|\b(\d+)\s+weeks?\s+ago\b/i);
+  const nWeeks = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+weeks?\b|\b(\d)\s+weeks?\s+ago\b/i);
   if (nWeeks) return `last_${nWeeks[1] ?? nWeeks[2]}_weeks`;
 

[NoCoverage] LogicalOperator
src/services/fabric/IntentParser.ts:61:30
 
   // Rolling N weeks: "last 2 weeks", "past 4 weeks"
   const nWeeks = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+weeks?\b|\b(\d+)\s+weeks?\s+ago\b/i);
-  if (nWeeks) return `last_${nWeeks[1] ?? nWeeks[2]}_weeks`;
+  if (nWeeks) return `last_${nWeeks[1] && nWeeks[2]}_weeks`;
 
   // Rolling N days: "last 90 days", "past 30 days"

[Survived] Regex
src/services/fabric/IntentParser.ts:64:29
   if (nWeeks) return `last_${nWeeks[1] ?? nWeeks[2]}_weeks`;
 
   // Rolling N days: "last 90 days", "past 30 days"
-  const nDays = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+days?\b|\b(\d+)\s+days?\s+ago\b/i);
+  const nDays = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+days?\b|\b(\d)\s+days?\s+ago\b/i);
   if (nDays) return `last_${nDays[1] ?? nDays[2]}_days`;
 

[Survived] Regex
src/services/fabric/IntentParser.ts:64:29
   if (nWeeks) return `last_${nWeeks[1] ?? nWeeks[2]}_weeks`;
 
   // Rolling N days: "last 90 days", "past 30 days"
-  const nDays = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+days?\b|\b(\d+)\s+days?\s+ago\b/i);
+  const nDays = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+days?\b|\b(\d+)\S+days?\s+ago\b/i);
   if (nDays) return `last_${nDays[1] ?? nDays[2]}_days`;
 

[NoCoverage] LogicalOperator
src/services/fabric/IntentParser.ts:65:29
 
   // Rolling N days: "last 90 days", "past 30 days"
   const nDays = input.match(/\b(?:last|past|(?:in the last)|(?:over the last))\s+(\d+)\s+days?\b|\b(\d+)\s+days?\s+ago\b/i);
-  if (nDays) return `last_${nDays[1] ?? nDays[2]}_days`;
+  if (nDays) return `last_${nDays[1] && nDays[2]}_days`;
 
   // Specific month + year: "january 2026", "jan 2025"

[Killed] StringLiteral
src/services/fabric/IntentParser.ts:68:32
   if (nDays) return `last_${nDays[1] ?? nDays[2]}_days`;
 
   // Specific month + year: "january 2026", "jan 2025"
-  const monthYear = new RegExp(`\\b(${MONTH_PATTERN})\\s+(20\\d{2})\\b`, 'i').exec(input);
+  const monthYear = new RegExp(``, 'i').exec(input);
   if (monthYear) {
     const key = monthYear[1].toLowerCase().slice(0, 3);
killedBy: parseIntent parses record expense with amount and category
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[NoCoverage] BlockStatement
src/services/fabric/IntentParser.ts:69:18
 
   // Specific month + year: "january 2026", "jan 2025"
   const monthYear = new RegExp(`\\b(${MONTH_PATTERN})\\s+(20\\d{2})\\b`, 'i').exec(input);
-  if (monthYear) {
-    const key = monthYear[1].toLowerCase().slice(0, 3);
-    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toLowerCase()];
-    if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;
-  }
+  if (monthYear) {}
 
   // "in january" or "last january" (no year — nearest past occurrence)

[NoCoverage] MethodExpression
src/services/fabric/IntentParser.ts:70:17
   // Specific month + year: "january 2026", "jan 2025"
   const monthYear = new RegExp(`\\b(${MONTH_PATTERN})\\s+(20\\d{2})\\b`, 'i').exec(input);
   if (monthYear) {
-    const key = monthYear[1].toLowerCase().slice(0, 3);
+    const key = monthYear[1].toUpperCase().slice(0, 3);
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toLowerCase()];
     if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;

[NoCoverage] MethodExpression
src/services/fabric/IntentParser.ts:70:17
   // Specific month + year: "january 2026", "jan 2025"
   const monthYear = new RegExp(`\\b(${MONTH_PATTERN})\\s+(20\\d{2})\\b`, 'i').exec(input);
   if (monthYear) {
-    const key = monthYear[1].toLowerCase().slice(0, 3);
+    const key = monthYear[1].toLowerCase();
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toLowerCase()];
     if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;

[NoCoverage] LogicalOperator
src/services/fabric/IntentParser.ts:71:17
   const monthYear = new RegExp(`\\b(${MONTH_PATTERN})\\s+(20\\d{2})\\b`, 'i').exec(input);
   if (monthYear) {
     const key = monthYear[1].toLowerCase().slice(0, 3);
-    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toLowerCase()];
+    const idx = MONTH_INDEX[key] && MONTH_INDEX[monthYear[1].toLowerCase()];
     if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;
   }

[NoCoverage] MethodExpression
src/services/fabric/IntentParser.ts:71:49
   const monthYear = new RegExp(`\\b(${MONTH_PATTERN})\\s+(20\\d{2})\\b`, 'i').exec(input);
   if (monthYear) {
     const key = monthYear[1].toLowerCase().slice(0, 3);
-    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toLowerCase()];
+    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toUpperCase()];
     if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;
   }

[NoCoverage] ConditionalExpression
src/services/fabric/IntentParser.ts:72:9
   if (monthYear) {
     const key = monthYear[1].toLowerCase().slice(0, 3);
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toLowerCase()];
-    if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;
+    if (true) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;
   }
 

[NoCoverage] StringLiteral
src/services/fabric/IntentParser.ts:72:70
   if (monthYear) {
     const key = monthYear[1].toLowerCase().slice(0, 3);
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthYear[1].toLowerCase()];
-    if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, '0')}`;
+    if (idx) return `month_${monthYear[2]}_${String(idx).padStart(2, "")}`;
   }
 

[Killed] StringLiteral
src/services/fabric/IntentParser.ts:76:32
   }
 
   // "in january" or "last january" (no year — nearest past occurrence)
-  const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, 'i').exec(input);
+  const monthOnly = new RegExp(``, 'i').exec(input);
   if (monthOnly) {
     const key = monthOnly[1].toLowerCase().slice(0, 3);
killedBy: parseIntent parses record expense with amount and category
statusReason: Cannot read properties of undefined (reading 'toLowerCase')

[Survived] StringLiteral
src/services/fabric/IntentParser.ts:76:75
   }
 
   // "in january" or "last january" (no year — nearest past occurrence)
-  const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, 'i').exec(input);
+  const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, "").exec(input);
   if (monthOnly) {
     const key = monthOnly[1].toLowerCase().slice(0, 3);

[NoCoverage] BlockStatement
src/services/fabric/IntentParser.ts:77:18
 
   // "in january" or "last january" (no year — nearest past occurrence)
   const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, 'i').exec(input);
-  if (monthOnly) {
-    const key = monthOnly[1].toLowerCase().slice(0, 3);
-    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toLowerCase()];
-    if (idx) {
-      const now = new Date();
-      let year = now.getFullYear();
-      if (idx > now.getMonth() + 1) year -= 1; // month hasn't occurred yet this year
-      return `month_${year}_${String(idx).padStart(2, '0')}`;
-    }
-  }
+  if (monthOnly) {}
 
   // Specific 4-digit year: "in 2025", "during 2024"

[NoCoverage] MethodExpression
src/services/fabric/IntentParser.ts:78:17
   // "in january" or "last january" (no year — nearest past occurrence)
   const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, 'i').exec(input);
   if (monthOnly) {
-    const key = monthOnly[1].toLowerCase().slice(0, 3);
+    const key = monthOnly[1].toUpperCase().slice(0, 3);
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toLowerCase()];
     if (idx) {

[NoCoverage] MethodExpression
src/services/fabric/IntentParser.ts:78:17
   // "in january" or "last january" (no year — nearest past occurrence)
   const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, 'i').exec(input);
   if (monthOnly) {
-    const key = monthOnly[1].toLowerCase().slice(0, 3);
+    const key = monthOnly[1].toLowerCase();
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toLowerCase()];
     if (idx) {

[NoCoverage] LogicalOperator
src/services/fabric/IntentParser.ts:79:17
   const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, 'i').exec(input);
   if (monthOnly) {
     const key = monthOnly[1].toLowerCase().slice(0, 3);
-    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toLowerCase()];
+    const idx = MONTH_INDEX[key] && MONTH_INDEX[monthOnly[1].toLowerCase()];
     if (idx) {
       const now = new Date();

[NoCoverage] MethodExpression
src/services/fabric/IntentParser.ts:79:49
   const monthOnly = new RegExp(`\\b(?:in|last)\\s+(${MONTH_PATTERN})\\b`, 'i').exec(input);
   if (monthOnly) {
     const key = monthOnly[1].toLowerCase().slice(0, 3);
-    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toLowerCase()];
+    const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toUpperCase()];
     if (idx) {
       const now = new Date();

[NoCoverage] BlockStatement
src/services/fabric/IntentParser.ts:80:14
   if (monthOnly) {
     const key = monthOnly[1].toLowerCase().slice(0, 3);
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toLowerCase()];
-    if (idx) {
-      const now = new Date();
-      let year = now.getFullYear();
-      if (idx > now.getMonth() + 1) year -= 1; // month hasn't occurred yet this year
-      return `month_${year}_${String(idx).padStart(2, '0')}`;
-    }
+    if (idx) {}
   }
 

[NoCoverage] ConditionalExpression
src/services/fabric/IntentParser.ts:80:9
   if (monthOnly) {
     const key = monthOnly[1].toLowerCase().slice(0, 3);
     const idx = MONTH_INDEX[key] ?? MONTH_INDEX[monthOnly[1].toLowerCase()];
-    if (idx) {
+    if (false) {
       const now = new Date();
       let year = now.getFullYear();

[NoCoverage] ConditionalExpression
src/services/fabric/IntentParser.ts:83:11
     if (idx) {
       const now = new Date();
       let year = now.getFullYear();
-      if (idx > now.getMonth() + 1) year -= 1; // month hasn't occurred yet this year
+      if (true) year -= 1; // month hasn't occurred yet this year
       return `month_${year}_${String(idx).padStart(2, '0')}`;
     }

[NoCoverage] EqualityOperator
src/services/fabric/IntentParser.ts:83:11
     if (idx) {
       const now = new Date();
       let year = now.getFullYear();
-      if (idx > now.getMonth() + 1) year -= 1; // month hasn't occurred yet this year
+      if (idx >= now.getMonth() + 1) year -= 1; // month hasn't occurred yet this year
       return `month_${year}_${String(idx).padStart(2, '0')}`;
     }

[NoCoverage] StringLiteral
src/services/fabric/IntentParser.ts:84:14
       const now = new Date();
       let year = now.getFullYear();
       if (idx > now.getMonth() + 1) year -= 1; // month hasn't occurred yet this year
-      return `month_${year}_${String(idx).padStart(2, '0')}`;
+      return ``;
     }
   }

[NoCoverage] StringLiteral
src/services/fabric/IntentParser.ts:84:55
       const now = new Date();
       let year = now.getFullYear();
       if (idx > now.getMonth() + 1) year -= 1; // month hasn't occurred yet this year
-      return `month_${year}_${String(idx).padStart(2, '0')}`;
+      return `month_${year}_${String(idx).padStart(2, "")}`;
     }
   }

[Survived] Regex
src/services/fabric/IntentParser.ts:89:33
   }
 
   // Specific 4-digit year: "in 2025", "during 2024"
-  const yearMatch = input.match(/\b(?:in|during|for)?\s*(20\d{2})\b/);
+  const yearMatch = input.match(/\b(?:in|during|for)?\S*(20\d{2})\b/);
   if (yearMatch) return `year_${yearMatch[1]}`;
 

[Killed] StringLiteral
src/services/fabric/IntentParser.ts:98:45
 // ── Category detection ────────────────────────────────────────────────────────
 
 const STOPWORDS = new Set([
-  'record', 'add', 'log', 'track', 'spent', 'spend', 'expense', 'expenses',
+  'record', 'add', 'log', 'track', 'spent', "", 'expense', 'expenses',
   'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
killedBy: FabricService returns structured query results for spending question
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/services/fabric/IntentParser.ts:99:40
 
 const STOPWORDS = new Set([
   'record', 'add', 'log', 'track', 'spent', 'spend', 'expense', 'expenses',
-  'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
+  'income', 'how', 'much', 'did', 'i', "", 'month', 'week',
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
   'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
killedBy: FabricService returns structured query results for spending question
statusReason: expected false to be true // Object.is equality

[Killed] StringLiteral
src/services/fabric/IntentParser.ts:99:13
 
 const STOPWORDS = new Set([
   'record', 'add', 'log', 'track', 'spent', 'spend', 'expense', 'expenses',
-  'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
+  'income', "", 'much', 'did', 'i', 'this', 'month', 'week',
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
   'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
killedBy: FabricService returns structured query results for spending question
statusReason: expected false to be true // Object.is equality

[Survived] StringLiteral
src/services/fabric/IntentParser.ts:100:37
 const STOPWORDS = new Set([
   'record', 'add', 'log', 'track', 'spent', 'spend', 'expense', 'expenses',
   'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
-  'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
+  'today', 'yesterday', 'go', 'to', "", 'my', 'commitments', 'tasks',
   'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
   'what', 'where', 'when', 'is', 'was', 'will', 'can', 'please', 'just',

[Survived] StringLiteral
src/services/fabric/IntentParser.ts:100:66
 const STOPWORDS = new Set([
   'record', 'add', 'log', 'track', 'spent', 'spend', 'expense', 'expenses',
   'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
-  'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
+  'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', "",
   'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
   'what', 'where', 'when', 'is', 'was', 'will', 'can', 'please', 'just',

[Survived] StringLiteral
src/services/fabric/IntentParser.ts:101:67
   'record', 'add', 'log', 'track', 'spent', 'spend', 'expense', 'expenses',
   'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
-  'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
+  'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', "",
   'what', 'where', 'when', 'is', 'was', 'will', 'can', 'please', 'just',
   'naira', 'dollars', 'usd', 'ngn', 'open', 'navigate', 'summarize', 'summary',

[Survived] StringLiteral
src/services/fabric/IntentParser.ts:101:3
   'record', 'add', 'log', 'track', 'spent', 'spend', 'expense', 'expenses',
   'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
-  'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
+  "", 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
   'what', 'where', 'when', 'is', 'was', 'will', 'can', 'please', 'just',
   'naira', 'dollars', 'usd', 'ngn', 'open', 'navigate', 'summarize', 'summary',

[Survived] StringLiteral
src/services/fabric/IntentParser.ts:102:34
   'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
   'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
-  'what', 'where', 'when', 'is', 'was', 'will', 'can', 'please', 'just',
+  'what', 'where', 'when', 'is', "", 'will', 'can', 'please', 'just',
   'naira', 'dollars', 'usd', 'ngn', 'open', 'navigate', 'summarize', 'summary',
 ]);
