[Survived] StringLiteral
src/services/fabric/IntentParser.ts:102:41
   'income', 'how', 'much', 'did', 'i', 'this', 'month', 'week',
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
   'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
-  'what', 'where', 'when', 'is', 'was', 'will', 'can', 'please', 'just',
+  'what', 'where', 'when', 'is', 'was', "", 'can', 'please', 'just',
   'naira', 'dollars', 'usd', 'ngn', 'open', 'navigate', 'summarize', 'summary',
 ]);

[Survived] StringLiteral
src/services/fabric/IntentParser.ts:103:37
   'today', 'yesterday', 'go', 'to', 'show', 'my', 'commitments', 'tasks',
   'last', 'the', 'a', 'an', 'for', 'on', 'in', 'at', 'of', 'and', 'or',
   'what', 'where', 'when', 'is', 'was', 'will', 'can', 'please', 'just',
-  'naira', 'dollars', 'usd', 'ngn', 'open', 'navigate', 'summarize', 'summary',
+  'naira', 'dollars', 'usd', 'ngn', "", 'navigate', 'summarize', 'summary',
 ]);
 

[Killed] MethodExpression
src/services/fabric/IntentParser.ts:111:22
  * Checks against known category keywords first; falls back to first non-stopword.
  */
 function parseCategory(input: string): string | undefined {
-  const normalized = input.toLowerCase();
+  const normalized = input.toUpperCase();
 
   // Check known categories from heuristics
killedBy: parseIntent parses record expense with amount and category
statusReason: expected undefined to be 'Groceries' // Object.is equality

[Killed] BlockStatement
src/services/fabric/IntentParser.ts:114:97
   const normalized = input.toLowerCase();
 
   // Check known categories from heuristics
-  for (const [category, keywords] of Object.entries(CATEGORY_KEYWORDS) as [string, string[]][]) {
-    if (keywords.some((kw) => normalized.includes(kw.toLowerCase()))) {
-      return category;
-    }
-  }
+  for (const [category, keywords] of Object.entries(CATEGORY_KEYWORDS) as [string, string[]][]) {}
 
   // Fallback: first meaningful word not in stoplist
killedBy: parseIntent parses record expense with amount and category
statusReason: expected 'groceries' to be 'Groceries' // Object.is equality

[Killed] MethodExpression
src/services/fabric/IntentParser.ts:115:9
 
   // Check known categories from heuristics
   for (const [category, keywords] of Object.entries(CATEGORY_KEYWORDS) as [string, string[]][]) {
-    if (keywords.some((kw) => normalized.includes(kw.toLowerCase()))) {
+    if (keywords.every(kw => normalized.includes(kw.toLowerCase()))) {
       return category;
     }
killedBy: parseIntent parses record expense with amount and category
statusReason: expected 'groceries' to be 'Groceries' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:115:9
 
   // Check known categories from heuristics
   for (const [category, keywords] of Object.entries(CATEGORY_KEYWORDS) as [string, string[]][]) {
-    if (keywords.some((kw) => normalized.includes(kw.toLowerCase()))) {
+    if (true) {
       return category;
     }
killedBy: parseIntent parses record expense with amount and category
statusReason: expected 'Transportation' to be 'Groceries' // Object.is equality

[Survived] MethodExpression
src/services/fabric/IntentParser.ts:121:17
   }
 
   // Fallback: first meaningful word not in stoplist
-  const words = normalized.replace(/[^a-z\s]/g, ' ').split(/\s+/).filter(Boolean);
+  const words = normalized.replace(/[^a-z\s]/g, ' ').split(/\s+/);
   return words.find((w) => w.length > 2 && !STOPWORDS.has(w));
 }

[Killed] Regex
src/services/fabric/IntentParser.ts:121:36
   }
 
   // Fallback: first meaningful word not in stoplist
-  const words = normalized.replace(/[^a-z\s]/g, ' ').split(/\s+/).filter(Boolean);
+  const words = normalized.replace(/[a-z\s]/g, ' ').split(/\s+/).filter(Boolean);
   return words.find((w) => w.length > 2 && !STOPWORDS.has(w));
 }
killedBy: parseIntent parses record income intent
statusReason: expected '1200' to be 'salary' // Object.is equality

[Killed] EqualityOperator
src/services/fabric/IntentParser.ts:122:28
 
   // Fallback: first meaningful word not in stoplist
   const words = normalized.replace(/[^a-z\s]/g, ' ').split(/\s+/).filter(Boolean);
-  return words.find((w) => w.length > 2 && !STOPWORDS.has(w));
+  return words.find((w) => w.length <= 2 && !STOPWORDS.has(w));
 }
 
killedBy: parseIntent parses record income intent
statusReason: expected undefined to be 'salary' // Object.is equality

[Killed] ArrowFunction
src/services/fabric/IntentParser.ts:122:21
 
   // Fallback: first meaningful word not in stoplist
   const words = normalized.replace(/[^a-z\s]/g, ' ').split(/\s+/).filter(Boolean);
-  return words.find((w) => w.length > 2 && !STOPWORDS.has(w));
+  return words.find(() => undefined);
 }
 
killedBy: parseIntent parses record income intent
statusReason: expected undefined to be 'salary' // Object.is equality

[Killed] LogicalOperator
src/services/fabric/IntentParser.ts:145:7
     action: 'record_expense',
     priority: 90,
     test: (i) =>
-      /\b(record|add|log|track|paid|just paid|spent|i spent)\b/.test(i) &&
-      /\b(expense|buy|bought|food|fuel|bill|transport|groceries|rent|subscription)\b/.test(i),
+      /\b(record|add|log|track|paid|just paid|spent|i spent)\b/.test(i) || /\b(expense|buy|bought|food|fuel|bill|transport|groceries|rent|subscription)\b/.test(i),
   },
   {
killedBy: parseIntent parses record income intent
statusReason: expected 'record_expense' to be 'record_income' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:145:7
     action: 'record_expense',
     priority: 90,
     test: (i) =>
-      /\b(record|add|log|track|paid|just paid|spent|i spent)\b/.test(i) &&
-      /\b(expense|buy|bought|food|fuel|bill|transport|groceries|rent|subscription)\b/.test(i),
+      true,
   },
   {
killedBy: parseIntent parses spending queries with time period
statusReason: expected 'record_expense' to be 'query_spending' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:152:7
     action: 'record_expense',
     priority: 85,
     test: (i) =>
-      /\b(record|add|log|track)\b/.test(i) &&
-      /₦|\$|naira|dollars?/.test(i),
+      true,
   },
   {
killedBy: FabricService returns ambient context and unknown parse intent fallback
statusReason: expected 'record_expense' to be 'query_spending' // Object.is equality

[Survived] LogicalOperator
src/services/fabric/IntentParser.ts:152:7
     action: 'record_expense',
     priority: 85,
     test: (i) =>
-      /\b(record|add|log|track)\b/.test(i) &&
-      /₦|\$|naira|dollars?/.test(i),
+      /\b(record|add|log|track)\b/.test(i) || /₦|\$|naira|dollars?/.test(i),
   },
   {

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:159:7
     action: 'record_income',
     priority: 90,
     test: (i) =>
-      /\b(record|add|log|received|got paid|salary|credited)\b/.test(i) &&
-      /\b(income|salary|credit|payment|received)\b/.test(i),
+      true,
   },
   // Week summary
killedBy: FabricService returns ambient context and unknown parse intent fallback
statusReason: expected 'record_income' to be 'query_spending' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:159:7
     action: 'record_income',
     priority: 90,
     test: (i) =>
-      /\b(record|add|log|received|got paid|salary|credited)\b/.test(i) &&
-      /\b(income|salary|credit|payment|received)\b/.test(i),
+      false,
   },
   // Week summary
killedBy: parseIntent parses record income intent
statusReason: expected 'query_income' to be 'record_income' // Object.is equality

[Survived] Regex
src/services/fabric/IntentParser.ts:166:18
   {
     action: 'summarize_week',
     priority: 80,
-    test: (i) => /\b(week(ly)?\s+(summary|report|review)|how\s+(did|was)\s+my\s+week|this\s+week\s+recap)\b/.test(i),
+    test: (i) => /\b(week(ly)?\s+(summary|report|review)|how\s+(did|was)\s+my\s+week|this\s+week\srecap)\b/.test(i),
   },
   // Commitment queries

[Survived] Regex
src/services/fabric/IntentParser.ts:166:18
   {
     action: 'summarize_week',
     priority: 80,
-    test: (i) => /\b(week(ly)?\s+(summary|report|review)|how\s+(did|was)\s+my\s+week|this\s+week\s+recap)\b/.test(i),
+    test: (i) => /\b(week(ly)?\s(summary|report|review)|how\s+(did|was)\s+my\s+week|this\s+week\s+recap)\b/.test(i),
   },
   // Commitment queries

[Survived] Regex
src/services/fabric/IntentParser.ts:179:7
     action: 'query_spending',
     priority: 60,
     test: (i) =>
-      /\b(how\s+much|spent|spending|expense|expenses|cost|budget|what\s+did\s+i\s+(spend|pay))\b/.test(i),
+      /\b(how\s+much|spent|spending|expense|expenses|cost|budget|what\s+did\s+i\S+(spend|pay))\b/.test(i),
   },
   // Income queries

[Survived] Regex
src/services/fabric/IntentParser.ts:185:18
   {
     action: 'query_income',
     priority: 60,
-    test: (i) => /\b(income|earned|earning|salary|how\s+much\s+(did\s+i\s+)?(earn|make|receive|get\s+paid))\b/.test(i),
+    test: (i) => /\b(income|earned|earning|salary|how\smuch\s+(did\s+i\s+)?(earn|make|receive|get\s+paid))\b/.test(i),
   },
   // Account balance queries

[Survived] Regex
src/services/fabric/IntentParser.ts:185:18
   {
     action: 'query_income',
     priority: 60,
-    test: (i) => /\b(income|earned|earning|salary|how\s+much\s+(did\s+i\s+)?(earn|make|receive|get\s+paid))\b/.test(i),
+    test: (i) => /\b(income|earned|earning|salary|how\s+much\s(did\s+i\s+)?(earn|make|receive|get\s+paid))\b/.test(i),
   },
   // Account balance queries

[Survived] Regex
src/services/fabric/IntentParser.ts:191:18
   {
     action: 'query_accounts',
     priority: 55,
-    test: (i) => /\b(account|accounts|balance|balances|how\s+much\s+(do\s+i\s+have|is\s+in))\b/.test(i),
+    test: (i) => /\b(account|accounts|balance|balances|how\s+much\s+(do\s+i\shave|is\s+in))\b/.test(i),
   },
   // Recurring transaction queries

[Survived] Regex
src/services/fabric/IntentParser.ts:191:18
   {
     action: 'query_accounts',
     priority: 55,
-    test: (i) => /\b(account|accounts|balance|balances|how\s+much\s+(do\s+i\s+have|is\s+in))\b/.test(i),
+    test: (i) => /\b(account|accounts|balance|balances|how\s+much\s+(do\si\s+have|is\s+in))\b/.test(i),
   },
   // Recurring transaction queries

[Survived] Regex
src/services/fabric/IntentParser.ts:209:18
   {
     action: 'query_net_worth',
     priority: 55,
-    test: (i) => /\b(net\s+worth|total\s+wealth|overall\s+balance|financial\s+position)\b/.test(i),
+    test: (i) => /\b(net\s+worth|total\s+wealth|overall\s+balance|financial\S+position)\b/.test(i),
   },
   // Today's schedule

[Survived] Regex
src/services/fabric/IntentParser.ts:209:18
   {
     action: 'query_net_worth',
     priority: 55,
-    test: (i) => /\b(net\s+worth|total\s+wealth|overall\s+balance|financial\s+position)\b/.test(i),
+    test: (i) => /\b(net\sworth|total\s+wealth|overall\s+balance|financial\s+position)\b/.test(i),
   },
   // Today's schedule

[Survived] Regex
src/services/fabric/IntentParser.ts:215:18
   {
     action: 'query_today',
     priority: 75,
-    test: (i) => /\b(what\s+(do\s+i\s+have|is\s+on|should\s+i\s+do)\s+today|today's?\s+(schedule|plan|tasks?|agenda)|what's?\s+today)\b/.test(i),
+    test: (i) => /\b(what\s+(do\s+i\s+have|is\s+on|should\s+i\S+do)\s+today|today's?\s+(schedule|plan|tasks?|agenda)|what's?\s+today)\b/.test(i),
   },
   // Upcoming / what's coming

[Survived] Regex
src/services/fabric/IntentParser.ts:215:18
   {
     action: 'query_today',
     priority: 75,
-    test: (i) => /\b(what\s+(do\s+i\s+have|is\s+on|should\s+i\s+do)\s+today|today's?\s+(schedule|plan|tasks?|agenda)|what's?\s+today)\b/.test(i),
+    test: (i) => /\b(what\s+(do\s+i\s+have|is\s+on|should\s+i\s+do)\s+today|today's?\S+(schedule|plan|tasks?|agenda)|what's?\s+today)\b/.test(i),
   },
   // Upcoming / what's coming

[Survived] Regex
src/services/fabric/IntentParser.ts:221:18
   {
     action: 'query_upcoming',
     priority: 65,
-    test: (i) => /\b(what's?\s+coming\s+up|upcoming\s+(bills?|payments?|expenses?)|due\s+soon|next\s+(bill|payment)|what\s+do\s+i\s+owe|remind\s+me)\b/.test(i),
+    test: (i) => /\b(what's?\s+coming\s+up|upcoming\s+(bills?|payments?|expenses?)|due\s+soon|next\s+(bill|payment)|what\s+do\s+i\s+owe|remind\sme)\b/.test(i),
   },
   // Week planning

[Survived] Regex
src/services/fabric/IntentParser.ts:221:18
   {
     action: 'query_upcoming',
     priority: 65,
-    test: (i) => /\b(what's?\s+coming\s+up|upcoming\s+(bills?|payments?|expenses?)|due\s+soon|next\s+(bill|payment)|what\s+do\s+i\s+owe|remind\s+me)\b/.test(i),
+    test: (i) => /\b(what's?\scoming\s+up|upcoming\s+(bills?|payments?|expenses?)|due\s+soon|next\s+(bill|payment)|what\s+do\s+i\s+owe|remind\s+me)\b/.test(i),
   },
   // Week planning

[Survived] Regex
src/services/fabric/IntentParser.ts:227:18
   {
     action: 'plan_week',
     priority: 78,
-    test: (i) => /\b(plan\s+(my\s+)?week|week\s+(ahead|plan|overview|preview)|help\s+me\s+plan|what's?\s+(this|next)\s+week)\b/.test(i),
+    test: (i) => /\b(plan\s+(my\s+)?week|week\s+(ahead|plan|overview|preview)|help\s+me\S+plan|what's?\s+(this|next)\s+week)\b/.test(i),
   },
 ];

[Survived] Regex
src/services/fabric/IntentParser.ts:227:18
   {
     action: 'plan_week',
     priority: 78,
-    test: (i) => /\b(plan\s+(my\s+)?week|week\s+(ahead|plan|overview|preview)|help\s+me\s+plan|what's?\s+(this|next)\s+week)\b/.test(i),
+    test: (i) => /\b(plan\s+(my\S+)?week|week\s+(ahead|plan|overview|preview)|help\s+me\s+plan|what's?\s+(this|next)\s+week)\b/.test(i),
   },
 ];

[Survived] MethodExpression
src/services/fabric/IntentParser.ts:232:18
 ];
 
 function detectAction(input: string): IntentAction {
-  const sorted = [...INTENT_RULES].sort((a, b) => b.priority - a.priority);
+  const sorted = [...INTENT_RULES];
   for (const rule of sorted) {
     if (rule.test(input)) return rule.action;

[Survived] ArithmeticOperator
src/services/fabric/IntentParser.ts:232:51
 ];
 
 function detectAction(input: string): IntentAction {
-  const sorted = [...INTENT_RULES].sort((a, b) => b.priority - a.priority);
+  const sorted = [...INTENT_RULES].sort((a, b) => b.priority + a.priority);
   for (const rule of sorted) {
     if (rule.test(input)) return rule.action;

[Killed] BlockStatement
src/services/fabric/IntentParser.ts:233:30
 
 function detectAction(input: string): IntentAction {
   const sorted = [...INTENT_RULES].sort((a, b) => b.priority - a.priority);
-  for (const rule of sorted) {
-    if (rule.test(input)) return rule.action;
-  }
+  for (const rule of sorted) {}
   return 'unknown';
 }
killedBy: FabricService returns ambient context and unknown parse intent fallback
statusReason: expected 'unknown' to be 'query_spending' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:234:9
 function detectAction(input: string): IntentAction {
   const sorted = [...INTENT_RULES].sort((a, b) => b.priority - a.priority);
   for (const rule of sorted) {
-    if (rule.test(input)) return rule.action;
+    if (false) return rule.action;
   }
   return 'unknown';
killedBy: FabricService returns ambient context and unknown parse intent fallback
statusReason: expected 'unknown' to be 'query_spending' // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:234:9
 function detectAction(input: string): IntentAction {
   const sorted = [...INTENT_RULES].sort((a, b) => b.priority - a.priority);
   for (const rule of sorted) {
-    if (rule.test(input)) return rule.action;
+    if (true) return rule.action;
   }
   return 'unknown';
killedBy: FabricService returns ambient context and unknown parse intent fallback
statusReason: expected 'navigate' to be 'query_spending' // Object.is equality

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:241:5
 
 function confidenceFor(action: IntentAction): number {
   switch (action) {
-    case 'navigate': return 0.92;
+    case 'navigate':
     case 'record_expense':
     case 'record_income': return 0.88;

[Survived] ConditionalExpression
src/services/fabric/IntentParser.ts:243:5
   switch (action) {
     case 'navigate': return 0.92;
     case 'record_expense':
-    case 'record_income': return 0.88;
+    case 'record_income':
     case 'summarize_week': return 0.85;
     case 'query_spending':

[NoCoverage] ConditionalExpression
src/services/fabric/IntentParser.ts:244:5
     case 'navigate': return 0.92;
     case 'record_expense':
     case 'record_income': return 0.88;
-    case 'summarize_week': return 0.85;
+    case 'summarize_week':
     case 'query_spending':
     case 'query_income':

[Killed] ConditionalExpression
src/services/fabric/IntentParser.ts:254:5
     case 'query_net_worth':
     case 'query_today':
     case 'query_upcoming':
-    case 'plan_week': return 0.80;
+    case 'plan_week':
     default: return 0.20;
   }
killedBy: parseIntent parses spending queries with time period
statusReason: expected 0.2 to be greater than 0.7

[Killed] MethodExpression
src/services/fabric/IntentParser.ts:262:17
 // ── Public API ────────────────────────────────────────────────────────────────
 
 export function parseIntent(rawInput: string): ParsedIntent {
-  const input = rawInput.toLowerCase().trim();
+  const input = rawInput.toUpperCase().trim();
   const action = detectAction(input);
 
killedBy: parseIntent parses spending queries with time period
statusReason: expected 'unknown' to be 'query_spending' // Object.is equality

[Survived] MethodExpression
src/services/fabric/IntentParser.ts:262:17
 // ── Public API ────────────────────────────────────────────────────────────────
 
 export function parseIntent(rawInput: string): ParsedIntent {
-  const input = rawInput.toLowerCase().trim();
+  const input = rawInput.toLowerCase();
   const action = detectAction(input);
 

[Killed] ArrowFunction
src/services/fabric/IntentParser.ts:265:31
   const input = rawInput.toLowerCase().trim();
   const action = detectAction(input);
 
-  const page = NAV_PAGES.find((candidate) => input.includes(candidate));
+  const page = NAV_PAGES.find(() => undefined);
 
   return {
killedBy: parseIntent parses navigation intent
statusReason: expected undefined to be 'settings' // Object.is equality
