[Killed] LogicalOperator
src/services/fabric/PredictionsEngine.ts:12:10
 }
 
 function inMonth(date: Date, year: number, month: number): boolean {
-  return date.getFullYear() === year && date.getMonth() === month;
+  return date.getFullYear() === year || date.getMonth() === month;
 }
 
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:12:41
 }
 
 function inMonth(date: Date, year: number, month: number): boolean {
-  return date.getFullYear() === year && date.getMonth() === month;
+  return date.getFullYear() === year && true;
 }
 
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:17:3
 
 function nextIso(now: Date, days: number): string {
   const copy = new Date(now);
-  copy.setDate(copy.getDate() + days);
+  copy.setTime(copy.getDate() + days);
   return copy.toISOString();
 }

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:17:16
 
 function nextIso(now: Date, days: number): string {
   const copy = new Date(now);
-  copy.setDate(copy.getDate() + days);
+  copy.setDate(copy.getDate() - days);
   return copy.toISOString();
 }

[Killed] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:31:54
   // Use month key in IDs so dismissed predictions reset each month
   const mKey = monthKey(now);
 
-  const expenses = input.transactions.filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted);
+  const expenses = input.transactions.filter((tx) => false);
 
   // ─── 1. Budget overage ──────────────────────────────────────────────────────
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/PredictionsEngine.ts:31:54
   // Use month key in IDs so dismissed predictions reset each month
   const mKey = monthKey(now);
 
-  const expenses = input.transactions.filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted);
+  const expenses = input.transactions.filter((tx) => tx.type !== 'expense' && !tx.isSoftDeleted);
 
   // ─── 1. Budget overage ──────────────────────────────────────────────────────
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/fabric/PredictionsEngine.ts:34:53
   const expenses = input.transactions.filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted);
 
   // ─── 1. Budget overage ──────────────────────────────────────────────────────
-  const thisMonthExpenses = expenses.filter((tx) => {
-    const d = toDate(tx.date);
-    return !!d && inMonth(d, year, month);
-  });
+  const thisMonthExpenses = expenses.filter((tx) => {});
   const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum + tx.amountCents, 0);
 
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:34:29
   const expenses = input.transactions.filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted);
 
   // ─── 1. Budget overage ──────────────────────────────────────────────────────
-  const thisMonthExpenses = expenses.filter((tx) => {
-    const d = toDate(tx.date);
-    return !!d && inMonth(d, year, month);
-  });
+  const thisMonthExpenses = expenses;
   const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Killed] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:36:12
   // ─── 1. Budget overage ──────────────────────────────────────────────────────
   const thisMonthExpenses = expenses.filter((tx) => {
     const d = toDate(tx.date);
-    return !!d && inMonth(d, year, month);
+    return false;
   });
   const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum + tx.amountCents, 0);
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:36:12
   // ─── 1. Budget overage ──────────────────────────────────────────────────────
   const thisMonthExpenses = expenses.filter((tx) => {
     const d = toDate(tx.date);
-    return !!d && inMonth(d, year, month);
+    return true;
   });
   const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum + tx.amountCents, 0);

[Killed] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:38:59
     const d = toDate(tx.date);
     return !!d && inMonth(d, year, month);
   });
-  const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum + tx.amountCents, 0);
+  const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum - tx.amountCents, 0);
 
   const lastMonthDate = new Date(year, month - 1, 1);
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:40:40
   });
   const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  const lastMonthDate = new Date(year, month - 1, 1);
+  const lastMonthDate = new Date(year, month + 1, 1);
   const lastMonth = expenses
     .filter((tx) => {
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
src/services/fabric/PredictionsEngine.ts:41:21
   const thisMonth = thisMonthExpenses.reduce((sum, tx) => sum + tx.amountCents, 0);
 
   const lastMonthDate = new Date(year, month - 1, 1);
-  const lastMonth = expenses
-    .filter((tx) => {
-      const d = toDate(tx.date);
-      return !!d && inMonth(d, lastMonthDate.getFullYear(), lastMonthDate.getMonth());
-    })
+  const lastMonth = expenses
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/fabric/PredictionsEngine.ts:42:21
 
   const lastMonthDate = new Date(year, month - 1, 1);
   const lastMonth = expenses
-    .filter((tx) => {
-      const d = toDate(tx.date);
-      return !!d && inMonth(d, lastMonthDate.getFullYear(), lastMonthDate.getMonth());
-    })
+    .filter((tx) => {})
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:44:14
   const lastMonth = expenses
     .filter((tx) => {
       const d = toDate(tx.date);
-      return !!d && inMonth(d, lastMonthDate.getFullYear(), lastMonthDate.getMonth());
+      return true;
     })
     .reduce((sum, tx) => sum + tx.amountCents, 0);
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:44:14
   const lastMonth = expenses
     .filter((tx) => {
       const d = toDate(tx.date);
-      return !!d && inMonth(d, lastMonthDate.getFullYear(), lastMonthDate.getMonth());
+      return false;
     })
     .reduce((sum, tx) => sum + tx.amountCents, 0);
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:46:26
       const d = toDate(tx.date);
       return !!d && inMonth(d, lastMonthDate.getFullYear(), lastMonthDate.getMonth());
     })
-    .reduce((sum, tx) => sum + tx.amountCents, 0);
+    .reduce((sum, tx) => sum - tx.amountCents, 0);
 
   if (lastMonth > 0 && thisMonth > lastMonth * 1.2) {
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/PredictionsEngine.ts:48:7
     })
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  if (lastMonth > 0 && thisMonth > lastMonth * 1.2) {
+  if (lastMonth <= 0 && thisMonth > lastMonth * 1.2) {
     const pct = Math.round(((thisMonth - lastMonth) / lastMonth) * 100);
     predictions.push({
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/PredictionsEngine.ts:48:24
     })
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  if (lastMonth > 0 && thisMonth > lastMonth * 1.2) {
+  if (lastMonth > 0 && thisMonth <= lastMonth * 1.2) {
     const pct = Math.round(((thisMonth - lastMonth) / lastMonth) * 100);
     predictions.push({
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:49:28
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   if (lastMonth > 0 && thisMonth > lastMonth * 1.2) {
-    const pct = Math.round(((thisMonth - lastMonth) / lastMonth) * 100);
+    const pct = Math.round((thisMonth - lastMonth) / lastMonth / 100);
     predictions.push({
       id: `pred-budget-overage-${mKey}`,

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:49:30
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   if (lastMonth > 0 && thisMonth > lastMonth * 1.2) {
-    const pct = Math.round(((thisMonth - lastMonth) / lastMonth) * 100);
+    const pct = Math.round(((thisMonth + lastMonth) / lastMonth) * 100);
     predictions.push({
       id: `pred-budget-overage-${mKey}`,

[Survived] StringLiteral
src/services/fabric/PredictionsEngine.ts:51:11
   if (lastMonth > 0 && thisMonth > lastMonth * 1.2) {
     const pct = Math.round(((thisMonth - lastMonth) / lastMonth) * 100);
     predictions.push({
-      id: `pred-budget-overage-${mKey}`,
+      id: ``,
       type: 'budget_overage',
       message: `Spending is ${pct}% above last month.`,

[Survived] BooleanLiteral
src/services/fabric/PredictionsEngine.ts:57:19
       detail: `This month: ${formatCents(thisMonth, currency)} vs last month: ${formatCents(lastMonth, currency)}.`,
       severity: 'warning',
       confidence: 0.82,
-      actionable: true,
+      actionable: false,
       action: { label: 'Review spending', navigateTo: '/finance' },
       expiresAt: nextIso(now, 3),

[Survived] StringLiteral
src/services/fabric/PredictionsEngine.ts:58:55
       severity: 'warning',
       confidence: 0.82,
       actionable: true,
-      action: { label: 'Review spending', navigateTo: '/finance' },
+      action: { label: 'Review spending', navigateTo: "" },
       expiresAt: nextIso(now, 3),
       createdAt: now.toISOString(),

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:67:38
   // ─── 2. Category burn rate ───────────────────────────────────────────────────
   // Warn if any category is on pace to exceed its typical monthly total
   const dayOfMonth = now.getDate();
-  const daysInMonth = new Date(year, month + 1, 0).getDate();
+  const daysInMonth = new Date(year, month - 1, 0).getDate();
   const monthProgress = dayOfMonth / daysInMonth;
 

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:68:25
   // Warn if any category is on pace to exceed its typical monthly total
   const dayOfMonth = now.getDate();
   const daysInMonth = new Date(year, month + 1, 0).getDate();
-  const monthProgress = dayOfMonth / daysInMonth;
+  const monthProgress = dayOfMonth * daysInMonth;
 
   if (monthProgress > 0.1 && lastMonth > 0) {

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:70:7
   const daysInMonth = new Date(year, month + 1, 0).getDate();
   const monthProgress = dayOfMonth / daysInMonth;
 
-  if (monthProgress > 0.1 && lastMonth > 0) {
+  if (true) {
     const lastMonthByCategory = sumByCategory(
       expenses.filter((tx) => {

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:70:7
   const daysInMonth = new Date(year, month + 1, 0).getDate();
   const monthProgress = dayOfMonth / daysInMonth;
 
-  if (monthProgress > 0.1 && lastMonth > 0) {
+  if (true && lastMonth > 0) {
     const lastMonthByCategory = sumByCategory(
       expenses.filter((tx) => {

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:72:7
 
   if (monthProgress > 0.1 && lastMonth > 0) {
     const lastMonthByCategory = sumByCategory(
-      expenses.filter((tx) => {
-        const d = toDate(tx.date);
-        return !!d && inMonth(d, lastMonthDate.getFullYear(), lastMonthDate.getMonth());
-      }),
+      expenses,
     );
 

[Survived] BlockStatement
src/services/fabric/PredictionsEngine.ts:72:31
 
   if (monthProgress > 0.1 && lastMonth > 0) {
     const lastMonthByCategory = sumByCategory(
-      expenses.filter((tx) => {
-        const d = toDate(tx.date);
-        return !!d && inMonth(d, lastMonthDate.getFullYear(), lastMonthDate.getMonth());
-      }),
+      expenses.filter((tx) => {}),
     );
 

[Survived] BlockStatement
src/services/fabric/PredictionsEngine.ts:80:74
 
     const thisMonthByCategory = sumByCategory(thisMonthExpenses);
 
-    for (const [category, spent] of Object.entries(thisMonthByCategory)) {
-      const typical = lastMonthByCategory[category] ?? 0;
-      if (typical === 0) continue;
-      const projected = spent / monthProgress;
-      if (projected > typical * 1.3) {
-        const projectedFmt = formatCents(Math.round(projected), currency);
-        const typicalFmt = formatCents(typical, currency);
-        predictions.push({
-          id: `pred-burn-rate-${category.toLowerCase().replace(/\s+/g, '-')}-${mKey}`,
-          type: 'budget_overage',
-          message: `${category} spend is running high.`,
-          detail: `On pace for ${projectedFmt} vs typical ${typicalFmt} last month.`,
-          severity: 'warning',
-          confidence: 0.72,
-          actionable: true,
-          action: { label: 'View transactions', navigateTo: '/finance' },
-          expiresAt: nextIso(now, 2),
-          createdAt: now.toISOString(),
-        });
-        break; // Only surface the worst offender to avoid noise
-      }
-    }
+    for (const [category, spent] of Object.entries(thisMonthByCategory)) {}
   }
 

[Survived] LogicalOperator
src/services/fabric/PredictionsEngine.ts:81:23
     const thisMonthByCategory = sumByCategory(thisMonthExpenses);
 
     for (const [category, spent] of Object.entries(thisMonthByCategory)) {
-      const typical = lastMonthByCategory[category] ?? 0;
+      const typical = lastMonthByCategory[category] && 0;
       if (typical === 0) continue;
       const projected = spent / monthProgress;

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:82:11
 
     for (const [category, spent] of Object.entries(thisMonthByCategory)) {
       const typical = lastMonthByCategory[category] ?? 0;
-      if (typical === 0) continue;
+      if (false) continue;
       const projected = spent / monthProgress;
       if (projected > typical * 1.3) {

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:82:11
 
     for (const [category, spent] of Object.entries(thisMonthByCategory)) {
       const typical = lastMonthByCategory[category] ?? 0;
-      if (typical === 0) continue;
+      if (typical !== 0) continue;
       const projected = spent / monthProgress;
       if (projected > typical * 1.3) {

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:83:25
     for (const [category, spent] of Object.entries(thisMonthByCategory)) {
       const typical = lastMonthByCategory[category] ?? 0;
       if (typical === 0) continue;
-      const projected = spent / monthProgress;
+      const projected = spent * monthProgress;
       if (projected > typical * 1.3) {
         const projectedFmt = formatCents(Math.round(projected), currency);

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:84:23
       const typical = lastMonthByCategory[category] ?? 0;
       if (typical === 0) continue;
       const projected = spent / monthProgress;
-      if (projected > typical * 1.3) {
+      if (projected > typical / 1.3) {
         const projectedFmt = formatCents(Math.round(projected), currency);
         const typicalFmt = formatCents(typical, currency);

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:84:11
       const typical = lastMonthByCategory[category] ?? 0;
       if (typical === 0) continue;
       const projected = spent / monthProgress;
-      if (projected > typical * 1.3) {
+      if (projected <= typical * 1.3) {
         const projectedFmt = formatCents(Math.round(projected), currency);
         const typicalFmt = formatCents(typical, currency);

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:88:33
         const projectedFmt = formatCents(Math.round(projected), currency);
         const typicalFmt = formatCents(typical, currency);
         predictions.push({
-          id: `pred-burn-rate-${category.toLowerCase().replace(/\s+/g, '-')}-${mKey}`,
+          id: `pred-burn-rate-${category.toUpperCase().replace(/\s+/g, '-')}-${mKey}`,
           type: 'budget_overage',
           message: `${category} spend is running high.`,

[Survived] StringLiteral
src/services/fabric/PredictionsEngine.ts:88:72
         const projectedFmt = formatCents(Math.round(projected), currency);
         const typicalFmt = formatCents(typical, currency);
         predictions.push({
-          id: `pred-burn-rate-${category.toLowerCase().replace(/\s+/g, '-')}-${mKey}`,
+          id: `pred-burn-rate-${category.toLowerCase().replace(/\s+/g, "")}-${mKey}`,
           type: 'budget_overage',
           message: `${category} spend is running high.`,

[Survived] BooleanLiteral
src/services/fabric/PredictionsEngine.ts:94:23
           detail: `On pace for ${projectedFmt} vs typical ${typicalFmt} last month.`,
           severity: 'warning',
           confidence: 0.72,
-          actionable: true,
+          actionable: false,
           action: { label: 'View transactions', navigateTo: '/finance' },
           expiresAt: nextIso(now, 2),

[Killed] EqualityOperator
src/services/fabric/PredictionsEngine.ts:105:59
   }
 
   // ─── 3. Streak at risk — with specific task name ─────────────────────────────
-  const pendingDaily = input.commitments.filter((task) => task.type === 'daily' && !task.completed);
+  const pendingDaily = input.commitments.filter((task) => task.type !== 'daily' && !task.completed);
   if (pendingDaily.length > 0) {
     // Find the task with the longest streak — breaking it hurts most
killedBy: buildPredictions builds streak risk prediction for unfinished daily commitments
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:105:59
   }
 
   // ─── 3. Streak at risk — with specific task name ─────────────────────────────
-  const pendingDaily = input.commitments.filter((task) => task.type === 'daily' && !task.completed);
+  const pendingDaily = input.commitments.filter((task) => false);
   if (pendingDaily.length > 0) {
     // Find the task with the longest streak — breaking it hurts most
killedBy: buildPredictions builds streak risk prediction for unfinished daily commitments
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/fabric/PredictionsEngine.ts:106:32
 
   // ─── 3. Streak at risk — with specific task name ─────────────────────────────
   const pendingDaily = input.commitments.filter((task) => task.type === 'daily' && !task.completed);
-  if (pendingDaily.length > 0) {
-    // Find the task with the longest streak — breaking it hurts most
-    const riskiest = pendingDaily.reduce((best, t) =>
-      (t.currentStreak ?? 0) > (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
-    const streakInfo = (riskiest.currentStreak ?? 0) > 0
-      ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`
-      : '';
-    predictions.push({
-      id: `pred-streak-risk-${now.toISOString().slice(0, 10)}`,
-      type: 'streak_at_risk',
-      message: pendingDaily.length === 1
-        ? `"${riskiest.title}" is still incomplete today.`
-        : `${pendingDaily.length} daily commitments are still pending.`,
-      detail: `Complete before midnight to keep your streak.${streakInfo}`,
-      severity: 'warning',
-      confidence: 0.75,
-      actionable: true,
-      action: { label: 'Open commitments', navigateTo: '/commitments' },
-      expiresAt: nextIso(now, 1),
-      createdAt: now.toISOString(),
-    });
-  }
+  if (pendingDaily.length > 0) {}
 
   // ─── 4. Recurring pattern due ────────────────────────────────────────────────
killedBy: buildPredictions builds streak risk prediction for unfinished daily commitments
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/PredictionsEngine.ts:106:7
 
   // ─── 3. Streak at risk — with specific task name ─────────────────────────────
   const pendingDaily = input.commitments.filter((task) => task.type === 'daily' && !task.completed);
-  if (pendingDaily.length > 0) {
+  if (pendingDaily.length <= 0) {
     // Find the task with the longest streak — breaking it hurts most
     const riskiest = pendingDaily.reduce((best, t) =>
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: Cannot read properties of undefined (reading 'currentStreak')

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:109:7
   if (pendingDaily.length > 0) {
     // Find the task with the longest streak — breaking it hurts most
     const riskiest = pendingDaily.reduce((best, t) =>
-      (t.currentStreak ?? 0) > (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
+      true ? t : best, pendingDaily[0]);
     const streakInfo = (riskiest.currentStreak ?? 0) > 0
       ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:109:7
   if (pendingDaily.length > 0) {
     // Find the task with the longest streak — breaking it hurts most
     const riskiest = pendingDaily.reduce((best, t) =>
-      (t.currentStreak ?? 0) > (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
+      (t.currentStreak ?? 0) >= (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
     const streakInfo = (riskiest.currentStreak ?? 0) > 0
       ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:110:24
     // Find the task with the longest streak — breaking it hurts most
     const riskiest = pendingDaily.reduce((best, t) =>
       (t.currentStreak ?? 0) > (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
-    const streakInfo = (riskiest.currentStreak ?? 0) > 0
+    const streakInfo = false
       ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`
       : '';

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:110:24
     // Find the task with the longest streak — breaking it hurts most
     const riskiest = pendingDaily.reduce((best, t) =>
       (t.currentStreak ?? 0) > (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
-    const streakInfo = (riskiest.currentStreak ?? 0) > 0
+    const streakInfo = true
       ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`
       : '';

[NoCoverage] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:111:80
     const riskiest = pendingDaily.reduce((best, t) =>
       (t.currentStreak ?? 0) > (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
     const streakInfo = (riskiest.currentStreak ?? 0) > 0
-      ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`
+      ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${false ? '' : 's'}.`
       : '';
     predictions.push({

[NoCoverage] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:111:80
     const riskiest = pendingDaily.reduce((best, t) =>
       (t.currentStreak ?? 0) > (best.currentStreak ?? 0) ? t : best, pendingDaily[0]);
     const streakInfo = (riskiest.currentStreak ?? 0) > 0
-      ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`
+      ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${true ? '' : 's'}.`
       : '';
     predictions.push({

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:114:31
       ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`
       : '';
     predictions.push({
-      id: `pred-streak-risk-${now.toISOString().slice(0, 10)}`,
+      id: `pred-streak-risk-${now.toISOString()}`,
       type: 'streak_at_risk',
       message: pendingDaily.length === 1

[Survived] StringLiteral
src/services/fabric/PredictionsEngine.ts:114:11
       ? ` Your "${riskiest.title}" streak is at ${riskiest.currentStreak} day${riskiest.currentStreak === 1 ? '' : 's'}.`
       : '';
     predictions.push({
-      id: `pred-streak-risk-${now.toISOString().slice(0, 10)}`,
+      id: ``,
       type: 'streak_at_risk',
       message: pendingDaily.length === 1

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:116:16
     predictions.push({
       id: `pred-streak-risk-${now.toISOString().slice(0, 10)}`,
       type: 'streak_at_risk',
-      message: pendingDaily.length === 1
+      message: false
         ? `"${riskiest.title}" is still incomplete today.`
         : `${pendingDaily.length} daily commitments are still pending.`,

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:116:16
     predictions.push({
       id: `pred-streak-risk-${now.toISOString().slice(0, 10)}`,
       type: 'streak_at_risk',
-      message: pendingDaily.length === 1
+      message: true
         ? `"${riskiest.title}" is still incomplete today.`
         : `${pendingDaily.length} daily commitments are still pending.`,

[Survived] StringLiteral
src/services/fabric/PredictionsEngine.ts:119:15
       message: pendingDaily.length === 1
         ? `"${riskiest.title}" is still incomplete today.`
         : `${pendingDaily.length} daily commitments are still pending.`,
-      detail: `Complete before midnight to keep your streak.${streakInfo}`,
+      detail: ``,
       severity: 'warning',
       confidence: 0.75,

[Survived] BooleanLiteral
src/services/fabric/PredictionsEngine.ts:122:19
       detail: `Complete before midnight to keep your streak.${streakInfo}`,
       severity: 'warning',
       confidence: 0.75,
-      actionable: true,
+      actionable: false,
       action: { label: 'Open commitments', navigateTo: '/commitments' },
       expiresAt: nextIso(now, 1),

[Killed] EqualityOperator
src/services/fabric/PredictionsEngine.ts:131:12
 
   // ─── 4. Recurring pattern due ────────────────────────────────────────────────
   const recurringPattern = input.patterns.find(
-    (p) => p.followUpAction.type === 'review_budget' && p.confidence >= 0.6,
+    (p) => p.followUpAction.type !== 'review_budget' && p.confidence >= 0.6,
   );
   const recurringCategory =
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:131:12
 
   // ─── 4. Recurring pattern due ────────────────────────────────────────────────
   const recurringPattern = input.patterns.find(
-    (p) => p.followUpAction.type === 'review_budget' && p.confidence >= 0.6,
+    (p) => false,
   );
   const recurringCategory =
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/fabric/PredictionsEngine.ts:137:47
     recurringPattern?.followUpAction.type === 'review_budget'
       ? recurringPattern.followUpAction.category
       : undefined;
-  if (recurringPattern && now.getDate() <= 5) {
-    predictions.push({
-      id: `pred-recurring-due-${mKey}`,
-      type: 'recurring_due',
-      message: `A regular ${recurringCategory ?? 'spending'} pattern may be due.`,
-      detail: `Anchor AI has noticed a consistent pattern in your ${recurringCategory ?? 'monthly'} spend.`,
-      severity: 'info',
-      confidence: recurringPattern.confidence,
-      actionable: true,
-      action: { label: 'Review spending', navigateTo: '/finance' },
-      expiresAt: nextIso(now, 5),
-      createdAt: now.toISOString(),
-    });
-  }
+  if (recurringPattern && now.getDate() <= 5) {}
 
   // ─── 5. Savings opportunity ──────────────────────────────────────────────────
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality
