[Killed] EqualityOperator
src/services/fabric/PredictionsEngine.ts:137:27
     recurringPattern?.followUpAction.type === 'review_budget'
       ? recurringPattern.followUpAction.category
       : undefined;
-  if (recurringPattern && now.getDate() <= 5) {
+  if (recurringPattern && now.getDate() > 5) {
     predictions.push({
       id: `pred-recurring-due-${mKey}`,
killedBy: buildPredictions builds budget overage and recurring due predictions
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/services/fabric/PredictionsEngine.ts:141:29
     predictions.push({
       id: `pred-recurring-due-${mKey}`,
       type: 'recurring_due',
-      message: `A regular ${recurringCategory ?? 'spending'} pattern may be due.`,
+      message: `A regular ${recurringCategory && 'spending'} pattern may be due.`,
       detail: `Anchor AI has noticed a consistent pattern in your ${recurringCategory ?? 'monthly'} spend.`,
       severity: 'info',

[Survived] LogicalOperator
src/services/fabric/PredictionsEngine.ts:142:69
       id: `pred-recurring-due-${mKey}`,
       type: 'recurring_due',
       message: `A regular ${recurringCategory ?? 'spending'} pattern may be due.`,
-      detail: `Anchor AI has noticed a consistent pattern in your ${recurringCategory ?? 'monthly'} spend.`,
+      detail: `Anchor AI has noticed a consistent pattern in your ${recurringCategory && 'monthly'} spend.`,
       severity: 'info',
       confidence: recurringPattern.confidence,

[Survived] StringLiteral
src/services/fabric/PredictionsEngine.ts:142:15
       id: `pred-recurring-due-${mKey}`,
       type: 'recurring_due',
       message: `A regular ${recurringCategory ?? 'spending'} pattern may be due.`,
-      detail: `Anchor AI has noticed a consistent pattern in your ${recurringCategory ?? 'monthly'} spend.`,
+      detail: ``,
       severity: 'info',
       confidence: recurringPattern.confidence,

[Survived] BooleanLiteral
src/services/fabric/PredictionsEngine.ts:145:19
       detail: `Anchor AI has noticed a consistent pattern in your ${recurringCategory ?? 'monthly'} spend.`,
       severity: 'info',
       confidence: recurringPattern.confidence,
-      actionable: true,
+      actionable: false,
       action: { label: 'Review spending', navigateTo: '/finance' },
       expiresAt: nextIso(now, 5),

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:154:27
 
   // ─── 5. Savings opportunity ──────────────────────────────────────────────────
   // If income > expenses for the current month, surface a surplus nudge
-  const thisMonthIncome = input.transactions
-    .filter((tx) => {
-      if (tx.type !== 'income' || tx.isSoftDeleted) return false;
-      const d = toDate(tx.date);
-      return !!d && inMonth(d, year, month);
-    })
+  const thisMonthIncome = input.transactions
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] BlockStatement
src/services/fabric/PredictionsEngine.ts:155:21
   // ─── 5. Savings opportunity ──────────────────────────────────────────────────
   // If income > expenses for the current month, surface a surplus nudge
   const thisMonthIncome = input.transactions
-    .filter((tx) => {
-      if (tx.type !== 'income' || tx.isSoftDeleted) return false;
-      const d = toDate(tx.date);
-      return !!d && inMonth(d, year, month);
-    })
+    .filter((tx) => {})
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] BooleanLiteral
src/services/fabric/PredictionsEngine.ts:156:60
   // If income > expenses for the current month, surface a surplus nudge
   const thisMonthIncome = input.transactions
     .filter((tx) => {
-      if (tx.type !== 'income' || tx.isSoftDeleted) return false;
+      if (tx.type !== 'income' || tx.isSoftDeleted) return true;
       const d = toDate(tx.date);
       return !!d && inMonth(d, year, month);

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:156:11
   // If income > expenses for the current month, surface a surplus nudge
   const thisMonthIncome = input.transactions
     .filter((tx) => {
-      if (tx.type !== 'income' || tx.isSoftDeleted) return false;
+      if (tx.type === 'income' || tx.isSoftDeleted) return false;
       const d = toDate(tx.date);
       return !!d && inMonth(d, year, month);

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:162:19
     })
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  const surplus = thisMonthIncome - thisMonth;
+  const surplus = thisMonthIncome + thisMonth;
   if (thisMonthIncome > 0 && surplus > 0 && dayOfMonth >= 15) {
     predictions.push({

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:163:30
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   const surplus = thisMonthIncome - thisMonth;
-  if (thisMonthIncome > 0 && surplus > 0 && dayOfMonth >= 15) {
+  if (thisMonthIncome > 0 && surplus <= 0 && dayOfMonth >= 15) {
     predictions.push({
       id: `pred-savings-opportunity-${mKey}`,

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:163:45
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   const surplus = thisMonthIncome - thisMonth;
-  if (thisMonthIncome > 0 && surplus > 0 && dayOfMonth >= 15) {
+  if (thisMonthIncome > 0 && surplus > 0 && true) {
     predictions.push({
       id: `pred-savings-opportunity-${mKey}`,

[NoCoverage] StringLiteral
src/services/fabric/PredictionsEngine.ts:168:15
       id: `pred-savings-opportunity-${mKey}`,
       type: 'cash_flow_alert',
       message: `You have a surplus of ${formatCents(surplus, currency)} this month.`,
-      detail: 'Consider moving the difference to a savings account.',
+      detail: "",
       severity: 'info',
       confidence: 0.65,

[NoCoverage] BooleanLiteral
src/services/fabric/PredictionsEngine.ts:171:19
       detail: 'Consider moving the difference to a savings account.',
       severity: 'info',
       confidence: 0.65,
-      actionable: true,
+      actionable: false,
       action: { label: 'View accounts', navigateTo: '/finance' },
       expiresAt: nextIso(now, 7),

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:180:24
 
   // ─── 6. Unusual spending spike in last 7 days ────────────────────────────────
   const sevenDaysAgo = new Date(now);
-  sevenDaysAgo.setDate(sevenDaysAgo.getDate() - 7);
+  sevenDaysAgo.setDate(sevenDaysAgo.getDate() + 7);
   const last7Days = expenses.filter((tx) => {
     const d = toDate(tx.date);

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:180:3
 
   // ─── 6. Unusual spending spike in last 7 days ────────────────────────────────
   const sevenDaysAgo = new Date(now);
-  sevenDaysAgo.setDate(sevenDaysAgo.getDate() - 7);
+  sevenDaysAgo.setTime(sevenDaysAgo.getDate() - 7);
   const last7Days = expenses.filter((tx) => {
     const d = toDate(tx.date);

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:181:21
   // ─── 6. Unusual spending spike in last 7 days ────────────────────────────────
   const sevenDaysAgo = new Date(now);
   sevenDaysAgo.setDate(sevenDaysAgo.getDate() - 7);
-  const last7Days = expenses.filter((tx) => {
-    const d = toDate(tx.date);
-    return !!d && d >= sevenDaysAgo;
-  });
+  const last7Days = expenses;
   const last7Total = last7Days.reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] BlockStatement
src/services/fabric/PredictionsEngine.ts:181:45
   // ─── 6. Unusual spending spike in last 7 days ────────────────────────────────
   const sevenDaysAgo = new Date(now);
   sevenDaysAgo.setDate(sevenDaysAgo.getDate() - 7);
-  const last7Days = expenses.filter((tx) => {
-    const d = toDate(tx.date);
-    return !!d && d >= sevenDaysAgo;
-  });
+  const last7Days = expenses.filter((tx) => {});
   const last7Total = last7Days.reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:183:19
   sevenDaysAgo.setDate(sevenDaysAgo.getDate() - 7);
   const last7Days = expenses.filter((tx) => {
     const d = toDate(tx.date);
-    return !!d && d >= sevenDaysAgo;
+    return !!d && d > sevenDaysAgo;
   });
   const last7Total = last7Days.reduce((sum, tx) => sum + tx.amountCents, 0);

[Survived] ConditionalExpression
src/services/fabric/PredictionsEngine.ts:183:19
   sevenDaysAgo.setDate(sevenDaysAgo.getDate() - 7);
   const last7Days = expenses.filter((tx) => {
     const d = toDate(tx.date);
-    return !!d && d >= sevenDaysAgo;
+    return !!d && true;
   });
   const last7Total = last7Days.reduce((sum, tx) => sum + tx.amountCents, 0);

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:185:52
     const d = toDate(tx.date);
     return !!d && d >= sevenDaysAgo;
   });
-  const last7Total = last7Days.reduce((sum, tx) => sum + tx.amountCents, 0);
+  const last7Total = last7Days.reduce((sum, tx) => sum - tx.amountCents, 0);
 
   // Compare to typical 7-day spend (last month / 4)

[Survived] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:188:23
   const last7Total = last7Days.reduce((sum, tx) => sum + tx.amountCents, 0);
 
   // Compare to typical 7-day spend (last month / 4)
-  const typical7Day = lastMonth / 4;
+  const typical7Day = lastMonth * 4;
   if (typical7Day > 0 && last7Total > typical7Day * 1.5 && last7Days.length >= 3) {
     predictions.push({

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:189:26
 
   // Compare to typical 7-day spend (last month / 4)
   const typical7Day = lastMonth / 4;
-  if (typical7Day > 0 && last7Total > typical7Day * 1.5 && last7Days.length >= 3) {
+  if (typical7Day > 0 && last7Total >= typical7Day * 1.5 && last7Days.length >= 3) {
     predictions.push({
       id: `pred-unusual-spike-${now.toISOString().slice(0, 10)}`,

[Survived] EqualityOperator
src/services/fabric/PredictionsEngine.ts:189:7
 
   // Compare to typical 7-day spend (last month / 4)
   const typical7Day = lastMonth / 4;
-  if (typical7Day > 0 && last7Total > typical7Day * 1.5 && last7Days.length >= 3) {
+  if (typical7Day <= 0 && last7Total > typical7Day * 1.5 && last7Days.length >= 3) {
     predictions.push({
       id: `pred-unusual-spike-${now.toISOString().slice(0, 10)}`,

[NoCoverage] MethodExpression
src/services/fabric/PredictionsEngine.ts:191:33
   const typical7Day = lastMonth / 4;
   if (typical7Day > 0 && last7Total > typical7Day * 1.5 && last7Days.length >= 3) {
     predictions.push({
-      id: `pred-unusual-spike-${now.toISOString().slice(0, 10)}`,
+      id: `pred-unusual-spike-${now.toISOString()}`,
       type: 'unusual_spending',
       message: `Higher than usual spending in the last 7 days.`,

[NoCoverage] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:194:80
       id: `pred-unusual-spike-${now.toISOString().slice(0, 10)}`,
       type: 'unusual_spending',
       message: `Higher than usual spending in the last 7 days.`,
-      detail: `${formatCents(last7Total, currency)} spent — about ${Math.round((last7Total / typical7Day) * 100)}% of your typical weekly spend.`,
+      detail: `${formatCents(last7Total, currency)} spent — about ${Math.round(last7Total / typical7Day / 100)}% of your typical weekly spend.`,
       severity: 'warning',
       confidence: 0.68,

[NoCoverage] ArithmeticOperator
src/services/fabric/PredictionsEngine.ts:194:81
       id: `pred-unusual-spike-${now.toISOString().slice(0, 10)}`,
       type: 'unusual_spending',
       message: `Higher than usual spending in the last 7 days.`,
-      detail: `${formatCents(last7Total, currency)} spent — about ${Math.round((last7Total / typical7Day) * 100)}% of your typical weekly spend.`,
+      detail: `${formatCents(last7Total, currency)} spent — about ${Math.round((last7Total * typical7Day) * 100)}% of your typical weekly spend.`,
       severity: 'warning',
       confidence: 0.68,

[NoCoverage] BooleanLiteral
src/services/fabric/PredictionsEngine.ts:197:19
       detail: `${formatCents(last7Total, currency)} spent — about ${Math.round((last7Total / typical7Day) * 100)}% of your typical weekly spend.`,
       severity: 'warning',
       confidence: 0.68,
-      actionable: true,
+      actionable: false,
       action: { label: 'Review transactions', navigateTo: '/finance' },
       expiresAt: nextIso(now, 2),

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:204:10
     });
   }
 
-  return predictions.sort((a, b) => b.confidence - a.confidence).slice(0, 5);
+  return predictions.slice(0, 5);
 }
 

[Survived] MethodExpression
src/services/fabric/PredictionsEngine.ts:204:10
     });
   }
 
-  return predictions.sort((a, b) => b.confidence - a.confidence).slice(0, 5);
+  return predictions.sort((a, b) => b.confidence - a.confidence);
 }
 
