[Killed] StringLiteral
src/services/fabric/fabricPersistence.ts:13:57
   recurring: RecurringTransaction[];
 }> {
   const [transactions, commitments, accounts, recurringSnap] = await Promise.all([
-    secureDb.queryCollection<AnchorTransaction>(userId, 'finance', []),
+    secureDb.queryCollection<AnchorTransaction>(userId, "", []),
     secureDb.queryCollection<AnchorTask>(userId, 'commitments', []),
     secureDb.queryCollection<AnchorAccount>(userId, 'accounts', []),
killedBy: FabricService seeds history on first initialize when behavior store is empty
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', 'finance', [] ]

Received: 

  1st vi.fn() call:

  [
    "user-1",

[Survived] StringLiteral
src/services/fabric/fabricPersistence.ts:15:53
   const [transactions, commitments, accounts, recurringSnap] = await Promise.all([
     secureDb.queryCollection<AnchorTransaction>(userId, 'finance', []),
     secureDb.queryCollection<AnchorTask>(userId, 'commitments', []),
-    secureDb.queryCollection<AnchorAccount>(userId, 'accounts', []),
+    secureDb.queryCollection<AnchorAccount>(userId, "", []),
     getDocs(query(
       collection(db, 'artifacts', APP_ID, 'recurring_transactions'),

[Survived] StringLiteral
src/services/fabric/fabricPersistence.ts:18:13
     secureDb.queryCollection<AnchorAccount>(userId, 'accounts', []),
     getDocs(query(
       collection(db, 'artifacts', APP_ID, 'recurring_transactions'),
-      where('userId', '==', userId),
+      where("", '==', userId),
     )),
   ]);

[Survived] ArrayDeclaration
src/services/fabric/fabricPersistence.ts:26:81
 }
 
 export async function loadDismissedPredictionIds(userId: string): Promise<Set<string>> {
-  const state = await secureDb.getDocument<{ dismissedIds?: string[] }>(userId, ['fabric_predictions', 'state']);
+  const state = await secureDb.getDocument<{ dismissedIds?: string[] }>(userId, []);
   return new Set(state?.dismissedIds ?? []);
 }

[Survived] LogicalOperator
src/services/fabric/fabricPersistence.ts:27:18
 
 export async function loadDismissedPredictionIds(userId: string): Promise<Set<string>> {
   const state = await secureDb.getDocument<{ dismissedIds?: string[] }>(userId, ['fabric_predictions', 'state']);
-  return new Set(state?.dismissedIds ?? []);
+  return new Set(state?.dismissedIds && []);
 }
 

[Killed] BlockStatement
src/services/fabric/fabricPersistence.ts:34:18
   userId: string,
   predictions: Prediction[],
   dismissedPredictionIds: Set<string>
-): Promise<void> {
-  await secureDb.setDocument(userId, ['fabric_predictions', 'state'], {
-    active: predictions,
-    dismissedIds: [...dismissedPredictionIds],
-    updatedAt: new Date().toISOString(),
-  });
-}
+): Promise<void> {}
 
 export async function persistWeeklyReport(userId: string, report: WeeklyReport): Promise<void> {
killedBy: FabricService persists dismissed prediction ids
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Number of calls: 0

[Killed] ObjectLiteral
src/services/fabric/fabricPersistence.ts:35:71
   predictions: Prediction[],
   dismissedPredictionIds: Set<string>
 ): Promise<void> {
-  await secureDb.setDocument(userId, ['fabric_predictions', 'state'], {
-    active: predictions,
-    dismissedIds: [...dismissedPredictionIds],
-    updatedAt: new Date().toISOString(),
-  });
+  await secureDb.setDocument(userId, ['fabric_predictions', 'state'], {});
 }
 
killedBy: FabricService persists dismissed prediction ids
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Received: 

  1st vi.fn() call:

@@ -2,11 +2,7 @@
    "user-1",

[Killed] ArrayDeclaration
src/services/fabric/fabricPersistence.ts:37:19
 ): Promise<void> {
   await secureDb.setDocument(userId, ['fabric_predictions', 'state'], {
     active: predictions,
-    dismissedIds: [...dismissedPredictionIds],
+    dismissedIds: [],
     updatedAt: new Date().toISOString(),
   });
killedBy: FabricService persists dismissed prediction ids
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Received: 

  1st vi.fn() call:

@@ -2,11 +2,11 @@
    "user-1",

[Killed] BlockStatement
src/services/fabric/fabricPersistence.ts:42:96
   });
 }
 
-export async function persistWeeklyReport(userId: string, report: WeeklyReport): Promise<void> {
-  const weekKey = report.weekStart.slice(0, 10);
-  await secureDb.setDocument(userId, ['fabric_reports', weekKey], report as unknown as Record<string, unknown>);
-}
+export async function persistWeeklyReport(userId: string, report: WeeklyReport): Promise<void> {}
 
 export async function clearFabricData(userId: string, enabled: boolean, nowIso: string): Promise<void> {
killedBy: FabricService builds predictions and weekly report
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Number of calls: 0

[Survived] MethodExpression
src/services/fabric/fabricPersistence.ts:43:19
 }
 
 export async function persistWeeklyReport(userId: string, report: WeeklyReport): Promise<void> {
-  const weekKey = report.weekStart.slice(0, 10);
+  const weekKey = report.weekStart;
   await secureDb.setDocument(userId, ['fabric_reports', weekKey], report as unknown as Record<string, unknown>);
 }

[Killed] BlockStatement
src/services/fabric/fabricPersistence.ts:47:104
   await secureDb.setDocument(userId, ['fabric_reports', weekKey], report as unknown as Record<string, unknown>);
 }
 
-export async function clearFabricData(userId: string, enabled: boolean, nowIso: string): Promise<void> {
-  await Promise.all([
-    secureDb.setDocument(userId, ['fabric_behavior', 'state'], {
-      patterns: [],
-      confirmedPatterns: [],
-      recentActions: [],
-      dismissedPatterns: [],
-      updatedAt: nowIso,
-    }),
-    secureDb.setDocument(userId, ['fabric_predictions', 'state'], {
-      active: [],
-      dismissedIds: [],
-      updatedAt: nowIso,
-    }),
-    secureDb.setDocument(userId, ['fabric_settings', 'state'], {
-      enabled,
-      dataCollectionEnabled: enabled,
-      lastCleared: nowIso,
-    }),
-  ]);
-}
+export async function clearFabricData(userId: string, enabled: boolean, nowIso: string): Promise<void> {}
 
 export async function loadRecentConversationMessages(userId: string, maxMessages: number): Promise<FabricMessage[]> {
killedBy: FabricService clears all fabric data documents
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Number of calls: 0

[Killed] ArrayDeclaration
src/services/fabric/fabricPersistence.ts:52:22
     secureDb.setDocument(userId, ['fabric_behavior', 'state'], {
       patterns: [],
       confirmedPatterns: [],
-      recentActions: [],
+      recentActions: ["Stryker was here"],
       dismissedPatterns: [],
       updatedAt: nowIso,
killedBy: FabricService clears all fabric data documents
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Received: 

  1st vi.fn() call:

@@ -2,11 +2,15 @@
    "user-1",

[Killed] ArrayDeclaration
src/services/fabric/fabricPersistence.ts:57:15
       updatedAt: nowIso,
     }),
     secureDb.setDocument(userId, ['fabric_predictions', 'state'], {
-      active: [],
+      active: ["Stryker was here"],
       dismissedIds: [],
       updatedAt: nowIso,
killedBy: FabricService clears all fabric data documents
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "user-1",

[Killed] StringLiteral
src/services/fabric/fabricPersistence.ts:61:35
       dismissedIds: [],
       updatedAt: nowIso,
     }),
-    secureDb.setDocument(userId, ['fabric_settings', 'state'], {
+    secureDb.setDocument(userId, ["", 'state'], {
       enabled,
       dataCollectionEnabled: enabled,
killedBy: FabricService clears all fabric data documents
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', …(2) ]

Received: 

  1st vi.fn() call:

  [
    "user-1",

[NoCoverage] MethodExpression
src/services/fabric/fabricPersistence.ts:70:19
 }
 
 export async function loadRecentConversationMessages(userId: string, maxMessages: number): Promise<FabricMessage[]> {
-  const dateKey = new Date().toISOString().slice(0, 10);
+  const dateKey = new Date().toISOString();
   const existing = await secureDb.getDocument<{ messages?: FabricMessage[] }>(userId, ['fabric_conversations', dateKey]);
   const messages = existing?.messages ?? [];

[NoCoverage] UnaryOperator
src/services/fabric/fabricPersistence.ts:73:25
   const dateKey = new Date().toISOString().slice(0, 10);
   const existing = await secureDb.getDocument<{ messages?: FabricMessage[] }>(userId, ['fabric_conversations', dateKey]);
   const messages = existing?.messages ?? [];
-  return messages.slice(-maxMessages);
+  return messages.slice(+maxMessages);
 }
 

[NoCoverage] MethodExpression
src/services/fabric/fabricPersistence.ts:73:10
   const dateKey = new Date().toISOString().slice(0, 10);
   const existing = await secureDb.getDocument<{ messages?: FabricMessage[] }>(userId, ['fabric_conversations', dateKey]);
   const messages = existing?.messages ?? [];
-  return messages.slice(-maxMessages);
+  return messages;
 }
 

[Killed] BlockStatement
src/services/fabric/fabricPersistence.ts:76:126
   return messages.slice(-maxMessages);
 }
 
-export async function appendFabricConversation(userId: string, userMessage: string, assistantMessage: string): Promise<void> {
-  const dateKey = new Date().toISOString().slice(0, 10);
-  const existing = await secureDb.getDocument<{ messages?: FabricMessage[]; startedAt?: string }>(userId, ['fabric_conversations', dateKey]);
-  const nowIso = new Date().toISOString();
-  const userEntry: FabricMessage = { id: crypto.randomUUID(), role: 'user', content: userMessage, timestamp: nowIso };
-  const fabricEntry: FabricMessage = { id: crypto.randomUUID(), role: 'fabric', content: assistantMessage, timestamp: nowIso };
-
-  const messages: FabricMessage[] = [
-    ...(existing?.messages ?? []),
-    userEntry,
-    fabricEntry,
-  ].slice(-50);
-
-  await secureDb.setDocument(userId, ['fabric_conversations', dateKey], {
-    messages,
-    startedAt: existing?.startedAt ?? nowIso,
-    updatedAt: nowIso,
-  });
-}
+export async function appendFabricConversation(userId: string, userMessage: string, assistantMessage: string): Promise<void> {}
 
killedBy: FabricService persists conversation entries when query is executed
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', ArrayContaining{…}, …(1) ]

Number of calls: 0

[Survived] MethodExpression
src/services/fabric/fabricPersistence.ts:77:19
 }
 
 export async function appendFabricConversation(userId: string, userMessage: string, assistantMessage: string): Promise<void> {
-  const dateKey = new Date().toISOString().slice(0, 10);
+  const dateKey = new Date().toISOString();
   const existing = await secureDb.getDocument<{ messages?: FabricMessage[]; startedAt?: string }>(userId, ['fabric_conversations', dateKey]);
   const nowIso = new Date().toISOString();

[Survived] MethodExpression
src/services/fabric/fabricPersistence.ts:83:37
   const userEntry: FabricMessage = { id: crypto.randomUUID(), role: 'user', content: userMessage, timestamp: nowIso };
   const fabricEntry: FabricMessage = { id: crypto.randomUUID(), role: 'fabric', content: assistantMessage, timestamp: nowIso };
 
-  const messages: FabricMessage[] = [
-    ...(existing?.messages ?? []),
-    userEntry,
-    fabricEntry,
-  ].slice(-50);
+  const messages: FabricMessage[] = [...(existing?.messages ?? []), userEntry, fabricEntry];
 
   await secureDb.setDocument(userId, ['fabric_conversations', dateKey], {

[Survived] UnaryOperator
src/services/fabric/fabricPersistence.ts:87:11
     ...(existing?.messages ?? []),
     userEntry,
     fabricEntry,
-  ].slice(-50);
+  ].slice(+50);
 
   await secureDb.setDocument(userId, ['fabric_conversations', dateKey], {

[Killed] ObjectLiteral
src/services/fabric/fabricPersistence.ts:89:73
     fabricEntry,
   ].slice(-50);
 
-  await secureDb.setDocument(userId, ['fabric_conversations', dateKey], {
-    messages,
-    startedAt: existing?.startedAt ?? nowIso,
-    updatedAt: nowIso,
-  });
+  await secureDb.setDocument(userId, ['fabric_conversations', dateKey], {});
 }
 
killedBy: FabricService persists conversation entries when query is executed
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-1', ArrayContaining{…}, …(1) ]

Received: 

  1st vi.fn() call:

  [
    "user-1",

[Survived] LogicalOperator
src/services/fabric/fabricPersistence.ts:91:16
 
   await secureDb.setDocument(userId, ['fabric_conversations', dateKey], {
     messages,
-    startedAt: existing?.startedAt ?? nowIso,
+    startedAt: existing?.startedAt && nowIso,
     updatedAt: nowIso,
   });
