[Killed] ConditionalExpression
src/utils/csvExport.ts:9:15
 
 function escapeCell(value: unknown): string {
   if (value == null) return '';
-  const str = typeof value === 'object' ? JSON.stringify(value) : String(value);
+  const str = true ? JSON.stringify(value) : String(value);
   if (str.includes(',') || str.includes('"') || str.includes('\n')) {
     return `"${str.replace(/"/g, '""')}"`;
killedBy: downloadCsv generates correct CSV headers and rows
statusReason: expected '# Accounts\nname,balance\n"""Savings"…' to contain 'Savings,5000'

[Killed] ConditionalExpression
src/utils/csvExport.ts:9:15
 
 function escapeCell(value: unknown): string {
   if (value == null) return '';
-  const str = typeof value === 'object' ? JSON.stringify(value) : String(value);
+  const str = false ? JSON.stringify(value) : String(value);
   if (str.includes(',') || str.includes('"') || str.includes('\n')) {
     return `"${str.replace(/"/g, '""')}"`;
killedBy: downloadCsv serializes object values as JSON
statusReason: expected '# Accounts\nmeta\n[object Object]' to contain '"{""nested"":true}"'

[Killed] LogicalOperator
src/utils/csvExport.ts:10:7
 function escapeCell(value: unknown): string {
   if (value == null) return '';
   const str = typeof value === 'object' ? JSON.stringify(value) : String(value);
-  if (str.includes(',') || str.includes('"') || str.includes('\n')) {
+  if ((str.includes(',') || str.includes('"')) && str.includes('\n')) {
     return `"${str.replace(/"/g, '""')}"`;
   }
killedBy: downloadCsv escapes commas in CSV cell values
statusReason: expected '# Accounts\nname,amount\nMain, Backup…' to contain '"Main, Backup"'

[Killed] LogicalOperator
src/utils/csvExport.ts:10:7
 function escapeCell(value: unknown): string {
   if (value == null) return '';
   const str = typeof value === 'object' ? JSON.stringify(value) : String(value);
-  if (str.includes(',') || str.includes('"') || str.includes('\n')) {
+  if (str.includes(',') && str.includes('"') || str.includes('\n')) {
     return `"${str.replace(/"/g, '""')}"`;
   }
killedBy: downloadCsv escapes commas in CSV cell values
statusReason: expected '# Accounts\nname,amount\nMain, Backup…' to contain '"Main, Backup"'

[Killed] StringLiteral
src/utils/csvExport.ts:11:12
   if (value == null) return '';
   const str = typeof value === 'object' ? JSON.stringify(value) : String(value);
   if (str.includes(',') || str.includes('"') || str.includes('\n')) {
-    return `"${str.replace(/"/g, '""')}"`;
+    return ``;
   }
   return str;
killedBy: downloadCsv escapes commas in CSV cell values
statusReason: expected '# Accounts\nname,amount\n,100' to contain '"Main, Backup"'

[Killed] ConditionalExpression
src/utils/csvExport.ts:17:7
 }
 
 function toCsv(rows: Row[]): string {
-  if (rows.length === 0) return '';
+  if (true) return '';
   const headers = Object.keys(rows[0]);
   const lines = [headers.join(',')];
killedBy: downloadCsv generates correct CSV headers and rows
statusReason: expected '# Accounts\n' to contain 'name,balance'

[Killed] EqualityOperator
src/utils/csvExport.ts:17:7
 }
 
 function toCsv(rows: Row[]): string {
-  if (rows.length === 0) return '';
+  if (rows.length !== 0) return '';
   const headers = Object.keys(rows[0]);
   const lines = [headers.join(',')];
killedBy: downloadCsv generates correct CSV headers and rows
statusReason: expected '# Accounts\n' to contain 'name,balance'

[Killed] BlockStatement
src/utils/csvExport.ts:20:27
   if (rows.length === 0) return '';
   const headers = Object.keys(rows[0]);
   const lines = [headers.join(',')];
-  for (const row of rows) {
-    lines.push(headers.map((h) => escapeCell(row[h])).join(','));
-  }
+  for (const row of rows) {}
   return lines.join('\n');
 }
killedBy: downloadCsv generates correct CSV headers and rows
statusReason: expected '# Accounts\nname,balance' to contain 'Savings,5000'

[Killed] ArrowFunction
src/utils/csvExport.ts:21:28
   const headers = Object.keys(rows[0]);
   const lines = [headers.join(',')];
   for (const row of rows) {
-    lines.push(headers.map((h) => escapeCell(row[h])).join(','));
+    lines.push(headers.map(() => undefined).join(','));
   }
   return lines.join('\n');
killedBy: downloadCsv generates correct CSV headers and rows
statusReason: expected '# Accounts\nname,balance\n,' to contain 'Savings,5000'

[Killed] StringLiteral
src/utils/csvExport.ts:21:60
   const headers = Object.keys(rows[0]);
   const lines = [headers.join(',')];
   for (const row of rows) {
-    lines.push(headers.map((h) => escapeCell(row[h])).join(','));
+    lines.push(headers.map((h) => escapeCell(row[h])).join(""));
   }
   return lines.join('\n');
killedBy: downloadCsv generates correct CSV headers and rows
statusReason: expected '# Accounts\nname,balance\nSavings5000' to contain 'Savings,5000'

[Killed] BlockStatement
src/utils/csvExport.ts:26:103
   return lines.join('\n');
 }
 
-export function downloadCsv(data: { accounts: Row[]; transactions: Row[]; commitments: Row[] }): void {
-  const sections: string[] = [];
-
-  if (data.accounts.length > 0) {
-    sections.push('# Accounts\n' + toCsv(data.accounts));
-  }
-  if (data.transactions.length > 0) {
-    sections.push('# Transactions\n' + toCsv(data.transactions));
-  }
-  if (data.commitments.length > 0) {
-    sections.push('# Commitments\n' + toCsv(data.commitments));
-  }
-
-  const content = sections.join('\n\n');
-  const blob = new Blob([content], { type: 'text/csv;charset=utf-8' });
-  const url = URL.createObjectURL(blob);
-  const a = document.createElement('a');
-  a.href = url;
-  a.download = `anchor-data-${new Date().toISOString().split('T')[0]}.csv`;
-  document.body.appendChild(a);
-  a.click();
-  document.body.removeChild(a);
-  URL.revokeObjectURL(url);
-}
+export function downloadCsv(data: { accounts: Row[]; transactions: Row[]; commitments: Row[] }): void {}
 
killedBy: downloadCsv creates a download even when all sections are empty
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/utils/csvExport.ts:29:7
 export function downloadCsv(data: { accounts: Row[]; transactions: Row[]; commitments: Row[] }): void {
   const sections: string[] = [];
 
-  if (data.accounts.length > 0) {
+  if (false) {
     sections.push('# Accounts\n' + toCsv(data.accounts));
   }
killedBy: downloadCsv generates correct CSV headers and rows
statusReason: expected '' to contain '# Accounts'

[Killed] EqualityOperator
src/utils/csvExport.ts:29:7
 export function downloadCsv(data: { accounts: Row[]; transactions: Row[]; commitments: Row[] }): void {
   const sections: string[] = [];
 
-  if (data.accounts.length > 0) {
+  if (data.accounts.length >= 0) {
     sections.push('# Accounts\n' + toCsv(data.accounts));
   }
killedBy: downloadCsv generates empty content when all sections empty
statusReason: expected '# Accounts\n' to be '' // Object.is equality

[Killed] EqualityOperator
src/utils/csvExport.ts:32:7
   if (data.accounts.length > 0) {
     sections.push('# Accounts\n' + toCsv(data.accounts));
   }
-  if (data.transactions.length > 0) {
+  if (data.transactions.length <= 0) {
     sections.push('# Transactions\n' + toCsv(data.transactions));
   }
killedBy: downloadCsv separates sections with double newlines
statusReason: expected '# Accounts\nid\n1\n\n# Commitments\ni…' to contain '# Transactions'

[Killed] ConditionalExpression
src/utils/csvExport.ts:32:7
   if (data.accounts.length > 0) {
     sections.push('# Accounts\n' + toCsv(data.accounts));
   }
-  if (data.transactions.length > 0) {
+  if (true) {
     sections.push('# Transactions\n' + toCsv(data.transactions));
   }
killedBy: downloadCsv generates empty content when all sections empty
statusReason: expected '# Transactions\n' to be '' // Object.is equality

[Killed] StringLiteral
src/utils/csvExport.ts:33:19
     sections.push('# Accounts\n' + toCsv(data.accounts));
   }
   if (data.transactions.length > 0) {
-    sections.push('# Transactions\n' + toCsv(data.transactions));
+    sections.push("" + toCsv(data.transactions));
   }
   if (data.commitments.length > 0) {
killedBy: downloadCsv separates sections with double newlines
statusReason: expected '# Accounts\nid\n1\n\nid\n2\n\n# Commi…' to contain '# Transactions'

[Killed] ConditionalExpression
src/utils/csvExport.ts:35:7
   if (data.transactions.length > 0) {
     sections.push('# Transactions\n' + toCsv(data.transactions));
   }
-  if (data.commitments.length > 0) {
+  if (false) {
     sections.push('# Commitments\n' + toCsv(data.commitments));
   }
killedBy: downloadCsv separates sections with double newlines
statusReason: expected '# Accounts\nid\n1\n\n# Transactions\n…' to contain '# Commitments'

[Killed] ConditionalExpression
src/utils/csvExport.ts:35:7
   if (data.transactions.length > 0) {
     sections.push('# Transactions\n' + toCsv(data.transactions));
   }
-  if (data.commitments.length > 0) {
+  if (true) {
     sections.push('# Commitments\n' + toCsv(data.commitments));
   }
killedBy: downloadCsv generates empty content when all sections empty
statusReason: expected '# Commitments\n' to be '' // Object.is equality

[Killed] StringLiteral
src/utils/csvExport.ts:44:16
   const url = URL.createObjectURL(blob);
   const a = document.createElement('a');
   a.href = url;
-  a.download = `anchor-data-${new Date().toISOString().split('T')[0]}.csv`;
+  a.download = ``;
   document.body.appendChild(a);
   a.click();
killedBy: downloadCsv generates filename with current date
statusReason: expected '' to be 'anchor-data-2026-03-11.csv' // Object.is equality

[Killed] StringLiteral
src/utils/csvExport.ts:44:62
   const url = URL.createObjectURL(blob);
   const a = document.createElement('a');
   a.href = url;
-  a.download = `anchor-data-${new Date().toISOString().split('T')[0]}.csv`;
+  a.download = `anchor-data-${new Date().toISOString().split("")[0]}.csv`;
   document.body.appendChild(a);
   a.click();
killedBy: downloadCsv generates filename with current date
statusReason: expected 'anchor-data-2.csv' to be 'anchor-data-2026-03-11.csv' // Object.is equality
