[Killed] ObjectLiteral
src/utils/entityValidation.ts:14:65
 export function validateAccount(data: Record<string, unknown>): ValidationResult {
     const errors: ValidationError[] = [];
 
-    const nameError = validateString(data.name, 'Account name', { minLength: 1, maxLength: 255 });
+    const nameError = validateString(data.name, 'Account name', {});
     if (nameError) errors.push(nameError);
 
killedBy: validateAccount rejects name exceeding 255 chars
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/entityValidation.ts:23:42
     const currencyError = validateString(data.currency, 'Currency', { maxLength: 10 });
     if (currencyError) errors.push(currencyError);
 
-    if (data.balanceCents !== undefined) {
-        const balanceError = validateNumber(data.balanceCents, 'Balance', { integer: true });
-        if (balanceError) errors.push(balanceError);
-    }
+    if (data.balanceCents !== undefined) {}
 
     return { valid: errors.length === 0, errors };
killedBy: validateAccount rejects non-integer balanceCents
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/entityValidation.ts:23:9
     const currencyError = validateString(data.currency, 'Currency', { maxLength: 10 });
     if (currencyError) errors.push(currencyError);
 
-    if (data.balanceCents !== undefined) {
+    if (true) {
         const balanceError = validateNumber(data.balanceCents, 'Balance', { integer: true });
         if (balanceError) errors.push(balanceError);
killedBy: validateAccount validates a complete valid account
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/utils/entityValidation.ts:24:86
     if (currencyError) errors.push(currencyError);
 
     if (data.balanceCents !== undefined) {
-        const balanceError = validateNumber(data.balanceCents, 'Balance', { integer: true });
+        const balanceError = validateNumber(data.balanceCents, 'Balance', { integer: false });
         if (balanceError) errors.push(balanceError);
     }
killedBy: validateAccount rejects non-integer balanceCents
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/entityValidation.ts:28:21
         if (balanceError) errors.push(balanceError);
     }
 
-    return { valid: errors.length === 0, errors };
+    return { valid: true, errors };
 }
 
killedBy: validateAccount rejects missing name
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/entityValidation.ts:40:87
     const titleError = validateString(data.title, 'Description', { minLength: 1, maxLength: 500 });
     if (titleError) errors.push(titleError);
 
-    const amountError = validateNumber(data.amountCents, 'Amount', { min: 1, integer: true });
+    const amountError = validateNumber(data.amountCents, 'Amount', { min: 1, integer: false });
     if (amountError) errors.push(amountError);
 
killedBy: validateTransaction rejects non-integer amountCents
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
src/utils/entityValidation.ts:40:58
     const titleError = validateString(data.title, 'Description', { minLength: 1, maxLength: 500 });
     if (titleError) errors.push(titleError);
 
-    const amountError = validateNumber(data.amountCents, 'Amount', { min: 1, integer: true });
+    const amountError = validateNumber(data.amountCents, "", { min: 1, integer: true });
     if (amountError) errors.push(amountError);
 
killedBy: validateTransaction rejects missing amountCents
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/utils/entityValidation.ts:43:69
     const amountError = validateNumber(data.amountCents, 'Amount', { min: 1, integer: true });
     if (amountError) errors.push(amountError);
 
-    const typeError = validateString(data.type, 'Transaction type', { maxLength: 20 });
+    const typeError = validateString(data.type, 'Transaction type', {});
     if (typeError) errors.push(typeError);
 
killedBy: validateTransaction rejects type > 20 chars
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/entityValidation.ts:46:96
     const typeError = validateString(data.type, 'Transaction type', { maxLength: 20 });
     if (typeError) errors.push(typeError);
 
-    const categoryError = validateString(data.category, 'Category', { maxLength: 50, required: false });
+    const categoryError = validateString(data.category, 'Category', { maxLength: 50, required: true });
     if (categoryError) errors.push(categoryError);
 
killedBy: validateTransaction validates a complete valid transaction
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/utils/entityValidation.ts:49:78
     const categoryError = validateString(data.category, 'Category', { maxLength: 50, required: false });
     if (categoryError) errors.push(categoryError);
 
-    const dateError = validateDate(data.transactionDate, 'Date', { required: false });
+    const dateError = validateDate(data.transactionDate, 'Date', { required: true });
     if (dateError) errors.push(dateError);
 
killedBy: validateTransaction validates a complete valid transaction
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/entityValidation.ts:61:9
 export function validateProfileUpdate(data: Record<string, unknown>): ValidationResult {
     const errors: ValidationError[] = [];
 
-    if (data.name !== undefined) {
+    if (true) {
         const nameError = validateString(data.name, 'Display name', { minLength: 1, maxLength: 100 });
         if (nameError) errors.push(nameError);
killedBy: validateProfileUpdate passes when no name provided (undefined)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/entityValidation.ts:61:9
 export function validateProfileUpdate(data: Record<string, unknown>): ValidationResult {
     const errors: ValidationError[] = [];
 
-    if (data.name !== undefined) {
+    if (data.name === undefined) {
         const nameError = validateString(data.name, 'Display name', { minLength: 1, maxLength: 100 });
         if (nameError) errors.push(nameError);
killedBy: validateProfileUpdate rejects empty name
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/utils/entityValidation.ts:62:69
     const errors: ValidationError[] = [];
 
     if (data.name !== undefined) {
-        const nameError = validateString(data.name, 'Display name', { minLength: 1, maxLength: 100 });
+        const nameError = validateString(data.name, 'Display name', {});
         if (nameError) errors.push(nameError);
     }
killedBy: validateProfileUpdate rejects name > 100 chars
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
src/utils/entityValidation.ts:73:23
  * Format validation errors for display
  */
 export function formatValidationErrors(errors: ValidationError[]): string {
-    return errors.map(e => e.message).join('. ');
+    return errors.map(() => undefined).join('. ');
 }
 
killedBy: formatValidationErrors formats single error
statusReason: expected '' to be 'Name is required' // Object.is equality
