[Killed] ConditionalExpression
src/utils/errorUtils.ts:3:19
 
 export const mapFirebaseError = (error: unknown): string => {
-    if (!error || typeof error !== 'object') return 'An unknown error occurred.';
+    if (!error || false) return 'An unknown error occurred.';
     const err = error as { code?: string; message?: string };
     const code = err.code || '';
killedBy: mapFirebaseError returns generic message for non-object input (string)
statusReason: expected 'Something went wrong. Please try agai…' to be 'An unknown error occurred.' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:3:9
 
 export const mapFirebaseError = (error: unknown): string => {
-    if (!error || typeof error !== 'object') return 'An unknown error occurred.';
+    if (false) return 'An unknown error occurred.';
     const err = error as { code?: string; message?: string };
     const code = err.code || '';
killedBy: mapFirebaseError returns generic message for null input
statusReason: Cannot read properties of null (reading 'code')

[Survived] StringLiteral
src/utils/errorUtils.ts:5:30
 export const mapFirebaseError = (error: unknown): string => {
     if (!error || typeof error !== 'object') return 'An unknown error occurred.';
     const err = error as { code?: string; message?: string };
-    const code = err.code || '';
+    const code = err.code || "Stryker was here!";
     const msg = err.message || '';
 

[Killed] ConditionalExpression
src/utils/errorUtils.ts:9:9
     const msg = err.message || '';
 
     switch (code) {
-        case 'auth/network-request-failed':
-            return 'Network error. Please check your internet connection.';
+        case 'auth/network-request-failed':
         case 'auth/user-not-found':
         case 'auth/wrong-password':
killedBy: mapFirebaseError maps auth/network-request-failed
statusReason: expected 'Incorrect email or password.' to be 'Network error. Please check your inte…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:10:20
 
     switch (code) {
         case 'auth/network-request-failed':
-            return 'Network error. Please check your internet connection.';
+            return "";
         case 'auth/user-not-found':
         case 'auth/wrong-password':
killedBy: mapFirebaseError maps auth/network-request-failed
statusReason: expected '' to be 'Network error. Please check your inte…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:11:14
     switch (code) {
         case 'auth/network-request-failed':
             return 'Network error. Please check your internet connection.';
-        case 'auth/user-not-found':
+        case "":
         case 'auth/wrong-password':
         case 'auth/invalid-credential':
killedBy: mapFirebaseError maps auth/user-not-found to incorrect credentials
statusReason: expected 'Something went wrong. Please try agai…' to be 'Incorrect email or password.' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:12:14
         case 'auth/network-request-failed':
             return 'Network error. Please check your internet connection.';
         case 'auth/user-not-found':
-        case 'auth/wrong-password':
+        case "":
         case 'auth/invalid-credential':
             return 'Incorrect email or password.';
killedBy: mapFirebaseError maps auth/wrong-password to incorrect credentials
statusReason: expected 'Something went wrong. Please try agai…' to be 'Incorrect email or password.' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:13:9
             return 'Network error. Please check your internet connection.';
         case 'auth/user-not-found':
         case 'auth/wrong-password':
-        case 'auth/invalid-credential':
-            return 'Incorrect email or password.';
+        case 'auth/invalid-credential':
         case 'auth/email-already-in-use':
             return 'This email is already registered. Try logging in.';
killedBy: mapFirebaseError maps auth/user-not-found to incorrect credentials
statusReason: expected 'This email is already registered. Try…' to be 'Incorrect email or password.' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:13:14
             return 'Network error. Please check your internet connection.';
         case 'auth/user-not-found':
         case 'auth/wrong-password':
-        case 'auth/invalid-credential':
+        case "":
             return 'Incorrect email or password.';
         case 'auth/email-already-in-use':
killedBy: mapFirebaseError maps auth/invalid-credential to incorrect credentials
statusReason: expected 'Something went wrong. Please try agai…' to be 'Incorrect email or password.' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:14:20
         case 'auth/user-not-found':
         case 'auth/wrong-password':
         case 'auth/invalid-credential':
-            return 'Incorrect email or password.';
+            return "";
         case 'auth/email-already-in-use':
             return 'This email is already registered. Try logging in.';
killedBy: mapFirebaseError maps auth/user-not-found to incorrect credentials
statusReason: expected '' to be 'Incorrect email or password.' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:15:9
         case 'auth/wrong-password':
         case 'auth/invalid-credential':
             return 'Incorrect email or password.';
-        case 'auth/email-already-in-use':
-            return 'This email is already registered. Try logging in.';
+        case 'auth/email-already-in-use':
         case 'auth/weak-password':
             return 'Password should be at least 6 characters.';
killedBy: mapFirebaseError maps auth/email-already-in-use
statusReason: expected 'Password should be at least 6 charact…' to be 'This email is already registered. Try…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:15:14
         case 'auth/wrong-password':
         case 'auth/invalid-credential':
             return 'Incorrect email or password.';
-        case 'auth/email-already-in-use':
+        case "":
             return 'This email is already registered. Try logging in.';
         case 'auth/weak-password':
killedBy: mapFirebaseError maps auth/email-already-in-use
statusReason: expected 'Something went wrong. Please try agai…' to be 'This email is already registered. Try…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:17:9
             return 'Incorrect email or password.';
         case 'auth/email-already-in-use':
             return 'This email is already registered. Try logging in.';
-        case 'auth/weak-password':
-            return 'Password should be at least 6 characters.';
+        case 'auth/weak-password':
         case 'auth/too-many-requests':
             return 'Too many attempts. Please try again later.';
killedBy: mapFirebaseError maps auth/weak-password
statusReason: expected 'Too many attempts. Please try again l…' to be 'Password should be at least 6 charact…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:19:9
             return 'This email is already registered. Try logging in.';
         case 'auth/weak-password':
             return 'Password should be at least 6 characters.';
-        case 'auth/too-many-requests':
-            return 'Too many attempts. Please try again later.';
+        case 'auth/too-many-requests':
         case 'permission-denied':
             return 'You do not have permission to perform this action.';
killedBy: mapFirebaseError maps auth/too-many-requests
statusReason: expected 'You do not have permission to perform…' to be 'Too many attempts. Please try again l…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:21:9
             return 'Password should be at least 6 characters.';
         case 'auth/too-many-requests':
             return 'Too many attempts. Please try again later.';
-        case 'permission-denied':
-            return 'You do not have permission to perform this action.';
+        case 'permission-denied':
         case 'unavailable':
             return 'Service temporarily unavailable. Please try again later.';
killedBy: mapFirebaseError maps permission-denied
statusReason: expected 'Service temporarily unavailable. Plea…' to be 'You do not have permission to perform…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:21:14
             return 'Password should be at least 6 characters.';
         case 'auth/too-many-requests':
             return 'Too many attempts. Please try again later.';
-        case 'permission-denied':
+        case "":
             return 'You do not have permission to perform this action.';
         case 'unavailable':
killedBy: mapFirebaseError maps permission-denied
statusReason: expected 'Something went wrong. Please try agai…' to be 'You do not have permission to perform…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:23:9
             return 'Too many attempts. Please try again later.';
         case 'permission-denied':
             return 'You do not have permission to perform this action.';
-        case 'unavailable':
-            return 'Service temporarily unavailable. Please try again later.';
+        case 'unavailable':
         case 'auth/operation-not-allowed':
             return 'This sign-in method is not enabled. Please contact support.';
killedBy: mapFirebaseError maps unavailable
statusReason: expected 'This sign-in method is not enabled. P…' to be 'Service temporarily unavailable. Plea…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:23:14
             return 'Too many attempts. Please try again later.';
         case 'permission-denied':
             return 'You do not have permission to perform this action.';
-        case 'unavailable':
+        case "":
             return 'Service temporarily unavailable. Please try again later.';
         case 'auth/operation-not-allowed':
killedBy: mapFirebaseError maps unavailable
statusReason: expected 'Something went wrong. Please try agai…' to be 'Service temporarily unavailable. Plea…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:25:9
             return 'You do not have permission to perform this action.';
         case 'unavailable':
             return 'Service temporarily unavailable. Please try again later.';
-        case 'auth/operation-not-allowed':
-            return 'This sign-in method is not enabled. Please contact support.';
+        case 'auth/operation-not-allowed':
         case 'auth/quota-exceeded':
             return 'Limit exceeded. Please check your usage or try again later.';
killedBy: mapFirebaseError maps auth/operation-not-allowed
statusReason: expected 'Limit exceeded. Please check your usa…' to be 'This sign-in method is not enabled. P…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:27:9
             return 'Service temporarily unavailable. Please try again later.';
         case 'auth/operation-not-allowed':
             return 'This sign-in method is not enabled. Please contact support.';
-        case 'auth/quota-exceeded':
-            return 'Limit exceeded. Please check your usage or try again later.';
+        case 'auth/quota-exceeded':
+// Firestore operation errors (BUG-077: improved transfer diagnostics)
         // Firestore operation errors (BUG-077: improved transfer diagnostics)
         case 'not-found':
killedBy: mapFirebaseError maps auth/quota-exceeded
statusReason: expected 'The requested record was not found. I…' to be 'Limit exceeded. Please check your usa…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:30:9
         case 'auth/quota-exceeded':
             return 'Limit exceeded. Please check your usage or try again later.';
         // Firestore operation errors (BUG-077: improved transfer diagnostics)
-        case 'not-found':
-            return 'The requested record was not found. It may have been deleted.';
+        // Firestore operation errors (BUG-077: improved transfer diagnostics)
+case 'not-found':
         case 'already-exists':
             return 'This record already exists. Please refresh and try again.';
killedBy: mapFirebaseError maps not-found
statusReason: expected 'This record already exists. Please re…' to be 'The requested record was not found. I…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:32:9
         // Firestore operation errors (BUG-077: improved transfer diagnostics)
         case 'not-found':
             return 'The requested record was not found. It may have been deleted.';
-        case 'already-exists':
-            return 'This record already exists. Please refresh and try again.';
+        case 'already-exists':
         case 'deadline-exceeded':
             return 'The operation timed out. Please check your connection and try again.';
killedBy: mapFirebaseError maps already-exists
statusReason: expected 'The operation timed out. Please check…' to be 'This record already exists. Please re…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:33:20
         case 'not-found':
             return 'The requested record was not found. It may have been deleted.';
         case 'already-exists':
-            return 'This record already exists. Please refresh and try again.';
+            return "";
         case 'deadline-exceeded':
             return 'The operation timed out. Please check your connection and try again.';
killedBy: mapFirebaseError maps already-exists
statusReason: expected '' to be 'This record already exists. Please re…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:34:9
             return 'The requested record was not found. It may have been deleted.';
         case 'already-exists':
             return 'This record already exists. Please refresh and try again.';
-        case 'deadline-exceeded':
-            return 'The operation timed out. Please check your connection and try again.';
+        case 'deadline-exceeded':
         case 'aborted':
             return 'The operation was interrupted. Please try again.';
killedBy: mapFirebaseError maps deadline-exceeded
statusReason: expected 'The operation was interrupted. Please…' to be 'The operation timed out. Please check…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:34:14
             return 'The requested record was not found. It may have been deleted.';
         case 'already-exists':
             return 'This record already exists. Please refresh and try again.';
-        case 'deadline-exceeded':
+        case "":
             return 'The operation timed out. Please check your connection and try again.';
         case 'aborted':
killedBy: mapFirebaseError maps deadline-exceeded
statusReason: expected 'Something went wrong. Please try agai…' to be 'The operation timed out. Please check…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:36:9
             return 'This record already exists. Please refresh and try again.';
         case 'deadline-exceeded':
             return 'The operation timed out. Please check your connection and try again.';
-        case 'aborted':
-            return 'The operation was interrupted. Please try again.';
+        case 'aborted':
         case 'failed-precondition':
             return 'This action cannot be completed right now. Please refresh and try again.';
killedBy: mapFirebaseError maps aborted
statusReason: expected 'This action cannot be completed right…' to be 'The operation was interrupted. Please…' // Object.is equality

[Killed] ConditionalExpression
src/utils/errorUtils.ts:38:9
             return 'The operation timed out. Please check your connection and try again.';
         case 'aborted':
             return 'The operation was interrupted. Please try again.';
-        case 'failed-precondition':
-            return 'This action cannot be completed right now. Please refresh and try again.';
+        case 'failed-precondition':
         default:
             // Strip "Firebase: " prefix if present
killedBy: mapFirebaseError maps failed-precondition
statusReason: expected 'Something went wrong. Please try agai…' to be 'This action cannot be completed right…' // Object.is equality

[Killed] StringLiteral
src/utils/errorUtils.ts:39:20
         case 'aborted':
             return 'The operation was interrupted. Please try again.';
         case 'failed-precondition':
-            return 'This action cannot be completed right now. Please refresh and try again.';
+            return "";
         default:
             // Strip "Firebase: " prefix if present
killedBy: mapFirebaseError maps failed-precondition
statusReason: expected '' to be 'This action cannot be completed right…' // Object.is equality

[Killed] LogicalOperator
src/utils/errorUtils.ts:42:20
             return 'This action cannot be completed right now. Please refresh and try again.';
         default:
             // Strip "Firebase: " prefix if present
-            return msg.replace('Firebase: ', '') || 'Something went wrong. Please try again.';
+            return msg.replace('Firebase: ', '') && 'Something went wrong. Please try again.';
     }
 };
killedBy: mapFirebaseError strips "Firebase: " prefix from unknown error messages
statusReason: expected 'Something went wrong. Please try agai…' to be 'Custom error text' // Object.is equality
