[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:30:12
 const FLAT_THRESHOLD = 5;
 
 function isTransfer(tx: AnchorTransaction): boolean {
-    return Boolean(tx.linkId) || tx.category?.toLowerCase() === 'transfer';
+    return true;
 }
 
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected undefined to be 25000 // Object.is equality

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:30:34
 const FLAT_THRESHOLD = 5;
 
 function isTransfer(tx: AnchorTransaction): boolean {
-    return Boolean(tx.linkId) || tx.category?.toLowerCase() === 'transfer';
+    return Boolean(tx.linkId) || tx.category?.toLowerCase() !== 'transfer';
 }
 
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected undefined to be 25000 // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:34:12
 }
 
 function isExpense(tx: AnchorTransaction): boolean {
-    return tx.type === 'expense' && !tx.isSoftDeleted && !isTransfer(tx);
+    return true;
 }
 
killedBy: transactionInsights getMonthlyAverages excludes transfers and income
statusReason: expected [ { category: 'Salary', …(3) }, …(2) ] to have a length of 1 but got 3

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:34:12
 }
 
 function isExpense(tx: AnchorTransaction): boolean {
-    return tx.type === 'expense' && !tx.isSoftDeleted && !isTransfer(tx);
+    return true && !isTransfer(tx);
 }
 
killedBy: transactionInsights getMonthlyAverages excludes transfers and income
statusReason: expected [ { category: 'Salary', …(3) }, …(1) ] to have a length of 1 but got 2

[Survived] ArithmeticOperator
src/utils/insights/transactionInsights.ts:39:41
 
 function getMonthKey(date: string | Date): string {
     const d = typeof date === 'string' ? new Date(date) : date;
-    return `${d.getFullYear()}-${String(d.getMonth() + 1).padStart(2, '0')}`;
+    return `${d.getFullYear()}-${String(d.getMonth() - 1).padStart(2, '0')}`;
 }
 

[Killed] MethodExpression
src/utils/insights/transactionInsights.ts:46:22
  * Calculates average monthly spending per category.
  */
 export function getMonthlyAverages(txns: AnchorTransaction[]): CategoryAverage[] {
-    const expenses = txns.filter(isExpense);
+    const expenses = txns;
     if (expenses.length === 0) return [];
 
killedBy: transactionInsights getMonthlyAverages excludes transfers and income
statusReason: expected [ { category: 'Salary', …(3) }, …(2) ] to have a length of 1 but got 3

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:47:9
  */
 export function getMonthlyAverages(txns: AnchorTransaction[]): CategoryAverage[] {
     const expenses = txns.filter(isExpense);
-    if (expenses.length === 0) return [];
+    if (true) return [];
 
     const months = new Set<string>();
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected undefined to be 25000 // Object.is equality

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:47:9
  */
 export function getMonthlyAverages(txns: AnchorTransaction[]): CategoryAverage[] {
     const expenses = txns.filter(isExpense);
-    if (expenses.length === 0) return [];
+    if (expenses.length !== 0) return [];
 
     const months = new Set<string>();
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected undefined to be 25000 // Object.is equality

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:52:32
     const months = new Set<string>();
     const categoryTotals: Record<string, number> = {};
 
-    for (const tx of expenses) {
-        const monthKey = getMonthKey(tx.date);
-        months.add(monthKey);
-        const cat = tx.category || 'Other';
-        categoryTotals[cat] = (categoryTotals[cat] || 0) + tx.amountCents;
-    }
+    for (const tx of expenses) {}
 
     const monthCount = Math.max(months.size, 1);
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected undefined to be 25000 // Object.is equality

[Killed] LogicalOperator
src/utils/insights/transactionInsights.ts:55:21
     for (const tx of expenses) {
         const monthKey = getMonthKey(tx.date);
         months.add(monthKey);
-        const cat = tx.category || 'Other';
+        const cat = tx.category && 'Other';
         categoryTotals[cat] = (categoryTotals[cat] || 0) + tx.amountCents;
     }
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected undefined to be 25000 // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:56:31
         const monthKey = getMonthKey(tx.date);
         months.add(monthKey);
         const cat = tx.category || 'Other';
-        categoryTotals[cat] = (categoryTotals[cat] || 0) + tx.amountCents;
+        categoryTotals[cat] = (categoryTotals[cat] || 0) - tx.amountCents;
     }
 
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected -25000 to be 25000 // Object.is equality

[Killed] LogicalOperator
src/utils/insights/transactionInsights.ts:56:32
         const monthKey = getMonthKey(tx.date);
         months.add(monthKey);
         const cat = tx.category || 'Other';
-        categoryTotals[cat] = (categoryTotals[cat] || 0) + tx.amountCents;
+        categoryTotals[cat] = (categoryTotals[cat] && 0) + tx.amountCents;
     }
 
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected NaN to be 25000 // Object.is equality

[Killed] MethodExpression
src/utils/insights/transactionInsights.ts:59:24
         categoryTotals[cat] = (categoryTotals[cat] || 0) + tx.amountCents;
     }
 
-    const monthCount = Math.max(months.size, 1);
+    const monthCount = Math.min(months.size, 1);
 
     return Object.entries(categoryTotals)
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected 50000 to be 25000 // Object.is equality

[Survived] MethodExpression
src/utils/insights/transactionInsights.ts:61:12
 
     const monthCount = Math.max(months.size, 1);
 
-    return Object.entries(categoryTotals)
-        .map(([category, totalCents]) => ({
-            category,
-            totalCents,
-            averageCents: Math.round(totalCents / monthCount),
-            monthCount,
-        }))
-        .sort((a, b) => b.averageCents - a.averageCents);
+    return Object.entries(categoryTotals).map(([category, totalCents]) => ({
+  category,
+  totalCents,
+  averageCents: Math.round(totalCents / monthCount),
+  monthCount
+}));
 }
 

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:65:38
         .map(([category, totalCents]) => ({
             category,
             totalCents,
-            averageCents: Math.round(totalCents / monthCount),
+            averageCents: Math.round(totalCents * monthCount),
             monthCount,
         }))
killedBy: transactionInsights getMonthlyAverages calculates average spending per category across months
statusReason: expected 100000 to be 25000 // Object.is equality

[Survived] ArithmeticOperator
src/utils/insights/transactionInsights.ts:68:25
             averageCents: Math.round(totalCents / monthCount),
             monthCount,
         }))
-        .sort((a, b) => b.averageCents - a.averageCents);
+        .sort((a, b) => b.averageCents + a.averageCents);
 }
 

[Killed] MethodExpression
src/utils/insights/transactionInsights.ts:76:22
  * Flags any single transaction > ANOMALY_THRESHOLD × category average per-transaction amount.
  */
 export function detectAnomalies(txns: AnchorTransaction[]): Anomaly[] {
-    const expenses = txns.filter(isExpense);
+    const expenses = txns;
     if (expenses.length === 0) return [];
 
killedBy: transactionInsights detectAnomalies skips soft-deleted transactions
statusReason: expected [ { id: 'tx-cz0vwn', …(5) } ] to have a length of +0 but got 1

[Survived] ConditionalExpression
src/utils/insights/transactionInsights.ts:77:9
  */
 export function detectAnomalies(txns: AnchorTransaction[]): Anomaly[] {
     const expenses = txns.filter(isExpense);
-    if (expenses.length === 0) return [];
+    if (false) return [];
 
     // Group by category and calculate per-transaction average

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:81:32
 
     // Group by category and calculate per-transaction average
     const categoryGroups: Record<string, AnchorTransaction[]> = {};
-    for (const tx of expenses) {
-        const cat = tx.category || 'Other';
-        if (!categoryGroups[cat]) categoryGroups[cat] = [];
-        categoryGroups[cat].push(tx);
-    }
+    for (const tx of expenses) {}
 
     const anomalies: Anomaly[] = [];
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 0 to be greater than or equal to 1

[Killed] LogicalOperator
src/utils/insights/transactionInsights.ts:82:21
     // Group by category and calculate per-transaction average
     const categoryGroups: Record<string, AnchorTransaction[]> = {};
     for (const tx of expenses) {
-        const cat = tx.category || 'Other';
+        const cat = tx.category && 'Other';
         if (!categoryGroups[cat]) categoryGroups[cat] = [];
         categoryGroups[cat].push(tx);
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 'Other' to be 'Food' // Object.is equality

[NoCoverage] StringLiteral
src/utils/insights/transactionInsights.ts:82:36
     // Group by category and calculate per-transaction average
     const categoryGroups: Record<string, AnchorTransaction[]> = {};
     for (const tx of expenses) {
-        const cat = tx.category || 'Other';
+        const cat = tx.category || "";
         if (!categoryGroups[cat]) categoryGroups[cat] = [];
         categoryGroups[cat].push(tx);

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:83:13
     const categoryGroups: Record<string, AnchorTransaction[]> = {};
     for (const tx of expenses) {
         const cat = tx.category || 'Other';
-        if (!categoryGroups[cat]) categoryGroups[cat] = [];
+        if (false) categoryGroups[cat] = [];
         categoryGroups[cat].push(tx);
     }
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BooleanLiteral
src/utils/insights/transactionInsights.ts:83:13
     const categoryGroups: Record<string, AnchorTransaction[]> = {};
     for (const tx of expenses) {
         const cat = tx.category || 'Other';
-        if (!categoryGroups[cat]) categoryGroups[cat] = [];
+        if (categoryGroups[cat]) categoryGroups[cat] = [];
         categoryGroups[cat].push(tx);
     }
killedBy: FinanceView Account Rendering renders all accounts correctly
statusReason: Unable to find an element with the text: Checking Account. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="w-full p-6 md:p-8"
    >

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:89:69
 
     const anomalies: Anomaly[] = [];
 
-    for (const [category, group] of Object.entries(categoryGroups)) {
-        if (group.length < 3) continue; // Need enough data
-
-        const total = group.reduce((sum, tx) => sum + tx.amountCents, 0);
-        const avg = total / group.length;
-
-        for (const tx of group) {
-            if (tx.amountCents > avg * ANOMALY_THRESHOLD) {
-                anomalies.push({
-                    id: tx.id,
-                    title: tx.title,
-                    category,
-                    amountCents: tx.amountCents,
-                    averageCents: Math.round(avg),
-                    date: typeof tx.date === 'string' ? tx.date : tx.date.toISOString(),
-                });
-            }
-        }
-    }
+    for (const [category, group] of Object.entries(categoryGroups)) {}
 
     return anomalies.sort((a, b) => b.amountCents - a.amountCents);
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:90:13
     const anomalies: Anomaly[] = [];
 
     for (const [category, group] of Object.entries(categoryGroups)) {
-        if (group.length < 3) continue; // Need enough data
+        if (group.length >= 3) continue; // Need enough data
 
         const total = group.reduce((sum, tx) => sum + tx.amountCents, 0);
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 0 to be greater than or equal to 1

[Survived] ConditionalExpression
src/utils/insights/transactionInsights.ts:90:13
     const anomalies: Anomaly[] = [];
 
     for (const [category, group] of Object.entries(categoryGroups)) {
-        if (group.length < 3) continue; // Need enough data
+        if (false) continue; // Need enough data
 
         const total = group.reduce((sum, tx) => sum + tx.amountCents, 0);

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:92:49
     for (const [category, group] of Object.entries(categoryGroups)) {
         if (group.length < 3) continue; // Need enough data
 
-        const total = group.reduce((sum, tx) => sum + tx.amountCents, 0);
+        const total = group.reduce((sum, tx) => sum - tx.amountCents, 0);
         const avg = total / group.length;
 
killedBy: transactionInsights detectAnomalies returns empty for consistent spending
statusReason: expected [ { id: 'tx-vd4u6a', …(5) }, …(2) ] to have a length of +0 but got 3

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:93:21
         if (group.length < 3) continue; // Need enough data
 
         const total = group.reduce((sum, tx) => sum + tx.amountCents, 0);
-        const avg = total / group.length;
+        const avg = total * group.length;
 
         for (const tx of group) {
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:95:33
         const total = group.reduce((sum, tx) => sum + tx.amountCents, 0);
         const avg = total / group.length;
 
-        for (const tx of group) {
-            if (tx.amountCents > avg * ANOMALY_THRESHOLD) {
-                anomalies.push({
-                    id: tx.id,
-                    title: tx.title,
-                    category,
-                    amountCents: tx.amountCents,
-                    averageCents: Math.round(avg),
-                    date: typeof tx.date === 'string' ? tx.date : tx.date.toISOString(),
-                });
-            }
-        }
+        for (const tx of group) {}
     }
 
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 0 to be greater than or equal to 1

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:96:17
         const avg = total / group.length;
 
         for (const tx of group) {
-            if (tx.amountCents > avg * ANOMALY_THRESHOLD) {
+            if (tx.amountCents <= avg * ANOMALY_THRESHOLD) {
                 anomalies.push({
                     id: tx.id,
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 12000 to be 55000 // Object.is equality

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:96:59
         const avg = total / group.length;
 
         for (const tx of group) {
-            if (tx.amountCents > avg * ANOMALY_THRESHOLD) {
-                anomalies.push({
-                    id: tx.id,
-                    title: tx.title,
-                    category,
-                    amountCents: tx.amountCents,
-                    averageCents: Math.round(avg),
-                    date: typeof tx.date === 'string' ? tx.date : tx.date.toISOString(),
-                });
-            }
+            if (tx.amountCents > avg * ANOMALY_THRESHOLD) {}
         }
     }
killedBy: transactionInsights detectAnomalies flags transactions significantly above category average
statusReason: expected 0 to be greater than or equal to 1

[NoCoverage] ArithmeticOperator
src/utils/insights/transactionInsights.ts:109:37
         }
     }
 
-    return anomalies.sort((a, b) => b.amountCents - a.amountCents);
+    return anomalies.sort((a, b) => b.amountCents + a.amountCents);
 }
 

[Survived] MethodExpression
src/utils/insights/transactionInsights.ts:109:12
         }
     }
 
-    return anomalies.sort((a, b) => b.amountCents - a.amountCents);
+    return anomalies;
 }
 

[Survived] MethodExpression
src/utils/insights/transactionInsights.ts:117:22
  */
 export function getSpendingTrend(txns: AnchorTransaction[]): SpendingTrend {
     const flat: SpendingTrend = { direction: 'flat', percentChange: 0, currentMonthCents: 0, previousMonthCents: 0 };
-    const expenses = txns.filter(isExpense);
+    const expenses = txns;
     if (expenses.length === 0) return flat;
 

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:118:9
 export function getSpendingTrend(txns: AnchorTransaction[]): SpendingTrend {
     const flat: SpendingTrend = { direction: 'flat', percentChange: 0, currentMonthCents: 0, previousMonthCents: 0 };
     const expenses = txns.filter(isExpense);
-    if (expenses.length === 0) return flat;
+    if (expenses.length !== 0) return flat;
 
     // Group spending by month
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:118:9
 export function getSpendingTrend(txns: AnchorTransaction[]): SpendingTrend {
     const flat: SpendingTrend = { direction: 'flat', percentChange: 0, currentMonthCents: 0, previousMonthCents: 0 };
     const expenses = txns.filter(isExpense);
-    if (expenses.length === 0) return flat;
+    if (true) return flat;
 
     // Group spending by month
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:122:32
 
     // Group spending by month
     const monthTotals: Record<string, number> = {};
-    for (const tx of expenses) {
-        const key = getMonthKey(tx.date);
-        monthTotals[key] = (monthTotals[key] || 0) + tx.amountCents;
-    }
+    for (const tx of expenses) {}
 
     const sortedMonths = Object.keys(monthTotals).sort();
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:124:28
     const monthTotals: Record<string, number> = {};
     for (const tx of expenses) {
         const key = getMonthKey(tx.date);
-        monthTotals[key] = (monthTotals[key] || 0) + tx.amountCents;
+        monthTotals[key] = (monthTotals[key] || 0) - tx.amountCents;
     }
 
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'down' to be 'up' // Object.is equality

[Killed] LogicalOperator
src/utils/insights/transactionInsights.ts:124:29
     const monthTotals: Record<string, number> = {};
     for (const tx of expenses) {
         const key = getMonthKey(tx.date);
-        monthTotals[key] = (monthTotals[key] || 0) + tx.amountCents;
+        monthTotals[key] = (monthTotals[key] && 0) + tx.amountCents;
     }
 
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Survived] MethodExpression
src/utils/insights/transactionInsights.ts:127:26
         monthTotals[key] = (monthTotals[key] || 0) + tx.amountCents;
     }
 
-    const sortedMonths = Object.keys(monthTotals).sort();
+    const sortedMonths = Object.keys(monthTotals);
     if (sortedMonths.length < 2) return flat;
 

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:128:9
     }
 
     const sortedMonths = Object.keys(monthTotals).sort();
-    if (sortedMonths.length < 2) return flat;
+    if (sortedMonths.length >= 2) return flat;
 
     const currentMonth = sortedMonths[sortedMonths.length - 1];
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:128:9
     }
 
     const sortedMonths = Object.keys(monthTotals).sort();
-    if (sortedMonths.length < 2) return flat;
+    if (true) return flat;
 
     const currentMonth = sortedMonths[sortedMonths.length - 1];
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:130:39
     const sortedMonths = Object.keys(monthTotals).sort();
     if (sortedMonths.length < 2) return flat;
 
-    const currentMonth = sortedMonths[sortedMonths.length - 1];
+    const currentMonth = sortedMonths[sortedMonths.length + 1];
     const previousMonth = sortedMonths[sortedMonths.length - 2];
     const current = monthTotals[currentMonth];
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:131:40
     if (sortedMonths.length < 2) return flat;
 
     const currentMonth = sortedMonths[sortedMonths.length - 1];
-    const previousMonth = sortedMonths[sortedMonths.length - 2];
+    const previousMonth = sortedMonths[sortedMonths.length + 2];
     const current = monthTotals[currentMonth];
     const previous = monthTotals[previousMonth];
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:135:9
     const current = monthTotals[currentMonth];
     const previous = monthTotals[previousMonth];
 
-    if (previous === 0) return { ...flat, currentMonthCents: current };
+    if (previous !== 0) return { ...flat, currentMonthCents: current };
 
     const pctChange = Math.abs(((current - previous) / previous) * 100);
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:135:9
     const current = monthTotals[currentMonth];
     const previous = monthTotals[previousMonth];
 
-    if (previous === 0) return { ...flat, currentMonthCents: current };
+    if (true) return { ...flat, currentMonthCents: current };
 
     const pctChange = Math.abs(((current - previous) / previous) * 100);
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:137:32
 
     if (previous === 0) return { ...flat, currentMonthCents: current };
 
-    const pctChange = Math.abs(((current - previous) / previous) * 100);
+    const pctChange = Math.abs((current - previous) / previous / 100);
     let direction: 'up' | 'down' | 'flat' = 'flat';
 
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:137:33
 
     if (previous === 0) return { ...flat, currentMonthCents: current };
 
-    const pctChange = Math.abs(((current - previous) / previous) * 100);
+    const pctChange = Math.abs(((current - previous) * previous) * 100);
     let direction: 'up' | 'down' | 'flat' = 'flat';
 
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 200000000000 to be close to 20, received difference is 199999999980, but expected 0.005

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:140:9
     const pctChange = Math.abs(((current - previous) / previous) * 100);
     let direction: 'up' | 'down' | 'flat' = 'flat';
 
-    if (pctChange > FLAT_THRESHOLD) {
+    if (true) {
         direction = current > previous ? 'up' : 'down';
     }
killedBy: transactionInsights getSpendingTrend returns flat when spending is similar
statusReason: expected 'up' to be 'flat' // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:140:9
     const pctChange = Math.abs(((current - previous) / previous) * 100);
     let direction: 'up' | 'down' | 'flat' = 'flat';
 
-    if (pctChange > FLAT_THRESHOLD) {
+    if (false) {
         direction = current > previous ? 'up' : 'down';
     }
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'flat' to be 'up' // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:141:21
     let direction: 'up' | 'down' | 'flat' = 'flat';
 
     if (pctChange > FLAT_THRESHOLD) {
-        direction = current > previous ? 'up' : 'down';
+        direction = true ? 'up' : 'down';
     }
 
killedBy: transactionInsights getSpendingTrend detects decreasing spending
statusReason: expected 'up' to be 'down' // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:141:21
     let direction: 'up' | 'down' | 'flat' = 'flat';
 
     if (pctChange > FLAT_THRESHOLD) {
-        direction = current > previous ? 'up' : 'down';
+        direction = false ? 'up' : 'down';
     }
 
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 'down' to be 'up' // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:146:35
 
     return {
         direction,
-        percentChange: Math.round(pctChange * 100) / 100,
+        percentChange: Math.round(pctChange / 100) / 100,
         currentMonthCents: current,
         previousMonthCents: previous,
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected +0 to be close to 20, received difference is 20, but expected 0.005

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:146:24
 
     return {
         direction,
-        percentChange: Math.round(pctChange * 100) / 100,
+        percentChange: Math.round(pctChange * 100) * 100,
         currentMonthCents: current,
         previousMonthCents: previous,
killedBy: transactionInsights getSpendingTrend calculates month-over-month percentage change
statusReason: expected 200000 to be close to 20, received difference is 199980, but expected 0.005

[Killed] BooleanLiteral
src/utils/insights/transactionInsights.ts:165:116
  * Transactions without a source are treated as manual.
  */
 export function getSourceBreakdown(txns: AnchorTransaction[]): SourceBreakdown {
-    const empty: SourceBreakdown = { manualCents: 0, syncedCents: 0, totalCents: 0, syncedPercent: 0, hasBankData: false };
+    const empty: SourceBreakdown = { manualCents: 0, syncedCents: 0, totalCents: 0, syncedPercent: 0, hasBankData: true };
     const expenses = txns.filter(isExpense);
     if (expenses.length === 0) return empty;
killedBy: transactionInsights getSourceBreakdown reports hasBankData correctly
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/utils/insights/transactionInsights.ts:166:22
  */
 export function getSourceBreakdown(txns: AnchorTransaction[]): SourceBreakdown {
     const empty: SourceBreakdown = { manualCents: 0, syncedCents: 0, totalCents: 0, syncedPercent: 0, hasBankData: false };
-    const expenses = txns.filter(isExpense);
+    const expenses = txns;
     if (expenses.length === 0) return empty;
 
killedBy: transactionInsights getSourceBreakdown excludes income and transfers
statusReason: expected 60000 to be 10000 // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:167:9
 export function getSourceBreakdown(txns: AnchorTransaction[]): SourceBreakdown {
     const empty: SourceBreakdown = { manualCents: 0, syncedCents: 0, totalCents: 0, syncedPercent: 0, hasBankData: false };
     const expenses = txns.filter(isExpense);
-    if (expenses.length === 0) return empty;
+    if (true) return empty;
 
     let manualCents = 0;
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected +0 to be 35000 // Object.is equality
