[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:167:9
 export function getSourceBreakdown(txns: AnchorTransaction[]): SourceBreakdown {
     const empty: SourceBreakdown = { manualCents: 0, syncedCents: 0, totalCents: 0, syncedPercent: 0, hasBankData: false };
     const expenses = txns.filter(isExpense);
-    if (expenses.length === 0) return empty;
+    if (expenses.length !== 0) return empty;
 
     let manualCents = 0;
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected +0 to be 35000 // Object.is equality

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:172:32
     let manualCents = 0;
     let syncedCents = 0;
 
-    for (const tx of expenses) {
-        if (tx.source === 'synced') {
-            syncedCents += tx.amountCents;
-        } else {
-            manualCents += tx.amountCents;
-        }
-    }
+    for (const tx of expenses) {}
 
     const totalCents = manualCents + syncedCents;
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected +0 to be 35000 // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:173:13
     let syncedCents = 0;
 
     for (const tx of expenses) {
-        if (tx.source === 'synced') {
+        if (false) {
             syncedCents += tx.amountCents;
         } else {
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected 75000 to be 35000 // Object.is equality

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:173:13
     let syncedCents = 0;
 
     for (const tx of expenses) {
-        if (tx.source === 'synced') {
+        if (tx.source !== 'synced') {
             syncedCents += tx.amountCents;
         } else {
killedBy: MonthlyInsight displays "Potential Savings" of $0 when income equals expense
statusReason: Found multiple elements with the text: /\$0.00/

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  class="text-lg font-bold tabular-nums truncate text-slate-900 dark:text-white"
>

[Killed] AssignmentOperator
src/utils/insights/transactionInsights.ts:174:13
 
     for (const tx of expenses) {
         if (tx.source === 'synced') {
-            syncedCents += tx.amountCents;
+            syncedCents -= tx.amountCents;
         } else {
             manualCents += tx.amountCents;
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected -40000 to be 40000 // Object.is equality

[Killed] BlockStatement
src/utils/insights/transactionInsights.ts:175:16
     for (const tx of expenses) {
         if (tx.source === 'synced') {
             syncedCents += tx.amountCents;
-        } else {
-            manualCents += tx.amountCents;
-        }
+        } else {}
     }
 
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected +0 to be 35000 // Object.is equality

[Killed] AssignmentOperator
src/utils/insights/transactionInsights.ts:176:13
         if (tx.source === 'synced') {
             syncedCents += tx.amountCents;
         } else {
-            manualCents += tx.amountCents;
+            manualCents -= tx.amountCents;
         }
     }
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected -35000 to be 35000 // Object.is equality

[Killed] ArithmeticOperator
src/utils/insights/transactionInsights.ts:180:24
         }
     }
 
-    const totalCents = manualCents + syncedCents;
+    const totalCents = manualCents - syncedCents;
     return {
         manualCents,
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected -5000 to be 75000 // Object.is equality

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:185:24
         manualCents,
         syncedCents,
         totalCents,
-        syncedPercent: totalCents > 0 ? Math.round((syncedCents / totalCents) * 10000) / 100 : 0,
+        syncedPercent: false ? Math.round((syncedCents / totalCents) * 10000) / 100 : 0,
         hasBankData: syncedCents > 0,
     };
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected +0 to be close to 53.33, received difference is 53.33, but expected 0.5

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:185:24
         manualCents,
         syncedCents,
         totalCents,
-        syncedPercent: totalCents > 0 ? Math.round((syncedCents / totalCents) * 10000) / 100 : 0,
+        syncedPercent: totalCents <= 0 ? Math.round((syncedCents / totalCents) * 10000) / 100 : 0,
         hasBankData: syncedCents > 0,
     };
killedBy: transactionInsights getSourceBreakdown splits expenses by source (manual vs synced)
statusReason: expected +0 to be close to 53.33, received difference is 53.33, but expected 0.5

[Killed] ConditionalExpression
src/utils/insights/transactionInsights.ts:186:22
         syncedCents,
         totalCents,
         syncedPercent: totalCents > 0 ? Math.round((syncedCents / totalCents) * 10000) / 100 : 0,
-        hasBankData: syncedCents > 0,
+        hasBankData: false,
     };
 }
killedBy: transactionInsights getSourceBreakdown reports hasBankData correctly
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/insights/transactionInsights.ts:186:22
         syncedCents,
         totalCents,
         syncedPercent: totalCents > 0 ? Math.round((syncedCents / totalCents) * 10000) / 100 : 0,
-        hasBankData: syncedCents > 0,
+        hasBankData: syncedCents >= 0,
     };
 }
killedBy: transactionInsights getSourceBreakdown reports hasBankData correctly
statusReason: expected true to be false // Object.is equality
