[Killed] ConditionalExpression
src/utils/systemTheme.ts:15:9
  * Works on iOS, Android, macOS, Windows
  */
 export function getSystemTheme(): Theme {
-    if (typeof window === 'undefined') return 'light';
+    if (true) return 'light';
 
     const mediaQuery = window.matchMedia('(prefers-color-scheme: dark)');
killedBy: systemTheme getSystemTheme returns "dark" when prefers-color-scheme: dark matches
statusReason: expected 'light' to be 'dark' // Object.is equality

[Survived] ConditionalExpression
src/utils/systemTheme.ts:15:9
  * Works on iOS, Android, macOS, Windows
  */
 export function getSystemTheme(): Theme {
-    if (typeof window === 'undefined') return 'light';
+    if (false) return 'light';
 
     const mediaQuery = window.matchMedia('(prefers-color-scheme: dark)');

[Killed] EqualityOperator
src/utils/systemTheme.ts:26:9
  * Priority: localStorage > system preference > 'light' fallback
  */
 export function getEffectiveTheme(): Theme {
-    if (typeof window === 'undefined') return 'light';
+    if (typeof window !== 'undefined') return 'light';
 
     const savedTheme = localStorage.getItem('anchor_theme') as Theme | null;
killedBy: systemTheme getEffectiveTheme returns saved theme from localStorage when present
statusReason: expected 'light' to be 'dark' // Object.is equality

[Survived] ConditionalExpression
src/utils/systemTheme.ts:26:9
  * Priority: localStorage > system preference > 'light' fallback
  */
 export function getEffectiveTheme(): Theme {
-    if (typeof window === 'undefined') return 'light';
+    if (false) return 'light';
 
     const savedTheme = localStorage.getItem('anchor_theme') as Theme | null;

[Killed] ConditionalExpression
src/utils/systemTheme.ts:29:35
     if (typeof window === 'undefined') return 'light';
 
     const savedTheme = localStorage.getItem('anchor_theme') as Theme | null;
-    if (savedTheme === 'light' || savedTheme === 'dark') {
+    if (savedTheme === 'light' || false) {
         return savedTheme;
     }
killedBy: systemTheme getEffectiveTheme returns saved theme from localStorage when present
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] BlockStatement
src/utils/systemTheme.ts:29:58
     if (typeof window === 'undefined') return 'light';
 
     const savedTheme = localStorage.getItem('anchor_theme') as Theme | null;
-    if (savedTheme === 'light' || savedTheme === 'dark') {
-        return savedTheme;
-    }
+    if (savedTheme === 'light' || savedTheme === 'dark') {}
 
     // No saved preference - use system theme
killedBy: systemTheme getEffectiveTheme returns saved theme from localStorage when present
statusReason: expected 'light' to be 'dark' // Object.is equality

[Killed] ConditionalExpression
src/utils/systemTheme.ts:45:9
  * @returns Cleanup function to unsubscribe
  */
 export function subscribeToSystemTheme(callback: (theme: Theme) => void): () => void {
-    if (typeof window === 'undefined') return () => { };
+    if (true) return () => { };
 
     const mediaQuery = window.matchMedia('(prefers-color-scheme: dark)');
killedBy: systemTheme subscribeToSystemTheme subscribes using addEventListener when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'change', Any<Function> ]

Number of calls: 0

[Survived] ConditionalExpression
src/utils/systemTheme.ts:45:9
  * @returns Cleanup function to unsubscribe
  */
 export function subscribeToSystemTheme(callback: (theme: Theme) => void): () => void {
-    if (typeof window === 'undefined') return () => { };
+    if (false) return () => { };
 
     const mediaQuery = window.matchMedia('(prefers-color-scheme: dark)');

[Killed] BlockStatement
src/utils/systemTheme.ts:49:49
 
     const mediaQuery = window.matchMedia('(prefers-color-scheme: dark)');
 
-    const handler = (e: MediaQueryListEvent) => {
-        callback(e.matches ? 'dark' : 'light');
-    };
+    const handler = (e: MediaQueryListEvent) => {};
 
     // Modern browsers
killedBy: systemTheme subscribeToSystemTheme subscribes using addEventListener when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'dark' ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/systemTheme.ts:54:9
     };
 
     // Modern browsers
-    if (mediaQuery.addEventListener) {
+    if (false) {
         mediaQuery.addEventListener('change', handler);
         return () => mediaQuery.removeEventListener('change', handler);
killedBy: systemTheme subscribeToSystemTheme subscribes using addEventListener when available
statusReason: mediaQuery.addListener is not a function

[Killed] ConditionalExpression
src/utils/systemTheme.ts:54:9
     };
 
     // Modern browsers
-    if (mediaQuery.addEventListener) {
+    if (true) {
         mediaQuery.addEventListener('change', handler);
         return () => mediaQuery.removeEventListener('change', handler);
killedBy: systemTheme subscribeToSystemTheme falls back to addListener for legacy browsers
statusReason: mediaQuery.addEventListener is not a function

[Killed] ArrowFunction
src/utils/systemTheme.ts:56:16
     // Modern browsers
     if (mediaQuery.addEventListener) {
         mediaQuery.addEventListener('change', handler);
-        return () => mediaQuery.removeEventListener('change', handler);
+        return () => undefined;
     }
 
killedBy: systemTheme subscribeToSystemTheme subscribes using addEventListener when available
statusReason: expected "vi.fn()" to be called with arguments: [ 'change', [Function handler] ]

Number of calls: 0

[Killed] ArrowFunction
src/utils/systemTheme.ts:61:12
 
     // Legacy Safari (iOS 13 and earlier)
     mediaQuery.addListener(handler);
-    return () => mediaQuery.removeListener(handler);
+    return () => undefined;
 }
 
killedBy: systemTheme subscribeToSystemTheme falls back to addListener for legacy browsers
statusReason: expected "vi.fn()" to be called at least once

[Killed] EqualityOperator
src/utils/systemTheme.ts:68:9
  * Check if user has explicitly set a theme preference
  */
 export function hasUserThemePreference(): boolean {
-    if (typeof window === 'undefined') return false;
+    if (typeof window !== 'undefined') return false;
     const saved = localStorage.getItem('anchor_theme');
     return saved === 'light' || saved === 'dark';
killedBy: systemTheme hasUserThemePreference returns true when anchor_theme is "light"
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/systemTheme.ts:68:9
  * Check if user has explicitly set a theme preference
  */
 export function hasUserThemePreference(): boolean {
-    if (typeof window === 'undefined') return false;
+    if (true) return false;
     const saved = localStorage.getItem('anchor_theme');
     return saved === 'light' || saved === 'dark';
killedBy: systemTheme hasUserThemePreference returns true when anchor_theme is "light"
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/systemTheme.ts:70:33
 export function hasUserThemePreference(): boolean {
     if (typeof window === 'undefined') return false;
     const saved = localStorage.getItem('anchor_theme');
-    return saved === 'light' || saved === 'dark';
+    return saved === 'light' || false;
 }
 
killedBy: systemTheme hasUserThemePreference returns true when anchor_theme is "dark"
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/systemTheme.ts:70:12
 export function hasUserThemePreference(): boolean {
     if (typeof window === 'undefined') return false;
     const saved = localStorage.getItem('anchor_theme');
-    return saved === 'light' || saved === 'dark';
+    return false;
 }
 
killedBy: systemTheme hasUserThemePreference returns true when anchor_theme is "light"
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/utils/systemTheme.ts:76:46
 /**
  * Clear user's theme preference (revert to system theme)
  */
-export function clearThemePreference(): void {
-    if (typeof window !== 'undefined') {
-        localStorage.removeItem('anchor_theme');
-    }
-}
+export function clearThemePreference(): void {}
 
killedBy: systemTheme clearThemePreference removes anchor_theme from localStorage
statusReason: expected 'dark' to be null

[Killed] EqualityOperator
src/utils/systemTheme.ts:77:9
  * Clear user's theme preference (revert to system theme)
  */
 export function clearThemePreference(): void {
-    if (typeof window !== 'undefined') {
+    if (typeof window === 'undefined') {
         localStorage.removeItem('anchor_theme');
     }
killedBy: systemTheme clearThemePreference removes anchor_theme from localStorage
statusReason: expected 'dark' to be null

[Killed] BlockStatement
src/utils/systemTheme.ts:77:40
  * Clear user's theme preference (revert to system theme)
  */
 export function clearThemePreference(): void {
-    if (typeof window !== 'undefined') {
-        localStorage.removeItem('anchor_theme');
-    }
+    if (typeof window !== 'undefined') {}
 }
 
killedBy: systemTheme clearThemePreference removes anchor_theme from localStorage
statusReason: expected 'dark' to be null

[Killed] StringLiteral
src/utils/systemTheme.ts:78:33
  */
 export function clearThemePreference(): void {
     if (typeof window !== 'undefined') {
-        localStorage.removeItem('anchor_theme');
+        localStorage.removeItem("");
     }
 }
killedBy: systemTheme clearThemePreference removes anchor_theme from localStorage
statusReason: expected 'dark' to be null
