[Killed] BlockStatement
src/utils/webVitals.ts:10:45
 import { onCLS, onLCP, onINP, onTTFB } from 'web-vitals';
 import type { Metric } from 'web-vitals';
 
-function sendToSentry(metric: Metric): void {
-    const level = metric.rating === 'good' ? 'info' : 'warning';
-    Sentry.addBreadcrumb({
-        category: 'web-vital',
-        message: `${metric.name}: ${metric.value}`,
-        level,
-        data: {
-            value: metric.value,
-            rating: metric.rating,
-            id: metric.id,
-        },
-    });
-}
+function sendToSentry(metric: Metric): void {}
 
 export function reportWebVitals(): void {
killedBy: reportWebVitals reports metrics as sentry breadcrumbs
statusReason: expected "vi.fn()" to be called 4 times, but got 0 times

[Killed] ConditionalExpression
src/utils/webVitals.ts:11:19
 import type { Metric } from 'web-vitals';
 
 function sendToSentry(metric: Metric): void {
-    const level = metric.rating === 'good' ? 'info' : 'warning';
+    const level = false ? 'info' : 'warning';
     Sentry.addBreadcrumb({
         category: 'web-vital',
killedBy: reportWebVitals sets info level for good metrics
statusReason: expected 'warning' to be 'info' // Object.is equality

[Killed] ConditionalExpression
src/utils/webVitals.ts:11:19
 import type { Metric } from 'web-vitals';
 
 function sendToSentry(metric: Metric): void {
-    const level = metric.rating === 'good' ? 'info' : 'warning';
+    const level = true ? 'info' : 'warning';
     Sentry.addBreadcrumb({
         category: 'web-vital',
killedBy: reportWebVitals sets warning level for needs-improvement metrics
statusReason: expected 'info' to be 'warning' // Object.is equality

[Killed] ObjectLiteral
src/utils/webVitals.ts:12:26
 
 function sendToSentry(metric: Metric): void {
     const level = metric.rating === 'good' ? 'info' : 'warning';
-    Sentry.addBreadcrumb({
-        category: 'web-vital',
-        message: `${metric.name}: ${metric.value}`,
-        level,
-        data: {
-            value: metric.value,
-            rating: metric.rating,
-            id: metric.id,
-        },
-    });
+    Sentry.addBreadcrumb({});
 }
 
killedBy: reportWebVitals reports metrics as sentry breadcrumbs
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] ObjectLiteral
src/utils/webVitals.ts:16:15
         category: 'web-vital',
         message: `${metric.name}: ${metric.value}`,
         level,
-        data: {
-            value: metric.value,
-            rating: metric.rating,
-            id: metric.id,
-        },
+        data: {},
     });
 }
killedBy: reportWebVitals reports metrics as sentry breadcrumbs
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   ObjectContaining {

[Killed] BlockStatement
src/utils/webVitals.ts:24:41
     });
 }
 
-export function reportWebVitals(): void {
-    onCLS(sendToSentry);
-    onLCP(sendToSentry);
-    onINP(sendToSentry);
-    onTTFB(sendToSentry);
-}
+export function reportWebVitals(): void {}
 
killedBy: reportWebVitals registers all 4 web vital metrics
statusReason: expected "vi.fn()" to be called at least once
