[Survived] ArithmeticOperator
src/services/mfaRecoveryService.ts:15:45
 function generateCode(): string {
     const array = new Uint8Array(CODE_LENGTH);
     crypto.getRandomValues(array);
-    return Array.from(array, (b) => CHARSET[b % CHARSET.length]).join('');
+    return Array.from(array, (b) => CHARSET[b * CHARSET.length]).join('');
 }
 

[Survived] ArrowFunction
src/services/mfaRecoveryService.ts:15:30
 function generateCode(): string {
     const array = new Uint8Array(CODE_LENGTH);
     crypto.getRandomValues(array);
-    return Array.from(array, (b) => CHARSET[b % CHARSET.length]).join('');
+    return Array.from(array, () => undefined).join('');
 }
 

[Survived] MethodExpression
src/services/mfaRecoveryService.ts:20:33
 
 async function hashCode(code: string): Promise<string> {
     const encoder = new TextEncoder();
-    const data = encoder.encode(code.toUpperCase().replace(/\s/g, ''));
+    const data = encoder.encode(code.toLowerCase().replace(/\s/g, ''));
     const hashBuffer = await crypto.subtle.digest('SHA-256', data);
     const hashArray = Array.from(new Uint8Array(hashBuffer));

[Survived] Regex
src/services/mfaRecoveryService.ts:20:60
 
 async function hashCode(code: string): Promise<string> {
     const encoder = new TextEncoder();
-    const data = encoder.encode(code.toUpperCase().replace(/\s/g, ''));
+    const data = encoder.encode(code.toUpperCase().replace(/\S/g, ''));
     const hashBuffer = await crypto.subtle.digest('SHA-256', data);
     const hashArray = Array.from(new Uint8Array(hashBuffer));

[Survived] StringLiteral
src/services/mfaRecoveryService.ts:21:51
 async function hashCode(code: string): Promise<string> {
     const encoder = new TextEncoder();
     const data = encoder.encode(code.toUpperCase().replace(/\s/g, ''));
-    const hashBuffer = await crypto.subtle.digest('SHA-256', data);
+    const hashBuffer = await crypto.subtle.digest("", data);
     const hashArray = Array.from(new Uint8Array(hashBuffer));
     return hashArray.map(b => b.toString(16).padStart(2, '0')).join('');

[Survived] ArrowFunction
src/services/mfaRecoveryService.ts:23:26
     const data = encoder.encode(code.toUpperCase().replace(/\s/g, ''));
     const hashBuffer = await crypto.subtle.digest('SHA-256', data);
     const hashArray = Array.from(new Uint8Array(hashBuffer));
-    return hashArray.map(b => b.toString(16).padStart(2, '0')).join('');
+    return hashArray.map(() => undefined).join('');
 }
 

[Survived] StringLiteral
src/services/mfaRecoveryService.ts:23:58
     const data = encoder.encode(code.toUpperCase().replace(/\s/g, ''));
     const hashBuffer = await crypto.subtle.digest('SHA-256', data);
     const hashArray = Array.from(new Uint8Array(hashBuffer));
-    return hashArray.map(b => b.toString(16).padStart(2, '0')).join('');
+    return hashArray.map(b => b.toString(16).padStart(2, "")).join('');
 }
 
