[Killed] StringLiteral
src/utils/seederData.ts:7:31
  */
 
-export const ACCOUNT_NAMES = ['Main Checking', 'Savings Goal', 'Emergency Fund', 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
+export const ACCOUNT_NAMES = ["", 'Savings Goal', 'Emergency Fund', 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
 export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];
killedBy: seederData constants exports non-empty ACCOUNT_NAMES array
statusReason: expected [ '', 'Savings Goal', …(5) ] to include 'Main Checking'

[Survived] StringLiteral
src/utils/seederData.ts:7:64
  */
 
-export const ACCOUNT_NAMES = ['Main Checking', 'Savings Goal', 'Emergency Fund', 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
+export const ACCOUNT_NAMES = ['Main Checking', 'Savings Goal', "", 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
 export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];

[Killed] StringLiteral
src/utils/seederData.ts:9:121
 export const ACCOUNT_NAMES = ['Main Checking', 'Savings Goal', 'Emergency Fund', 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
-export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];
+export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', ""];
 export const DOMAINS = ['Health', 'Fitness', 'Work', 'Bible', 'Personal Development', 'Financial'];
 export const ACCOUNT_COLORS = ['#3b82f6', '#10b981', '#f59e0b', '#8b5cf6', '#ef4444', '#ec4899', '#6366f1'];
killedBy: seederData constants exports non-empty CATEGORIES array
statusReason: expected [ 'Living', 'Food', …(7) ] to include 'Transfer'

[Survived] StringLiteral
src/utils/seederData.ts:9:86
 export const ACCOUNT_NAMES = ['Main Checking', 'Savings Goal', 'Emergency Fund', 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
-export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];
+export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', "", 'Personal', 'Income', 'Transfer'];
 export const DOMAINS = ['Health', 'Fitness', 'Work', 'Bible', 'Personal Development', 'Financial'];
 export const ACCOUNT_COLORS = ['#3b82f6', '#10b981', '#f59e0b', '#8b5cf6', '#ef4444', '#ec4899', '#6366f1'];

[Killed] StringLiteral
src/utils/seederData.ts:10:25
 export const ACCOUNT_NAMES = ['Main Checking', 'Savings Goal', 'Emergency Fund', 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
 export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];
-export const DOMAINS = ['Health', 'Fitness', 'Work', 'Bible', 'Personal Development', 'Financial'];
+export const DOMAINS = ["", 'Fitness', 'Work', 'Bible', 'Personal Development', 'Financial'];
 export const ACCOUNT_COLORS = ['#3b82f6', '#10b981', '#f59e0b', '#8b5cf6', '#ef4444', '#ec4899', '#6366f1'];
 
killedBy: seederData constants exports non-empty DOMAINS array
statusReason: expected [ Array(6) ] to include 'Health'

[Survived] StringLiteral
src/utils/seederData.ts:10:63
 export const ACCOUNT_NAMES = ['Main Checking', 'Savings Goal', 'Emergency Fund', 'Travel Card', 'Investment Portfolio', 'Joint Account', 'House Fund'];
 export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];
-export const DOMAINS = ['Health', 'Fitness', 'Work', 'Bible', 'Personal Development', 'Financial'];
+export const DOMAINS = ['Health', 'Fitness', 'Work', 'Bible', "", 'Financial'];
 export const ACCOUNT_COLORS = ['#3b82f6', '#10b981', '#f59e0b', '#8b5cf6', '#ef4444', '#ec4899', '#6366f1'];
 

[Killed] StringLiteral
src/utils/seederData.ts:11:32
 export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];
 export const DOMAINS = ['Health', 'Fitness', 'Work', 'Bible', 'Personal Development', 'Financial'];
-export const ACCOUNT_COLORS = ['#3b82f6', '#10b981', '#f59e0b', '#8b5cf6', '#ef4444', '#ec4899', '#6366f1'];
+export const ACCOUNT_COLORS = ["", '#10b981', '#f59e0b', '#8b5cf6', '#ef4444', '#ec4899', '#6366f1'];
 
 /**
killedBy: seederData constants exports non-empty ACCOUNT_COLORS array
statusReason: expected '' to match /^#[0-9a-f]{6}$/

[Survived] StringLiteral
src/utils/seederData.ts:11:76
 export const CATEGORIES = ['Living', 'Food', 'Entertainment', 'Health', 'Transport', 'Utilities', 'Personal', 'Income', 'Transfer'];
 export const DOMAINS = ['Health', 'Fitness', 'Work', 'Bible', 'Personal Development', 'Financial'];
-export const ACCOUNT_COLORS = ['#3b82f6', '#10b981', '#f59e0b', '#8b5cf6', '#ef4444', '#ec4899', '#6366f1'];
+export const ACCOUNT_COLORS = ['#3b82f6', '#10b981', '#f59e0b', '#8b5cf6', "", '#ec4899', '#6366f1'];
 
 /**

[Killed] ConditionalExpression
src/utils/seederData.ts:18:9
  * Satisfies both js/insecure-randomness and js/biased-cryptographic-random.
  */
 export const secureRandomInt = (max: number): number => {
-    if (max <= 0) return 0;
+    if (false) return 0;
     const maxUint32PlusOne = 0x100000000;
     const maxSafeIntegerPlusOne = 0x20000000000000;
killedBy: secureRandomInt returns 0 when max is 0
statusReason: expected NaN to be +0 // Object.is equality

[Killed] EqualityOperator
src/utils/seederData.ts:18:9
  * Satisfies both js/insecure-randomness and js/biased-cryptographic-random.
  */
 export const secureRandomInt = (max: number): number => {
-    if (max <= 0) return 0;
+    if (max < 0) return 0;
     const maxUint32PlusOne = 0x100000000;
     const maxSafeIntegerPlusOne = 0x20000000000000;
killedBy: secureRandomInt returns 0 when max is 0
statusReason: expected NaN to be +0 // Object.is equality

[Timeout] BlockStatement
src/utils/seederData.ts:22:34
     const maxUint32PlusOne = 0x100000000;
     const maxSafeIntegerPlusOne = 0x20000000000000;
 
-    if (max >= maxUint32PlusOne) {
-        const buf = new Uint32Array(2);
-        const limit = maxSafeIntegerPlusOne - (maxSafeIntegerPlusOne % max);
-        let value: number;
-        do {
-            crypto.getRandomValues(buf);
-            value = buf[0] * 0x200000 + (buf[1] >>> 11);
-        } while (value >= limit);
-        return value % max;
-    }
+    if (max >= maxUint32PlusOne) {}
 
     const buf = new Uint32Array(1);

[Survived] ConditionalExpression
src/utils/seederData.ts:22:9
     const maxUint32PlusOne = 0x100000000;
     const maxSafeIntegerPlusOne = 0x20000000000000;
 
-    if (max >= maxUint32PlusOne) {
+    if (true) {
         const buf = new Uint32Array(2);
         const limit = maxSafeIntegerPlusOne - (maxSafeIntegerPlusOne % max);

[Timeout] ArithmeticOperator
src/utils/seederData.ts:24:48
 
     if (max >= maxUint32PlusOne) {
         const buf = new Uint32Array(2);
-        const limit = maxSafeIntegerPlusOne - (maxSafeIntegerPlusOne % max);
+        const limit = maxSafeIntegerPlusOne - (maxSafeIntegerPlusOne * max);
         let value: number;
         do {

[Survived] ArithmeticOperator
src/utils/seederData.ts:24:23
 
     if (max >= maxUint32PlusOne) {
         const buf = new Uint32Array(2);
-        const limit = maxSafeIntegerPlusOne - (maxSafeIntegerPlusOne % max);
+        const limit = maxSafeIntegerPlusOne + maxSafeIntegerPlusOne % max;
         let value: number;
         do {

[Survived] ArithmeticOperator
src/utils/seederData.ts:28:21
         let value: number;
         do {
             crypto.getRandomValues(buf);
-            value = buf[0] * 0x200000 + (buf[1] >>> 11);
+            value = buf[0] / 0x200000 + (buf[1] >>> 11);
         } while (value >= limit);
         return value % max;

[Survived] ArithmeticOperator
src/utils/seederData.ts:28:21
         let value: number;
         do {
             crypto.getRandomValues(buf);
-            value = buf[0] * 0x200000 + (buf[1] >>> 11);
+            value = buf[0] * 0x200000 - (buf[1] >>> 11);
         } while (value >= limit);
         return value % max;

[Survived] EqualityOperator
src/utils/seederData.ts:29:18
         do {
             crypto.getRandomValues(buf);
             value = buf[0] * 0x200000 + (buf[1] >>> 11);
-        } while (value >= limit);
+        } while (value > limit);
         return value % max;
     }

[Survived] ConditionalExpression
src/utils/seederData.ts:29:18
         do {
             crypto.getRandomValues(buf);
             value = buf[0] * 0x200000 + (buf[1] >>> 11);
-        } while (value >= limit);
+        } while (false);
         return value % max;
     }

[Killed] ArithmeticOperator
src/utils/seederData.ts:30:16
             crypto.getRandomValues(buf);
             value = buf[0] * 0x200000 + (buf[1] >>> 11);
         } while (value >= limit);
-        return value % max;
+        return value * max;
     }
 
killedBy: randomDate returns a date between start and end
statusReason: expected NaN to be greater than or equal to 1735689600000

[Timeout] ArithmeticOperator
src/utils/seederData.ts:34:39
     }
 
     const buf = new Uint32Array(1);
-    const limit = maxUint32PlusOne - (maxUint32PlusOne % max); // largest multiple of max in uint32 range
+    const limit = maxUint32PlusOne - (maxUint32PlusOne * max); // largest multiple of max in uint32 range
     let value: number;
     do {

[Survived] ArithmeticOperator
src/utils/seederData.ts:34:19
     }
 
     const buf = new Uint32Array(1);
-    const limit = maxUint32PlusOne - (maxUint32PlusOne % max); // largest multiple of max in uint32 range
+    const limit = maxUint32PlusOne + maxUint32PlusOne % max; // largest multiple of max in uint32 range
     let value: number;
     do {

[Survived] ConditionalExpression
src/utils/seederData.ts:39:14
     do {
         crypto.getRandomValues(buf);
         value = buf[0];
-    } while (value >= limit);
+    } while (false);
     return value % max;
 };

[Timeout] EqualityOperator
src/utils/seederData.ts:39:14
     do {
         crypto.getRandomValues(buf);
         value = buf[0];
-    } while (value >= limit);
+    } while (value < limit);
     return value % max;
 };

[Killed] ArithmeticOperator
src/utils/seederData.ts:44:19
 };
 
 export const randomDate = (start: Date, end: Date): Date => {
-    const range = end.getTime() - start.getTime();
+    const range = end.getTime() + start.getTime();
     return new Date(start.getTime() + secureRandomInt(range));
 };
killedBy: randomDate returns a date between start and end
statusReason: expected 2537599282340 to be less than or equal to 1767139200000

[Killed] ArithmeticOperator
src/utils/seederData.ts:45:21
 
 export const randomDate = (start: Date, end: Date): Date => {
     const range = end.getTime() - start.getTime();
-    return new Date(start.getTime() + secureRandomInt(range));
+    return new Date(start.getTime() - secureRandomInt(range));
 };
 
killedBy: randomDate returns a date between start and end
statusReason: expected 1715352858581 to be greater than or equal to 1735689600000

[Killed] ArrowFunction
src/utils/seederData.ts:48:27
     return new Date(start.getTime() + secureRandomInt(range));
 };
 
-export const randomItem = <T>(arr: T[]): T => arr[secureRandomInt(arr.length)];
+export const randomItem = () => undefined;
 
killedBy: randomItem returns an item from the array
statusReason: expected [ 'a', 'b', 'c' ] to include undefined
