[Survived] ConditionalExpression
src/services/TransactionService.ts:38:13
     async addTransaction(userId: string, payload: CreateTransactionPayload, accounts: AnchorAccount[]): Promise<void> {
         // Rate limit: 100 transactions per hour
         const rateCheck = checkRateLimit(`transactionCreate:${userId}`, RATE_LIMIT_CONFIGS.transactionCreate);
-        if (rateCheck.isLimited) {
+        if (false) {
             throw new AnchorError(
                 `Too many transactions created. Please try again in ${formatRetryTime(rateCheck.retryAfterMs || 0)}.`,

[NoCoverage] BlockStatement
src/services/TransactionService.ts:38:34
     async addTransaction(userId: string, payload: CreateTransactionPayload, accounts: AnchorAccount[]): Promise<void> {
         // Rate limit: 100 transactions per hour
         const rateCheck = checkRateLimit(`transactionCreate:${userId}`, RATE_LIMIT_CONFIGS.transactionCreate);
-        if (rateCheck.isLimited) {
-            throw new AnchorError(
-                `Too many transactions created. Please try again in ${formatRetryTime(rateCheck.retryAfterMs || 0)}.`,
-                'RATE_LIMIT'
-            );
-        }
+        if (rateCheck.isLimited) {}
 
         const sourceAccount = accounts.find(a => a.id === payload.accountId);

[Killed] ConditionalExpression
src/services/TransactionService.ts:45:50
             );
         }
 
-        const sourceAccount = accounts.find(a => a.id === payload.accountId);
+        const sourceAccount = accounts.find(a => false);
         if (!sourceAccount) throw new AnchorError('Source account not found', 'VALIDATION');
         if (!canAddTransaction(sourceAccount, userId)) {
killedBy: useFinanceService (Family Mode) Permission Enforcement should allow adding transaction to own account
statusReason: Source account not found

[Killed] EqualityOperator
src/services/TransactionService.ts:45:50
             );
         }
 
-        const sourceAccount = accounts.find(a => a.id === payload.accountId);
+        const sourceAccount = accounts.find(a => a.id !== payload.accountId);
         if (!sourceAccount) throw new AnchorError('Source account not found', 'VALIDATION');
         if (!canAddTransaction(sourceAccount, userId)) {
killedBy: useFinanceService (Family Mode) Permission Enforcement should allow adding transaction to own account
statusReason: Source account not found

[Killed] BlockStatement
src/services/TransactionService.ts:47:56
 
         const sourceAccount = accounts.find(a => a.id === payload.accountId);
         if (!sourceAccount) throw new AnchorError('Source account not found', 'VALIDATION');
-        if (!canAddTransaction(sourceAccount, userId)) {
-            throw new AnchorError(`Permission denied: You cannot add transactions to ${sourceAccount.name}.`, 'PERMISSION');
-        }
+        if (!canAddTransaction(sourceAccount, userId)) {}
 
         try {
killedBy: TransactionService addTransaction throws PERMISSION error if user lacks transaction rights
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BooleanLiteral
src/services/TransactionService.ts:47:13
 
         const sourceAccount = accounts.find(a => a.id === payload.accountId);
         if (!sourceAccount) throw new AnchorError('Source account not found', 'VALIDATION');
-        if (!canAddTransaction(sourceAccount, userId)) {
+        if (canAddTransaction(sourceAccount, userId)) {
             throw new AnchorError(`Permission denied: You cannot add transactions to ${sourceAccount.name}.`, 'PERMISSION');
         }
killedBy: useFinanceService (Family Mode) Permission Enforcement should allow adding transaction to own account
statusReason: Permission denied: You cannot add transactions to Own Account.

[Killed] StringLiteral
src/services/TransactionService.ts:48:35
         const sourceAccount = accounts.find(a => a.id === payload.accountId);
         if (!sourceAccount) throw new AnchorError('Source account not found', 'VALIDATION');
         if (!canAddTransaction(sourceAccount, userId)) {
-            throw new AnchorError(`Permission denied: You cannot add transactions to ${sourceAccount.name}.`, 'PERMISSION');
+            throw new AnchorError(``, 'PERMISSION');
         }
 
killedBy: TransactionService addTransaction throws PERMISSION error if user lacks transaction rights
statusReason: expected [Function] to throw error including 'Permission denied' but got ''

[Killed] BlockStatement
src/services/TransactionService.ts:51:13
             throw new AnchorError(`Permission denied: You cannot add transactions to ${sourceAccount.name}.`, 'PERMISSION');
         }
 
-        try {
-            const batch = writeBatch(this.firestore);
-            const now = new Date();
-            const createdAt = now.toISOString();
-            const transactionDate = payload.date || createdAt;
-            const isBackdated = payload.date ? new Date(payload.date).toDateString() !== now.toDateString() : false;
-
-            if (payload.type === 'transfer') {
-                processTransferTransaction(this.firestore, batch, userId, payload, sourceAccount, accounts, transactionDate, createdAt, isBackdated);
-            } else {
-                processStandardTransaction(this.firestore, batch, userId, payload, sourceAccount, transactionDate, createdAt, isBackdated);
-            }
-            await batch.commit();
-
-            // AUDIT: Log transaction creation
-            auditFinance.transactionCreated(
-                'batch', // Batch operation doesn't return single ID
-                payload.accountId,
-                payload.amountCents,
-                payload.type
-            );
-        } catch (error) {
+        try {} catch (error) {
             void auditFinance.operationFailed('transaction_create', {
                 accountId: payload.accountId,
killedBy: useFinanceService (Family Mode) Permission Enforcement should allow adding transaction to own account
statusReason: expected "vi.fn()" to be called at least once

[Survived] BooleanLiteral
src/services/TransactionService.ts:56:111
             const now = new Date();
             const createdAt = now.toISOString();
             const transactionDate = payload.date || createdAt;
-            const isBackdated = payload.date ? new Date(payload.date).toDateString() !== now.toDateString() : false;
+            const isBackdated = payload.date ? new Date(payload.date).toDateString() !== now.toDateString() : true;
 
             if (payload.type === 'transfer') {

[NoCoverage] ConditionalExpression
src/services/TransactionService.ts:56:48
             const now = new Date();
             const createdAt = now.toISOString();
             const transactionDate = payload.date || createdAt;
-            const isBackdated = payload.date ? new Date(payload.date).toDateString() !== now.toDateString() : false;
+            const isBackdated = payload.date ? false : false;
 
             if (payload.type === 'transfer') {

[Killed] BlockStatement
src/services/TransactionService.ts:58:46
             const transactionDate = payload.date || createdAt;
             const isBackdated = payload.date ? new Date(payload.date).toDateString() !== now.toDateString() : false;
 
-            if (payload.type === 'transfer') {
-                processTransferTransaction(this.firestore, batch, userId, payload, sourceAccount, accounts, transactionDate, createdAt, isBackdated);
-            } else {
+            if (payload.type === 'transfer') {} else {
                 processStandardTransaction(this.firestore, batch, userId, payload, sourceAccount, transactionDate, createdAt, isBackdated);
             }
killedBy: TransactionService addTransaction delegates to processTransferTransaction for transfers
statusReason: expected "vi.fn()" to be called with arguments: [ {}, …(8) ]

Number of calls: 0

[Killed] EqualityOperator
src/services/TransactionService.ts:58:17
             const transactionDate = payload.date || createdAt;
             const isBackdated = payload.date ? new Date(payload.date).toDateString() !== now.toDateString() : false;
 
-            if (payload.type === 'transfer') {
+            if (payload.type !== 'transfer') {
                 processTransferTransaction(this.firestore, batch, userId, payload, sourceAccount, accounts, transactionDate, createdAt, isBackdated);
             } else {
killedBy: useFinanceService Transaction Management should add income transaction and update account balance correctly
statusReason: Transfer missing destination account

[Killed] BlockStatement
src/services/TransactionService.ts:60:20
 
             if (payload.type === 'transfer') {
                 processTransferTransaction(this.firestore, batch, userId, payload, sourceAccount, accounts, transactionDate, createdAt, isBackdated);
-            } else {
-                processStandardTransaction(this.firestore, batch, userId, payload, sourceAccount, transactionDate, createdAt, isBackdated);
-            }
+            } else {}
             await batch.commit();
 
killedBy: TransactionService addTransaction creates standard transaction successfully
statusReason: expected "vi.fn()" to be called with arguments: [ {}, …(7) ]

Number of calls: 0

[Killed] BlockStatement
src/services/TransactionService.ts:72:25
                 payload.amountCents,
                 payload.type
             );
-        } catch (error) {
-            void auditFinance.operationFailed('transaction_create', {
-                accountId: payload.accountId,
-                amountCents: payload.amountCents,
-                type: payload.type,
-                reason: error instanceof Error ? error.message : String(error),
-            });
-            if (error instanceof AnchorError) throw error;
-            throw new AnchorError('Failed to add transaction', 'DATABASE', error);
-        }
+        } catch (error) {}
     }
 
killedBy: TransactionService addTransaction wraps Firebase errors in AnchorError
statusReason: promise resolved "undefined" instead of rejecting

[Survived] StringLiteral
src/services/TransactionService.ts:73:47
                 payload.type
             );
         } catch (error) {
-            void auditFinance.operationFailed('transaction_create', {
+            void auditFinance.operationFailed("", {
                 accountId: payload.accountId,
                 amountCents: payload.amountCents,

[Killed] StringLiteral
src/services/TransactionService.ts:80:35
                 reason: error instanceof Error ? error.message : String(error),
             });
             if (error instanceof AnchorError) throw error;
-            throw new AnchorError('Failed to add transaction', 'DATABASE', error);
+            throw new AnchorError("", 'DATABASE', error);
         }
     }
killedBy: TransactionService addTransaction wraps Firebase errors in AnchorError
statusReason: expected [Function] to throw error including 'Failed to add transaction' but got ''

[Killed] ArrowFunction
src/services/TransactionService.ts:89:39
         userId: string, transactionId: string, accountId: string,
         accounts: AnchorAccount[], transactions: AnchorTransaction[]
     ): Promise<void> {
-        const account = accounts.find(a => a.id === accountId);
+        const account = accounts.find(() => undefined);
         if (!account) throw new AnchorError('Account not found', 'VALIDATION');
         if (!canDeleteTransaction(account, userId)) {
killedBy: TransactionService deleteTransaction soft-deletes transaction successfully
statusReason: Account not found

[Killed] ConditionalExpression
src/services/TransactionService.ts:89:44
         userId: string, transactionId: string, accountId: string,
         accounts: AnchorAccount[], transactions: AnchorTransaction[]
     ): Promise<void> {
-        const account = accounts.find(a => a.id === accountId);
+        const account = accounts.find(a => false);
         if (!account) throw new AnchorError('Account not found', 'VALIDATION');
         if (!canDeleteTransaction(account, userId)) {
killedBy: useFinanceService Transaction Management should delete transaction and reverse account balance correctly
statusReason: Account not found

[Killed] BooleanLiteral
src/services/TransactionService.ts:91:13
     ): Promise<void> {
         const account = accounts.find(a => a.id === accountId);
         if (!account) throw new AnchorError('Account not found', 'VALIDATION');
-        if (!canDeleteTransaction(account, userId)) {
+        if (canDeleteTransaction(account, userId)) {
             throw new AnchorError('Permission denied: You cannot delete transactions from this account.', 'PERMISSION');
         }
killedBy: TransactionService deleteTransaction soft-deletes transaction successfully
statusReason: Permission denied: You cannot delete transactions from this account.

[Killed] ConditionalExpression
src/services/TransactionService.ts:91:13
     ): Promise<void> {
         const account = accounts.find(a => a.id === accountId);
         if (!account) throw new AnchorError('Account not found', 'VALIDATION');
-        if (!canDeleteTransaction(account, userId)) {
+        if (false) {
             throw new AnchorError('Permission denied: You cannot delete transactions from this account.', 'PERMISSION');
         }
killedBy: TransactionService deleteTransaction throws PERMISSION error if user lacks delete rights
statusReason: promise resolved "undefined" instead of rejecting

[Killed] ConditionalExpression
src/services/TransactionService.ts:95:51
             throw new AnchorError('Permission denied: You cannot delete transactions from this account.', 'PERMISSION');
         }
 
-        const txToDelete = transactions.find(t => t.id === transactionId);
+        const txToDelete = transactions.find(t => true);
         if (!txToDelete) throw new AnchorError('Transaction not found', 'VALIDATION');
 
killedBy: useFinanceService Transaction Management should delete transaction and reverse account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Killed] ArrowFunction
src/services/TransactionService.ts:95:46
             throw new AnchorError('Permission denied: You cannot delete transactions from this account.', 'PERMISSION');
         }
 
-        const txToDelete = transactions.find(t => t.id === transactionId);
+        const txToDelete = transactions.find(() => undefined);
         if (!txToDelete) throw new AnchorError('Transaction not found', 'VALIDATION');
 
killedBy: TransactionService deleteTransaction soft-deletes transaction successfully
statusReason: Transaction not found

[Killed] BlockStatement
src/services/TransactionService.ts:103:76
             const targetUserId = account.ownerId || userId;
 
             // BUG-035 Fix: Use runTransaction for linked deletions to prevent race conditions
-            if (txToDelete.linkedTransactionId && txToDelete.linkedUserId) {
-                await runTransaction(this.firestore, async (transaction) => {
-                    const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
-                    transaction.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
-
-                    const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
-                    const balanceAdj = txToDelete.type === 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
-                    transaction.update(accRef, { balanceCents: increment(balanceAdj) });
-
-                    await this.deleteLinkedTransaction(transaction, txToDelete, userId, timestamp);
-                });
-            } else {
+            if (txToDelete.linkedTransactionId && txToDelete.linkedUserId) {} else {
                 // Simple delete uses writeBatch (still atomic, but faster for single ops)
                 const batch = writeBatch(this.firestore);
killedBy: TransactionService deleteTransaction deletes linked transfer transaction when present
statusReason: expected "vi.fn()" to be called at least once

[Survived] LogicalOperator
src/services/TransactionService.ts:103:17
             const targetUserId = account.ownerId || userId;
 
             // BUG-035 Fix: Use runTransaction for linked deletions to prevent race conditions
-            if (txToDelete.linkedTransactionId && txToDelete.linkedUserId) {
+            if (txToDelete.linkedTransactionId || txToDelete.linkedUserId) {
                 await runTransaction(this.firestore, async (transaction) => {
                     const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);

[Killed] BlockStatement
src/services/TransactionService.ts:104:77
 
             // BUG-035 Fix: Use runTransaction for linked deletions to prevent race conditions
             if (txToDelete.linkedTransactionId && txToDelete.linkedUserId) {
-                await runTransaction(this.firestore, async (transaction) => {
-                    const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
-                    transaction.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
-
-                    const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
-                    const balanceAdj = txToDelete.type === 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
-                    transaction.update(accRef, { balanceCents: increment(balanceAdj) });
-
-                    await this.deleteLinkedTransaction(transaction, txToDelete, userId, timestamp);
-                });
+                await runTransaction(this.firestore, async (transaction) => {});
             } else {
                 // Simple delete uses writeBatch (still atomic, but faster for single ops)
killedBy: TransactionService deleteTransaction deletes linked transfer transaction when present
statusReason: expected "vi.fn()" to be called at least once

[Survived] StringLiteral
src/services/TransactionService.ts:105:76
             // BUG-035 Fix: Use runTransaction for linked deletions to prevent race conditions
             if (txToDelete.linkedTransactionId && txToDelete.linkedUserId) {
                 await runTransaction(this.firestore, async (transaction) => {
-                    const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
+                    const txRef = doc(this.firestore, 'artifacts', APP_ID, "", targetUserId, 'finance', transactionId);
                     transaction.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
 

[Survived] BooleanLiteral
src/services/TransactionService.ts:106:64
             if (txToDelete.linkedTransactionId && txToDelete.linkedUserId) {
                 await runTransaction(this.firestore, async (transaction) => {
                     const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
-                    transaction.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
+                    transaction.update(txRef, { isSoftDeleted: false, deletedBy: userId, deletedAt: timestamp });
 
                     const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);

[Survived] StringLiteral
src/services/TransactionService.ts:108:100
                     const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
                     transaction.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
 
-                    const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
+                    const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, "", accountId);
                     const balanceAdj = txToDelete.type === 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
                     transaction.update(accRef, { balanceCents: increment(balanceAdj) });

[Survived] EqualityOperator
src/services/TransactionService.ts:109:40
                     transaction.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
 
                     const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
-                    const balanceAdj = txToDelete.type === 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
+                    const balanceAdj = txToDelete.type !== 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
                     transaction.update(accRef, { balanceCents: increment(balanceAdj) });
 

[NoCoverage] UnaryOperator
src/services/TransactionService.ts:109:71
                     transaction.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
 
                     const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
-                    const balanceAdj = txToDelete.type === 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
+                    const balanceAdj = txToDelete.type === 'income' ? +txToDelete.amountCents : txToDelete.amountCents;
                     transaction.update(accRef, { balanceCents: increment(balanceAdj) });
 

[Killed] BlockStatement
src/services/TransactionService.ts:114:20
 
                     await this.deleteLinkedTransaction(transaction, txToDelete, userId, timestamp);
                 });
-            } else {
-                // Simple delete uses writeBatch (still atomic, but faster for single ops)
-                const batch = writeBatch(this.firestore);
-                const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
-                batch.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
-
-                const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
-                const balanceAdj = txToDelete.type === 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
-                batch.update(accRef, { balanceCents: increment(balanceAdj) });
-
-                await batch.commit();
-            }
+            } else {}
 
             // AUDIT: Log transaction deletion
killedBy: useFinanceService Transaction Management should delete transaction and reverse account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Number of calls: 0

[Survived] StringLiteral
src/services/TransactionService.ts:117:51
             } else {
                 // Simple delete uses writeBatch (still atomic, but faster for single ops)
                 const batch = writeBatch(this.firestore);
-                const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
+                const txRef = doc(this.firestore, "", APP_ID, 'users', targetUserId, 'finance', transactionId);
                 batch.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
 

[Survived] StringLiteral
src/services/TransactionService.ts:117:72
             } else {
                 // Simple delete uses writeBatch (still atomic, but faster for single ops)
                 const batch = writeBatch(this.firestore);
-                const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
+                const txRef = doc(this.firestore, 'artifacts', APP_ID, "", targetUserId, 'finance', transactionId);
                 batch.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
 

[Killed] BooleanLiteral
src/services/TransactionService.ts:118:54
                 // Simple delete uses writeBatch (still atomic, but faster for single ops)
                 const batch = writeBatch(this.firestore);
                 const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
-                batch.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
+                batch.update(txRef, { isSoftDeleted: false, deletedBy: userId, deletedAt: timestamp });
 
                 const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
killedBy: useFinanceService Transaction Management should delete transaction and reverse account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Survived] StringLiteral
src/services/TransactionService.ts:120:52
                 const txRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'finance', transactionId);
                 batch.update(txRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
 
-                const accRef = doc(this.firestore, 'artifacts', APP_ID, 'users', targetUserId, 'accounts', accountId);
+                const accRef = doc(this.firestore, "", APP_ID, 'users', targetUserId, 'accounts', accountId);
                 const balanceAdj = txToDelete.type === 'income' ? -txToDelete.amountCents : txToDelete.amountCents;
                 batch.update(accRef, { balanceCents: increment(balanceAdj) });

[Killed] BlockStatement
src/services/TransactionService.ts:129:25
 
             // AUDIT: Log transaction deletion
             auditFinance.transactionDeleted(transactionId, accountId);
-        } catch (error) {
-            void auditFinance.operationFailed('transaction_delete', {
-                transactionId,
-                accountId,
-                reason: error instanceof Error ? error.message : String(error),
-            });
-            if (error instanceof AnchorError) throw error;
-            throw new AnchorError('Failed to delete transaction', 'DATABASE', error);
-        }
+        } catch (error) {}
     }
 
killedBy: TransactionService deleteTransaction wraps Firebase errors in AnchorError
statusReason: promise resolved "undefined" instead of rejecting

[Killed] BlockStatement
src/services/TransactionService.ts:143:22
     private async deleteLinkedTransaction(
         transaction: Parameters<Parameters<typeof runTransaction>[1]>[0],
         txToDelete: AnchorTransaction, userId: string, timestamp: string
-    ): Promise<void> {
-        const linkedTxRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'finance', txToDelete.linkedTransactionId!);
-        // BUG-035 Fix: Use transaction.get() instead of getDoc() for atomicity
-        const linkedTxDoc = await transaction.get(linkedTxRef);
-        if (linkedTxDoc.exists()) {
-            const pairedTx = linkedTxDoc.data() as AnchorTransaction;
-            transaction.update(linkedTxRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
-            const linkedAccRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'accounts', pairedTx.accountId);
-            transaction.update(linkedAccRef, { balanceCents: increment(pairedTx.type === 'income' ? -pairedTx.amountCents : pairedTx.amountCents) });
-        }
-    }
+    ): Promise<void> {}
 
     /** Update a transaction with optimistic locking */
killedBy: TransactionService deleteTransaction deletes linked transfer transaction when present
statusReason: expected "vi.fn()" to be called at least once

[Killed] ConditionalExpression
src/services/TransactionService.ts:147:13
         const linkedTxRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'finance', txToDelete.linkedTransactionId!);
         // BUG-035 Fix: Use transaction.get() instead of getDoc() for atomicity
         const linkedTxDoc = await transaction.get(linkedTxRef);
-        if (linkedTxDoc.exists()) {
+        if (true) {
             const pairedTx = linkedTxDoc.data() as AnchorTransaction;
             transaction.update(linkedTxRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
killedBy: TransactionService deleteTransaction handles missing linked transaction gracefully
statusReason: promise rejected "AnchorError: Failed to delete transaction { …(3) }" instead of resolving

[Survived] BlockStatement
src/services/TransactionService.ts:147:35
         const linkedTxRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'finance', txToDelete.linkedTransactionId!);
         // BUG-035 Fix: Use transaction.get() instead of getDoc() for atomicity
         const linkedTxDoc = await transaction.get(linkedTxRef);
-        if (linkedTxDoc.exists()) {
-            const pairedTx = linkedTxDoc.data() as AnchorTransaction;
-            transaction.update(linkedTxRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
-            const linkedAccRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'accounts', pairedTx.accountId);
-            transaction.update(linkedAccRef, { balanceCents: increment(pairedTx.type === 'income' ? -pairedTx.amountCents : pairedTx.amountCents) });
-        }
+        if (linkedTxDoc.exists()) {}
     }
 
