[Survived] BooleanLiteral
src/services/TransactionService.ts:149:62
         const linkedTxDoc = await transaction.get(linkedTxRef);
         if (linkedTxDoc.exists()) {
             const pairedTx = linkedTxDoc.data() as AnchorTransaction;
-            transaction.update(linkedTxRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
+            transaction.update(linkedTxRef, { isSoftDeleted: false, deletedBy: userId, deletedAt: timestamp });
             const linkedAccRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'accounts', pairedTx.accountId);
             transaction.update(linkedAccRef, { balanceCents: increment(pairedTx.type === 'income' ? -pairedTx.amountCents : pairedTx.amountCents) });

[Survived] StringLiteral
src/services/TransactionService.ts:150:110
         if (linkedTxDoc.exists()) {
             const pairedTx = linkedTxDoc.data() as AnchorTransaction;
             transaction.update(linkedTxRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
-            const linkedAccRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'accounts', pairedTx.accountId);
+            const linkedAccRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, "", pairedTx.accountId);
             transaction.update(linkedAccRef, { balanceCents: increment(pairedTx.type === 'income' ? -pairedTx.amountCents : pairedTx.amountCents) });
         }

[Survived] ConditionalExpression
src/services/TransactionService.ts:151:72
             const pairedTx = linkedTxDoc.data() as AnchorTransaction;
             transaction.update(linkedTxRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
             const linkedAccRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'accounts', pairedTx.accountId);
-            transaction.update(linkedAccRef, { balanceCents: increment(pairedTx.type === 'income' ? -pairedTx.amountCents : pairedTx.amountCents) });
+            transaction.update(linkedAccRef, { balanceCents: increment(false ? -pairedTx.amountCents : pairedTx.amountCents) });
         }
     }

[Survived] ConditionalExpression
src/services/TransactionService.ts:151:72
             const pairedTx = linkedTxDoc.data() as AnchorTransaction;
             transaction.update(linkedTxRef, { isSoftDeleted: true, deletedBy: userId, deletedAt: timestamp });
             const linkedAccRef = doc(this.firestore, 'artifacts', APP_ID, 'users', txToDelete.linkedUserId!, 'accounts', pairedTx.accountId);
-            transaction.update(linkedAccRef, { balanceCents: increment(pairedTx.type === 'income' ? -pairedTx.amountCents : pairedTx.amountCents) });
+            transaction.update(linkedAccRef, { balanceCents: increment(true ? -pairedTx.amountCents : pairedTx.amountCents) });
         }
     }

[Killed] BlockStatement
src/services/TransactionService.ts:159:22
     async updateTransaction(
         userId: string, transactionId: string, accountId: string,
         updates: UpdateTransactionPayload, accounts: AnchorAccount[]
-    ): Promise<void> {
-        return updateTransactionOp(this.firestore, userId, transactionId, accountId, updates, accounts);
-    }
+    ): Promise<void> {}
 }
 
killedBy: TransactionService updateTransaction updates transaction fields successfully
statusReason: expected "vi.fn()" to be called at least once
