[Killed] ArithmeticOperator
src/utils/finance.ts:24:46
     data: T[],
     threshold: number = 0.05
 ): T[] {
-    const total = data.reduce((sum, item) => sum + item.value, 0);
+    const total = data.reduce((sum, item) => sum - item.value, 0);
     if (total === 0) return data;
 
killedBy: groupSmallValues returns data unchanged when all items above threshold
statusReason: expected [ { name: 'Other', value: 100, …(1) } ] to deeply equal [ Array(2) ]

[Killed] ConditionalExpression
src/utils/finance.ts:25:9
     threshold: number = 0.05
 ): T[] {
     const total = data.reduce((sum, item) => sum + item.value, 0);
-    if (total === 0) return data;
+    if (true) return data;
 
     const significant: T[] = [];
killedBy: groupSmallValues groups items below 5% threshold into "Other"
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/utils/finance.ts:25:9
     threshold: number = 0.05
 ): T[] {
     const total = data.reduce((sum, item) => sum + item.value, 0);
-    if (total === 0) return data;
+    if (false) return data;
 
     const significant: T[] = [];
killedBy: groupSmallValues returns data unchanged when total is 0
statusReason: expected [] to deeply equal [ Array(2) ]

[Killed] BlockStatement
src/utils/finance.ts:30:26
     const significant: T[] = [];
     let otherValue = 0;
 
-    data.forEach(item => {
-        const percentage = item.value / total;
-        if (percentage >= threshold) {
-            significant.push(item);
-        } else {
-            otherValue += item.value;
-        }
-    });
+    data.forEach(item => {});
 
     if (otherValue > 0) {
killedBy: groupSmallValues returns data unchanged when all items above threshold
statusReason: expected [] to deeply equal [ Array(2) ]

[Killed] ArithmeticOperator
src/utils/finance.ts:31:28
     let otherValue = 0;
 
     data.forEach(item => {
-        const percentage = item.value / total;
+        const percentage = item.value * total;
         if (percentage >= threshold) {
             significant.push(item);
killedBy: groupSmallValues groups items below 5% threshold into "Other"
statusReason: expected [ …(3) ] to have a length of 2 but got 3

[Killed] ConditionalExpression
src/utils/finance.ts:32:13
 
     data.forEach(item => {
         const percentage = item.value / total;
-        if (percentage >= threshold) {
+        if (false) {
             significant.push(item);
         } else {
killedBy: groupSmallValues returns data unchanged when all items above threshold
statusReason: expected [ { name: 'Other', value: 100, …(1) } ] to deeply equal [ Array(2) ]

[Killed] BlockStatement
src/utils/finance.ts:32:38
 
     data.forEach(item => {
         const percentage = item.value / total;
-        if (percentage >= threshold) {
-            significant.push(item);
-        } else {
+        if (percentage >= threshold) {} else {
             otherValue += item.value;
         }
killedBy: groupSmallValues returns data unchanged when all items above threshold
statusReason: expected [] to deeply equal [ Array(2) ]

[Killed] BlockStatement
src/utils/finance.ts:34:16
         const percentage = item.value / total;
         if (percentage >= threshold) {
             significant.push(item);
-        } else {
-            otherValue += item.value;
-        }
+        } else {}
     });
 
killedBy: groupSmallValues groups items below 5% threshold into "Other"
statusReason: expected [ { name: 'Big', value: 95, …(1) } ] to have a length of 2 but got 1

[Killed] AssignmentOperator
src/utils/finance.ts:35:13
         if (percentage >= threshold) {
             significant.push(item);
         } else {
-            otherValue += item.value;
+            otherValue -= item.value;
         }
     });
killedBy: groupSmallValues groups items below 5% threshold into "Other"
statusReason: expected [ { name: 'Big', value: 95, …(1) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/utils/finance.ts:39:9
         }
     });
 
-    if (otherValue > 0) {
+    if (true) {
         significant.push({
             name: 'Other',
killedBy: groupSmallValues returns data unchanged when all items above threshold
statusReason: expected [ Array(3) ] to deeply equal [ Array(2) ]

[Killed] BlockStatement
src/utils/finance.ts:39:25
         }
     });
 
-    if (otherValue > 0) {
-        significant.push({
-            name: 'Other',
-            value: otherValue,
-            color: '#94a3b8' // slate-400
-        } as T);
-    }
+    if (otherValue > 0) {}
 
     return significant;
killedBy: groupSmallValues groups items below 5% threshold into "Other"
statusReason: expected [ { name: 'Big', value: 95, …(1) } ] to have a length of 2 but got 1

[Killed] ConditionalExpression
src/utils/finance.ts:59:9
     recentTransactions: AnchorTransaction[],
     limit: number = 50
 ): string | null {
-    if (!description || description.length < 2) return null;
+    if (true) return null;
 
     const searchTerm = description.toLowerCase().trim();
killedBy: suggestCategory finds matching category by partial title match
statusReason: expected null to be 'Food' // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:59:25
     recentTransactions: AnchorTransaction[],
     limit: number = 50
 ): string | null {
-    if (!description || description.length < 2) return null;
+    if (!description || false) return null;
 
     const searchTerm = description.toLowerCase().trim();
killedBy: suggestCategory returns null for single-character description
statusReason: expected 'Transport' to be null

[Killed] MethodExpression
src/utils/finance.ts:61:24
 ): string | null {
     if (!description || description.length < 2) return null;
 
-    const searchTerm = description.toLowerCase().trim();
+    const searchTerm = description.toUpperCase().trim();
     const recent = recentTransactions.slice(0, limit);
 
killedBy: suggestCategory finds matching category by partial title match
statusReason: expected null to be 'Food' // Object.is equality

[Survived] MethodExpression
src/utils/finance.ts:61:24
 ): string | null {
     if (!description || description.length < 2) return null;
 
-    const searchTerm = description.toLowerCase().trim();
+    const searchTerm = description.toLowerCase();
     const recent = recentTransactions.slice(0, limit);
 

[Killed] MethodExpression
src/utils/finance.ts:62:20
     if (!description || description.length < 2) return null;
 
     const searchTerm = description.toLowerCase().trim();
-    const recent = recentTransactions.slice(0, limit);
+    const recent = recentTransactions;
 
     // Find matching transaction by title
killedBy: suggestCategory respects the limit parameter
statusReason: expected 'Entertainment' to be null

[Killed] ArrowFunction
src/utils/finance.ts:65:31
     const recent = recentTransactions.slice(0, limit);
 
     // Find matching transaction by title
-    const match = recent.find(tx =>
-        tx.title.toLowerCase().includes(searchTerm) ||
-        searchTerm.includes(tx.title.toLowerCase())
+    const match = recent.find(() => undefined
     );
 
killedBy: suggestCategory finds matching category by partial title match
statusReason: expected null to be 'Food' // Object.is equality

[Killed] LogicalOperator
src/utils/finance.ts:66:9
 
     // Find matching transaction by title
     const match = recent.find(tx =>
-        tx.title.toLowerCase().includes(searchTerm) ||
-        searchTerm.includes(tx.title.toLowerCase())
+        tx.title.toLowerCase().includes(searchTerm) && searchTerm.includes(tx.title.toLowerCase())
     );
 
killedBy: suggestCategory finds matching category by partial title match
statusReason: expected null to be 'Food' // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:66:9
 
     // Find matching transaction by title
     const match = recent.find(tx =>
-        tx.title.toLowerCase().includes(searchTerm) ||
-        searchTerm.includes(tx.title.toLowerCase())
+        true
     );
 
killedBy: suggestCategory finds category when search term contains transaction title
statusReason: expected 'Food' to be 'Entertainment' // Object.is equality

[Killed] MethodExpression
src/utils/finance.ts:67:29
     // Find matching transaction by title
     const match = recent.find(tx =>
         tx.title.toLowerCase().includes(searchTerm) ||
-        searchTerm.includes(tx.title.toLowerCase())
+        searchTerm.includes(tx.title.toUpperCase())
     );
 
killedBy: suggestCategory finds category when search term contains transaction title
statusReason: expected null to be 'Entertainment' // Object.is equality

[Killed] MethodExpression
src/utils/finance.ts:83:23
     USD: number;
     total: { amount: number; currency: 'NGN' | 'USD' };
 } {
-    const NGN_Cents = accounts
-        .filter(acc => acc.currency === 'NGN')
+    const NGN_Cents = accounts
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
killedBy: calculateNetWorth sums USD accounts separately
statusReason: expected 'NGN' to be 'USD' // Object.is equality

[Killed] ArrowFunction
src/utils/finance.ts:84:17
     total: { amount: number; currency: 'NGN' | 'USD' };
 } {
     const NGN_Cents = accounts
-        .filter(acc => acc.currency === 'NGN')
+        .filter(() => undefined)
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
killedBy: calculateNetWorth sums NGN accounts correctly (cents → display)
statusReason: expected +0 to be 3000 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:84:24
     total: { amount: number; currency: 'NGN' | 'USD' };
 } {
     const NGN_Cents = accounts
-        .filter(acc => acc.currency === 'NGN')
+        .filter(acc => true)
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
killedBy: calculateNetWorth sums USD accounts separately
statusReason: expected 'NGN' to be 'USD' // Object.is equality

[Killed] ArithmeticOperator
src/utils/finance.ts:85:31
 } {
     const NGN_Cents = accounts
         .filter(acc => acc.currency === 'NGN')
-        .reduce((sum, acc) => sum + acc.balanceCents, 0);
+        .reduce((sum, acc) => sum - acc.balanceCents, 0);
 
     const USD_Cents = accounts
killedBy: calculateNetWorth sums NGN accounts correctly (cents → display)
statusReason: expected -3000 to be 3000 // Object.is equality

[Killed] MethodExpression
src/utils/finance.ts:87:23
         .filter(acc => acc.currency === 'NGN')
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
-    const USD_Cents = accounts
-        .filter(acc => acc.currency === 'USD')
+    const USD_Cents = accounts
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
killedBy: calculateNetWorth uses dominant currency (higher absolute value) for total
statusReason: expected 'USD' to be 'NGN' // Object.is equality

[Killed] ArrowFunction
src/utils/finance.ts:88:17
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
     const USD_Cents = accounts
-        .filter(acc => acc.currency === 'USD')
+        .filter(() => undefined)
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
killedBy: calculateNetWorth sums USD accounts separately
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:88:24
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
     const USD_Cents = accounts
-        .filter(acc => acc.currency === 'USD')
+        .filter(acc => false)
         .reduce((sum, acc) => sum + acc.balanceCents, 0);
 
killedBy: calculateNetWorth sums USD accounts separately
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ArithmeticOperator
src/utils/finance.ts:89:31
 
     const USD_Cents = accounts
         .filter(acc => acc.currency === 'USD')
-        .reduce((sum, acc) => sum + acc.balanceCents, 0);
+        .reduce((sum, acc) => sum - acc.balanceCents, 0);
 
     // Convert to display decimals only at the very end
killedBy: calculateNetWorth sums USD accounts separately
statusReason: expected -500 to be 500 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:97:29
 
     // F-017: Total uses the dominant currency (higher absolute value)
     // This provides a reasonable primary display when user has mixed currencies
-    const primaryCurrency = Math.abs(NGN) >= Math.abs(USD) ? 'NGN' : 'USD';
+    const primaryCurrency = false ? 'NGN' : 'USD';
     const primaryAmount = primaryCurrency === 'NGN' ? NGN : USD;
 
killedBy: calculateNetWorth sums NGN accounts correctly (cents → display)
statusReason: expected 'USD' to be 'NGN' // Object.is equality

[Killed] EqualityOperator
src/utils/finance.ts:97:29
 
     // F-017: Total uses the dominant currency (higher absolute value)
     // This provides a reasonable primary display when user has mixed currencies
-    const primaryCurrency = Math.abs(NGN) >= Math.abs(USD) ? 'NGN' : 'USD';
+    const primaryCurrency = Math.abs(NGN) < Math.abs(USD) ? 'NGN' : 'USD';
     const primaryAmount = primaryCurrency === 'NGN' ? NGN : USD;
 
killedBy: calculateNetWorth sums NGN accounts correctly (cents → display)
statusReason: expected 'USD' to be 'NGN' // Object.is equality

[Killed] EqualityOperator
src/utils/finance.ts:98:27
     // F-017: Total uses the dominant currency (higher absolute value)
     // This provides a reasonable primary display when user has mixed currencies
     const primaryCurrency = Math.abs(NGN) >= Math.abs(USD) ? 'NGN' : 'USD';
-    const primaryAmount = primaryCurrency === 'NGN' ? NGN : USD;
+    const primaryAmount = primaryCurrency !== 'NGN' ? NGN : USD;
 
     return {
killedBy: calculateNetWorth uses dominant currency (higher absolute value) for total
statusReason: expected 50 to be 100000 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:98:27
     // F-017: Total uses the dominant currency (higher absolute value)
     // This provides a reasonable primary display when user has mixed currencies
     const primaryCurrency = Math.abs(NGN) >= Math.abs(USD) ? 'NGN' : 'USD';
-    const primaryAmount = primaryCurrency === 'NGN' ? NGN : USD;
+    const primaryAmount = false ? NGN : USD;
 
     return {
killedBy: calculateNetWorth uses dominant currency (higher absolute value) for total
statusReason: expected 50 to be 100000 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:115:9
     accountLabel: string;
 } {
     switch (type) {
-        case 'income':
-            return { header: 'Record Income', accountLabel: 'DEPOSIT TO' };
+        case 'income':
         case 'expense':
             return { header: 'Record Expense', accountLabel: 'SPEND FROM' };
killedBy: getTransactionLabel returns correct labels for income
statusReason: expected 'Record Expense' to be 'Record Income' // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:117:9
     switch (type) {
         case 'income':
             return { header: 'Record Income', accountLabel: 'DEPOSIT TO' };
-        case 'expense':
-            return { header: 'Record Expense', accountLabel: 'SPEND FROM' };
+        case 'expense':
         case 'transfer':
             return { header: 'Record Transfer', accountLabel: 'TRANSFER FROM' };
killedBy: getTransactionLabel returns correct labels for expense
statusReason: expected 'Record Transfer' to be 'Record Expense' // Object.is equality

[Killed] MethodExpression
src/utils/finance.ts:132:5
     days: number = 30
 ): { income: number; expense: number; net: number } {
     const cutoff = new Date();
-    cutoff.setDate(cutoff.getDate() - days);
+    cutoff.setTime(cutoff.getDate() - days);
 
     const filtered = transactions.filter(tx => {
killedBy: calculateCashFlow excludes transactions outside the date window
statusReason: expected 500 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/utils/finance.ts:132:20
     days: number = 30
 ): { income: number; expense: number; net: number } {
     const cutoff = new Date();
-    cutoff.setDate(cutoff.getDate() - days);
+    cutoff.setDate(cutoff.getDate() + days);
 
     const filtered = transactions.filter(tx => {
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 500 // Object.is equality

[Killed] MethodExpression
src/utils/finance.ts:134:22
     const cutoff = new Date();
     cutoff.setDate(cutoff.getDate() - days);
 
-    const filtered = transactions.filter(tx => {
-        const txDate = new Date(tx.date);
-        return txDate >= cutoff;
-    });
+    const filtered = transactions;
 
     const incomeCents = filtered
killedBy: calculateCashFlow excludes transactions outside the date window
statusReason: expected 500 to be +0 // Object.is equality

[Killed] BlockStatement
src/utils/finance.ts:134:48
     const cutoff = new Date();
     cutoff.setDate(cutoff.getDate() - days);
 
-    const filtered = transactions.filter(tx => {
-        const txDate = new Date(tx.date);
-        return txDate >= cutoff;
-    });
+    const filtered = transactions.filter(tx => {});
 
     const incomeCents = filtered
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:136:16
 
     const filtered = transactions.filter(tx => {
         const txDate = new Date(tx.date);
-        return txDate >= cutoff;
+        return false;
     });
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 500 // Object.is equality

[Killed] EqualityOperator
src/utils/finance.ts:136:16
 
     const filtered = transactions.filter(tx => {
         const txDate = new Date(tx.date);
-        return txDate >= cutoff;
+        return txDate < cutoff;
     });
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 500 // Object.is equality

[Killed] MethodExpression
src/utils/finance.ts:139:25
         return txDate >= cutoff;
     });
 
-    const incomeCents = filtered
-        .filter(tx => tx.type === 'income')
+    const incomeCents = filtered
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected 700 to be 500 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:140:23
     });
 
     const incomeCents = filtered
-        .filter(tx => tx.type === 'income')
+        .filter(tx => false)
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ArrowFunction
src/utils/finance.ts:140:17
     });
 
     const incomeCents = filtered
-        .filter(tx => tx.type === 'income')
+        .filter(() => undefined)
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 500 // Object.is equality

[Killed] LogicalOperator
src/utils/finance.ts:141:37
 
     const incomeCents = filtered
         .filter(tx => tx.type === 'income')
-        .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
+        .reduce((sum, tx) => sum + (tx.amountCents && 0), 0);
 
     const expenseCents = filtered
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ArithmeticOperator
src/utils/finance.ts:141:30
 
     const incomeCents = filtered
         .filter(tx => tx.type === 'income')
-        .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
+        .reduce((sum, tx) => sum - (tx.amountCents || 0), 0);
 
     const expenseCents = filtered
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected -500 to be 500 // Object.is equality

[Killed] MethodExpression
src/utils/finance.ts:143:26
         .filter(tx => tx.type === 'income')
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
-    const expenseCents = filtered
-        .filter(tx => tx.type === 'expense')
+    const expenseCents = filtered
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected 700 to be 200 // Object.is equality

[Killed] ArrowFunction
src/utils/finance.ts:144:17
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
     const expenseCents = filtered
-        .filter(tx => tx.type === 'expense')
+        .filter(() => undefined)
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 200 // Object.is equality

[Killed] EqualityOperator
src/utils/finance.ts:144:23
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
     const expenseCents = filtered
-        .filter(tx => tx.type === 'expense')
+        .filter(tx => tx.type !== 'expense')
         .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
 
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected 500 to be 200 // Object.is equality

[Killed] LogicalOperator
src/utils/finance.ts:145:37
 
     const expenseCents = filtered
         .filter(tx => tx.type === 'expense')
-        .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
+        .reduce((sum, tx) => sum + (tx.amountCents && 0), 0);
 
     const income = fromCents(incomeCents);
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected +0 to be 200 // Object.is equality

[Killed] ArithmeticOperator
src/utils/finance.ts:145:30
 
     const expenseCents = filtered
         .filter(tx => tx.type === 'expense')
-        .reduce((sum, tx) => sum + (tx.amountCents || 0), 0);
+        .reduce((sum, tx) => sum - (tx.amountCents || 0), 0);
 
     const income = fromCents(incomeCents);
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected -200 to be 200 // Object.is equality

[Killed] ArithmeticOperator
src/utils/finance.ts:153:14
     return {
         income,
         expense,
-        net: income - expense
+        net: income + expense
     };
 }
killedBy: calculateCashFlow sums income and expense within date window
statusReason: expected 700 to be 300 // Object.is equality

[Killed] ConditionalExpression
src/utils/finance.ts:164:13
     const nameCount: Record<string, number> = {};
 
     return data.map(item => {
-        if (nameCount[item.name]) {
+        if (false) {
             nameCount[item.name]++;
             return { ...item, name: `${item.name} (${nameCount[item.name]})` };
killedBy: deduplicateLabels appends (2), (3) to duplicate names
statusReason: expected [ 'Savings', 'Savings', 'Savings' ] to deeply equal [ 'Savings', 'Savings (2)', …(1) ]

[Killed] BlockStatement
src/utils/finance.ts:164:35
     const nameCount: Record<string, number> = {};
 
     return data.map(item => {
-        if (nameCount[item.name]) {
-            nameCount[item.name]++;
-            return { ...item, name: `${item.name} (${nameCount[item.name]})` };
-        }
+        if (nameCount[item.name]) {}
         nameCount[item.name] = 1;
         return item;
killedBy: deduplicateLabels appends (2), (3) to duplicate names
statusReason: expected [ 'Savings', 'Savings', 'Savings' ] to deeply equal [ 'Savings', 'Savings (2)', …(1) ]

[Killed] UpdateOperator
src/utils/finance.ts:165:13
 
     return data.map(item => {
         if (nameCount[item.name]) {
-            nameCount[item.name]++;
+            nameCount[item.name]--;
             return { ...item, name: `${item.name} (${nameCount[item.name]})` };
         }
killedBy: deduplicateLabels appends (2), (3) to duplicate names
statusReason: expected [ 'Savings', 'Savings (0)', 'Savings' ] to deeply equal [ 'Savings', 'Savings (2)', …(1) ]

[Killed] StringLiteral
src/utils/finance.ts:166:37
     return data.map(item => {
         if (nameCount[item.name]) {
             nameCount[item.name]++;
-            return { ...item, name: `${item.name} (${nameCount[item.name]})` };
+            return { ...item, name: `` };
         }
         nameCount[item.name] = 1;
killedBy: deduplicateLabels appends (2), (3) to duplicate names
statusReason: expected [ 'Savings', '', '' ] to deeply equal [ 'Savings', 'Savings (2)', …(1) ]
