[Killed] MethodExpression
src/utils/financeInsights.ts:21:43
 
 export const getCashFlowAnalysis = (transactions: AnchorTransaction[]): CashFlowAnalysis => {
     const today = new Date();
-    const sevenDaysAgo = new Date(today); sevenDaysAgo.setDate(today.getDate() - 7);
+    const sevenDaysAgo = new Date(today); sevenDaysAgo.setTime(today.getDate() - 7);
     const fourteenDaysAgo = new Date(today); fourteenDaysAgo.setDate(today.getDate() - 14);
 
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected 1500 to be 1000 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsights.ts:21:64
 
 export const getCashFlowAnalysis = (transactions: AnchorTransaction[]): CashFlowAnalysis => {
     const today = new Date();
-    const sevenDaysAgo = new Date(today); sevenDaysAgo.setDate(today.getDate() - 7);
+    const sevenDaysAgo = new Date(today); sevenDaysAgo.setDate(today.getDate() + 7);
     const fourteenDaysAgo = new Date(today); fourteenDaysAgo.setDate(today.getDate() - 14);
 
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsights.ts:22:70
 export const getCashFlowAnalysis = (transactions: AnchorTransaction[]): CashFlowAnalysis => {
     const today = new Date();
     const sevenDaysAgo = new Date(today); sevenDaysAgo.setDate(today.getDate() - 7);
-    const fourteenDaysAgo = new Date(today); fourteenDaysAgo.setDate(today.getDate() - 14);
+    const fourteenDaysAgo = new Date(today); fourteenDaysAgo.setDate(today.getDate() + 14);
 
     let currentIncome = 0, currentExpense = 0, prevIncome = 0, prevExpense = 0;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 500 // Object.is equality

[Survived] MethodExpression
src/utils/financeInsights.ts:22:46
 export const getCashFlowAnalysis = (transactions: AnchorTransaction[]): CashFlowAnalysis => {
     const today = new Date();
     const sevenDaysAgo = new Date(today); sevenDaysAgo.setDate(today.getDate() - 7);
-    const fourteenDaysAgo = new Date(today); fourteenDaysAgo.setDate(today.getDate() - 14);
+    const fourteenDaysAgo = new Date(today); fourteenDaysAgo.setTime(today.getDate() - 14);
 
     let currentIncome = 0, currentExpense = 0, prevIncome = 0, prevExpense = 0;

[Killed] BlockStatement
src/utils/financeInsights.ts:26:31
 
     let currentIncome = 0, currentExpense = 0, prevIncome = 0, prevExpense = 0;
 
-    transactions.forEach(t => {
-        if (!t || !t.date || t.isSoftDeleted) return;
-        const d = new Date(t.date);
-        const amount = fromCents(t.amountCents || 0);
-
-        if (d >= sevenDaysAgo && d <= today) {
-            if (t.type === 'income') currentIncome += amount;
-            if (t.type === 'expense') currentExpense += amount;
-        } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
-            if (t.type === 'income') prevIncome += amount;
-            if (t.type === 'expense') prevExpense += amount;
-        }
-    });
+    transactions.forEach(t => {});
 
     const currentNet = currentIncome - currentExpense;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] BooleanLiteral
src/utils/financeInsights.ts:27:19
     let currentIncome = 0, currentExpense = 0, prevIncome = 0, prevExpense = 0;
 
     transactions.forEach(t => {
-        if (!t || !t.date || t.isSoftDeleted) return;
+        if (!t || t.date || t.isSoftDeleted) return;
         const d = new Date(t.date);
         const amount = fromCents(t.amountCents || 0);
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsights.ts:27:13
     let currentIncome = 0, currentExpense = 0, prevIncome = 0, prevExpense = 0;
 
     transactions.forEach(t => {
-        if (!t || !t.date || t.isSoftDeleted) return;
+        if ((!t || !t.date) && t.isSoftDeleted) return;
         const d = new Date(t.date);
         const amount = fromCents(t.amountCents || 0);
killedBy: financeInsights getCashFlowAnalysis skips soft-deleted transactions
statusReason: expected 500 to be +0 // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsights.ts:29:34
     transactions.forEach(t => {
         if (!t || !t.date || t.isSoftDeleted) return;
         const d = new Date(t.date);
-        const amount = fromCents(t.amountCents || 0);
+        const amount = fromCents(t.amountCents && 0);
 
         if (d >= sevenDaysAgo && d <= today) {
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsights.ts:31:13
         const d = new Date(t.date);
         const amount = fromCents(t.amountCents || 0);
 
-        if (d >= sevenDaysAgo && d <= today) {
+        if (d >= sevenDaysAgo || d <= today) {
             if (t.type === 'income') currentIncome += amount;
             if (t.type === 'expense') currentExpense += amount;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected 1500 to be 1000 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:31:13
         const d = new Date(t.date);
         const amount = fromCents(t.amountCents || 0);
 
-        if (d >= sevenDaysAgo && d <= today) {
+        if (false) {
             if (t.type === 'income') currentIncome += amount;
             if (t.type === 'expense') currentExpense += amount;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsights.ts:32:17
         const amount = fromCents(t.amountCents || 0);
 
         if (d >= sevenDaysAgo && d <= today) {
-            if (t.type === 'income') currentIncome += amount;
+            if (t.type !== 'income') currentIncome += amount;
             if (t.type === 'expense') currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 1000 // Object.is equality

[Killed] AssignmentOperator
src/utils/financeInsights.ts:32:38
         const amount = fromCents(t.amountCents || 0);
 
         if (d >= sevenDaysAgo && d <= today) {
-            if (t.type === 'income') currentIncome += amount;
+            if (t.type === 'income') currentIncome -= amount;
             if (t.type === 'expense') currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected -1000 to be 1000 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsights.ts:33:17
 
         if (d >= sevenDaysAgo && d <= today) {
             if (t.type === 'income') currentIncome += amount;
-            if (t.type === 'expense') currentExpense += amount;
+            if (t.type !== 'expense') currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
             if (t.type === 'income') prevIncome += amount;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected 'worse' to be 'better' // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:33:17
 
         if (d >= sevenDaysAgo && d <= today) {
             if (t.type === 'income') currentIncome += amount;
-            if (t.type === 'expense') currentExpense += amount;
+            if (true) currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
             if (t.type === 'income') prevIncome += amount;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected 'worse' to be 'better' // Object.is equality

[Killed] BlockStatement
src/utils/financeInsights.ts:34:62
         if (d >= sevenDaysAgo && d <= today) {
             if (t.type === 'income') currentIncome += amount;
             if (t.type === 'expense') currentExpense += amount;
-        } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
-            if (t.type === 'income') prevIncome += amount;
-            if (t.type === 'expense') prevExpense += amount;
-        }
+        } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {}
     });
 
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 500 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsights.ts:34:44
         if (d >= sevenDaysAgo && d <= today) {
             if (t.type === 'income') currentIncome += amount;
             if (t.type === 'expense') currentExpense += amount;
-        } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
+        } else if (d >= fourteenDaysAgo && d >= sevenDaysAgo) {
             if (t.type === 'income') prevIncome += amount;
             if (t.type === 'expense') prevExpense += amount;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:35:17
             if (t.type === 'income') currentIncome += amount;
             if (t.type === 'expense') currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
-            if (t.type === 'income') prevIncome += amount;
+            if (false) prevIncome += amount;
             if (t.type === 'expense') prevExpense += amount;
         }
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 500 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsights.ts:35:17
             if (t.type === 'income') currentIncome += amount;
             if (t.type === 'expense') currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
-            if (t.type === 'income') prevIncome += amount;
+            if (t.type !== 'income') prevIncome += amount;
             if (t.type === 'expense') prevExpense += amount;
         }
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 500 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsights.ts:36:17
             if (t.type === 'expense') currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
             if (t.type === 'income') prevIncome += amount;
-            if (t.type === 'expense') prevExpense += amount;
+            if (t.type !== 'expense') prevExpense += amount;
         }
     });
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 500 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:36:17
             if (t.type === 'expense') currentExpense += amount;
         } else if (d >= fourteenDaysAgo && d < sevenDaysAgo) {
             if (t.type === 'income') prevIncome += amount;
-            if (t.type === 'expense') prevExpense += amount;
+            if (true) prevExpense += amount;
         }
     });
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 500 // Object.is equality

[Survived] ArithmeticOperator
src/utils/financeInsights.ts:40:24
         }
     });
 
-    const currentNet = currentIncome - currentExpense;
+    const currentNet = currentIncome + currentExpense;
     const prevNet = prevIncome - prevExpense;
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';

[Survived] ArithmeticOperator
src/utils/financeInsights.ts:41:21
     });
 
     const currentNet = currentIncome - currentExpense;
-    const prevNet = prevIncome - prevExpense;
+    const prevNet = prevIncome + prevExpense;
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';
     if (currentNet > prevNet) trend = 'better';

[Killed] EqualityOperator
src/utils/financeInsights.ts:43:9
     const currentNet = currentIncome - currentExpense;
     const prevNet = prevIncome - prevExpense;
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';
-    if (currentNet > prevNet) trend = 'better';
+    if (currentNet <= prevNet) trend = 'better';
     else if (currentNet < prevNet) trend = 'worse';
     const diffPercent = prevNet !== 0 ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected 'neutral' to be 'better' // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:43:9
     const currentNet = currentIncome - currentExpense;
     const prevNet = prevIncome - prevExpense;
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';
-    if (currentNet > prevNet) trend = 'better';
+    if (true) trend = 'better';
     else if (currentNet < prevNet) trend = 'worse';
     const diffPercent = prevNet !== 0 ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
killedBy: financeInsights getCashFlowAnalysis returns neutral when nets are equal
statusReason: expected 'better' to be 'neutral' // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsights.ts:44:14
     const prevNet = prevIncome - prevExpense;
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';
     if (currentNet > prevNet) trend = 'better';
-    else if (currentNet < prevNet) trend = 'worse';
+    else if (currentNet >= prevNet) trend = 'worse';
     const diffPercent = prevNet !== 0 ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
 
killedBy: financeInsights getCashFlowAnalysis returns neutral when nets are equal
statusReason: expected 'worse' to be 'neutral' // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:44:14
     const prevNet = prevIncome - prevExpense;
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';
     if (currentNet > prevNet) trend = 'better';
-    else if (currentNet < prevNet) trend = 'worse';
+    else if (false) trend = 'worse';
     const diffPercent = prevNet !== 0 ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
 
killedBy: financeInsights getCashFlowAnalysis returns worse trend when current net < previous net
statusReason: expected 'neutral' to be 'worse' // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:45:25
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';
     if (currentNet > prevNet) trend = 'better';
     else if (currentNet < prevNet) trend = 'worse';
-    const diffPercent = prevNet !== 0 ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
+    const diffPercent = false ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
 
     return { income: currentIncome, expense: currentExpense, net: currentNet, prevNet, trend, diffPercent };
killedBy: financeInsights getCashFlowAnalysis compares current week with previous week
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:45:25
     let trend: 'better' | 'worse' | 'neutral' = 'neutral';
     if (currentNet > prevNet) trend = 'better';
     else if (currentNet < prevNet) trend = 'worse';
-    const diffPercent = prevNet !== 0 ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
+    const diffPercent = true ? ((currentNet - prevNet) / Math.abs(prevNet)) * 100 : 0;
 
     return { income: currentIncome, expense: currentExpense, net: currentNet, prevNet, trend, diffPercent };
killedBy: financeInsights getCashFlowAnalysis returns 0 diffPercent when prevNet is 0
statusReason: expected Infinity to be +0 // Object.is equality

[Killed] ArrowFunction
src/utils/financeInsights.ts:51:36
 };
 
 export const getAssetDistribution = (accounts: import('../types').AnchorAccount[]): AssetClass[] => {
-    const active = accounts.filter(a => !a.isArchived);
+    const active = accounts.filter(() => undefined);
     const total = active.reduce((sum, a) => sum + fromCents(a.balanceCents), 0);
     if (total === 0) return [];
killedBy: financeInsights getAssetDistribution returns sorted percentages for accounts
statusReason: expected [] to have a length of 2 but got +0

[Killed] BooleanLiteral
src/utils/financeInsights.ts:51:41
 };
 
 export const getAssetDistribution = (accounts: import('../types').AnchorAccount[]): AssetClass[] => {
-    const active = accounts.filter(a => !a.isArchived);
+    const active = accounts.filter(a => a.isArchived);
     const total = active.reduce((sum, a) => sum + fromCents(a.balanceCents), 0);
     if (total === 0) return [];
killedBy: financeInsights getAssetDistribution returns sorted percentages for accounts
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArithmeticOperator
src/utils/financeInsights.ts:52:45
 
 export const getAssetDistribution = (accounts: import('../types').AnchorAccount[]): AssetClass[] => {
     const active = accounts.filter(a => !a.isArchived);
-    const total = active.reduce((sum, a) => sum + fromCents(a.balanceCents), 0);
+    const total = active.reduce((sum, a) => sum - fromCents(a.balanceCents), 0);
     if (total === 0) return [];
killedBy: financeInsights getAssetDistribution returns sorted percentages for accounts
statusReason: expected -90 to be 90 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsights.ts:53:9
 export const getAssetDistribution = (accounts: import('../types').AnchorAccount[]): AssetClass[] => {
     const active = accounts.filter(a => !a.isArchived);
     const total = active.reduce((sum, a) => sum + fromCents(a.balanceCents), 0);
-    if (total === 0) return [];
+    if (total !== 0) return [];
 };
killedBy: financeInsights getAssetDistribution returns sorted percentages for accounts
statusReason: expected [] to have a length of 2 but got +0

[Killed] ConditionalExpression
src/utils/financeInsights.ts:53:9
 export const getAssetDistribution = (accounts: import('../types').AnchorAccount[]): AssetClass[] => {
     const active = accounts.filter(a => !a.isArchived);
     const total = active.reduce((sum, a) => sum + fromCents(a.balanceCents), 0);
-    if (total === 0) return [];
+    if (true) return [];
 };
killedBy: financeInsights getAssetDistribution returns sorted percentages for accounts
statusReason: expected [] to have a length of 2 but got +0

[Killed] ArithmeticOperator
src/utils/financeInsights.ts:59:66
 
 export const getExpenseCategoryBreakdown = (transactions: AnchorTransaction[]): CheckpointCategory[] => {
     const today = new Date();
-    const thirtyDaysAgo = new Date(today); thirtyDaysAgo.setDate(today.getDate() - 30);
+    const thirtyDaysAgo = new Date(today); thirtyDaysAgo.setDate(today.getDate() + 30);
     const categoryMap: Record<string, number> = {};
     let totalExpense = 0;
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Survived] MethodExpression
src/utils/financeInsights.ts:59:44
 
 export const getExpenseCategoryBreakdown = (transactions: AnchorTransaction[]): CheckpointCategory[] => {
     const today = new Date();
-    const thirtyDaysAgo = new Date(today); thirtyDaysAgo.setDate(today.getDate() - 30);
+    const thirtyDaysAgo = new Date(today); thirtyDaysAgo.setTime(today.getDate() - 30);
     const categoryMap: Record<string, number> = {};
     let totalExpense = 0;

[Killed] BlockStatement
src/utils/financeInsights.ts:63:31
     const categoryMap: Record<string, number> = {};
     let totalExpense = 0;
 
-    transactions.forEach(t => {
-        if (!t || !t.date || t.isSoftDeleted || t.type !== 'expense') return;
-        const d = new Date(t.date);
-        if (d >= thirtyDaysAgo && d <= today) {
-            const amount = fromCents(t.amountCents || 0);
-            const cat = t.category || 'Uncategorized';
-            categoryMap[cat] = (categoryMap[cat] || 0) + amount;
-            totalExpense += amount;
-        }
-    });
+    transactions.forEach(t => {});
 
     if (totalExpense === 0) return [];
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/utils/financeInsights.ts:64:49
     let totalExpense = 0;
 
     transactions.forEach(t => {
-        if (!t || !t.date || t.isSoftDeleted || t.type !== 'expense') return;
+        if (!t || !t.date || t.isSoftDeleted || t.type === 'expense') return;
         const d = new Date(t.date);
         if (d >= thirtyDaysAgo && d <= today) {
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] ConditionalExpression
src/utils/financeInsights.ts:64:49
     let totalExpense = 0;
 
     transactions.forEach(t => {
-        if (!t || !t.date || t.isSoftDeleted || t.type !== 'expense') return;
+        if (!t || !t.date || t.isSoftDeleted || false) return;
         const d = new Date(t.date);
         if (d >= thirtyDaysAgo && d <= today) {
killedBy: financeInsights getExpenseCategoryBreakdown returns empty when no expenses in 30-day window
statusReason: expected [ { category: 'Food', …(2) } ] to deeply equal []

[Killed] BlockStatement
src/utils/financeInsights.ts:66:47
     transactions.forEach(t => {
         if (!t || !t.date || t.isSoftDeleted || t.type !== 'expense') return;
         const d = new Date(t.date);
-        if (d >= thirtyDaysAgo && d <= today) {
-            const amount = fromCents(t.amountCents || 0);
-            const cat = t.category || 'Uncategorized';
-            categoryMap[cat] = (categoryMap[cat] || 0) + amount;
-            totalExpense += amount;
-        }
+        if (d >= thirtyDaysAgo && d <= today) {}
     });
 
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/utils/financeInsights.ts:66:35
     transactions.forEach(t => {
         if (!t || !t.date || t.isSoftDeleted || t.type !== 'expense') return;
         const d = new Date(t.date);
-        if (d >= thirtyDaysAgo && d <= today) {
+        if (d >= thirtyDaysAgo && d > today) {
             const amount = fromCents(t.amountCents || 0);
             const cat = t.category || 'Uncategorized';
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] LogicalOperator
src/utils/financeInsights.ts:67:38
         if (!t || !t.date || t.isSoftDeleted || t.type !== 'expense') return;
         const d = new Date(t.date);
         if (d >= thirtyDaysAgo && d <= today) {
-            const amount = fromCents(t.amountCents || 0);
+            const amount = fromCents(t.amountCents && 0);
             const cat = t.category || 'Uncategorized';
             categoryMap[cat] = (categoryMap[cat] || 0) + amount;
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] LogicalOperator
src/utils/financeInsights.ts:68:25
         const d = new Date(t.date);
         if (d >= thirtyDaysAgo && d <= today) {
             const amount = fromCents(t.amountCents || 0);
-            const cat = t.category || 'Uncategorized';
+            const cat = t.category && 'Uncategorized';
             categoryMap[cat] = (categoryMap[cat] || 0) + amount;
             totalExpense += amount;
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [ { category: 'Uncategorized', …(2) } ] to have a length of 3 but got 1

[Killed] ArithmeticOperator
src/utils/financeInsights.ts:69:32
         if (d >= thirtyDaysAgo && d <= today) {
             const amount = fromCents(t.amountCents || 0);
             const cat = t.category || 'Uncategorized';
-            categoryMap[cat] = (categoryMap[cat] || 0) + amount;
+            categoryMap[cat] = (categoryMap[cat] || 0) - amount;
             totalExpense += amount;
         }
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected 'Housing' to be 'Food' // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsights.ts:69:33
         if (d >= thirtyDaysAgo && d <= today) {
             const amount = fromCents(t.amountCents || 0);
             const cat = t.category || 'Uncategorized';
-            categoryMap[cat] = (categoryMap[cat] || 0) + amount;
+            categoryMap[cat] = (categoryMap[cat] && 0) + amount;
             totalExpense += amount;
         }
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected NaN to be 50 // Object.is equality

[Killed] AssignmentOperator
src/utils/financeInsights.ts:70:13
             const amount = fromCents(t.amountCents || 0);
             const cat = t.category || 'Uncategorized';
             categoryMap[cat] = (categoryMap[cat] || 0) + amount;
-            totalExpense += amount;
+            totalExpense -= amount;
         }
     });
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected -50 to be 50 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsights.ts:74:9
         }
     });
 
-    if (totalExpense === 0) return [];
+    if (true) return [];
     return Object.entries(categoryMap)
         .map(([category, amount]) => ({ category, amount, percent: (amount / totalExpense) * 100 }))
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] EqualityOperator
src/utils/financeInsights.ts:74:9
         }
     });
 
-    if (totalExpense === 0) return [];
+    if (totalExpense !== 0) return [];
     return Object.entries(categoryMap)
         .map(([category, amount]) => ({ category, amount, percent: (amount / totalExpense) * 100 }))
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected [] to have a length of 3 but got +0

[Killed] MethodExpression
src/utils/financeInsights.ts:75:12
     });
 
     if (totalExpense === 0) return [];
-    return Object.entries(categoryMap)
-        .map(([category, amount]) => ({ category, amount, percent: (amount / totalExpense) * 100 }))
-        .sort((a, b) => b.amount - a.amount)
-        .slice(0, 5);
+    return Object.entries(categoryMap).map(([category, amount]) => ({
+  category,
+  amount,
+  percent: amount / totalExpense * 100
+})).sort((a, b) => b.amount - a.amount);
 };
 
killedBy: financeInsights getExpenseCategoryBreakdown limits to 5 categories
statusReason: expected [ { category: 'A', …(2) }, …(6) ] to have a length of 5 but got 7

[Survived] MethodExpression
src/utils/financeInsights.ts:75:12
     });
 
     if (totalExpense === 0) return [];
-    return Object.entries(categoryMap)
-        .map(([category, amount]) => ({ category, amount, percent: (amount / totalExpense) * 100 }))
-        .sort((a, b) => b.amount - a.amount)
+    return Object.entries(categoryMap).map(([category, amount]) => ({
+  category,
+  amount,
+  percent: amount / totalExpense * 100
+}))
         .slice(0, 5);
 };

[Killed] ArithmeticOperator
src/utils/financeInsights.ts:76:68
 
     if (totalExpense === 0) return [];
     return Object.entries(categoryMap)
-        .map(([category, amount]) => ({ category, amount, percent: (amount / totalExpense) * 100 }))
+        .map(([category, amount]) => ({ category, amount, percent: amount / totalExpense / 100 }))
         .sort((a, b) => b.amount - a.amount)
         .slice(0, 5);
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected 0.005 to be 50 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsights.ts:76:69
 
     if (totalExpense === 0) return [];
     return Object.entries(categoryMap)
-        .map(([category, amount]) => ({ category, amount, percent: (amount / totalExpense) * 100 }))
+        .map(([category, amount]) => ({ category, amount, percent: (amount * totalExpense) * 100 }))
         .sort((a, b) => b.amount - a.amount)
         .slice(0, 5);
killedBy: financeInsights getExpenseCategoryBreakdown returns top 5 categories sorted by amount
statusReason: expected 50000000 to be 50 // Object.is equality

[Survived] ArithmeticOperator
src/utils/financeInsights.ts:77:25
     if (totalExpense === 0) return [];
     return Object.entries(categoryMap)
         .map(([category, amount]) => ({ category, amount, percent: (amount / totalExpense) * 100 }))
-        .sort((a, b) => b.amount - a.amount)
+        .sort((a, b) => b.amount + a.amount)
         .slice(0, 5);
 };
