[Killed] ConditionalExpression
src/utils/activityLogger.ts:34:9
     actorName,
     details,
 }: LogActivityParams): Promise<void> => {
-    if (!accountId || !accountOwnerId) return;
+    if (false) return;
 
     try {
killedBy: logAccountActivity returns early when accountId is empty
statusReason: expected "vi.fn()" to not be called at all, but actually been called 1 times

Received: 

  1st vi.fn() call:

    Array [
      Object {

[Killed] ConditionalExpression
src/utils/activityLogger.ts:34:9
     actorName,
     details,
 }: LogActivityParams): Promise<void> => {
-    if (!accountId || !accountOwnerId) return;
+    if (true) return;
 
     try {
killedBy: logAccountActivity writes activity to Firestore
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/utils/activityLogger.ts:36:9
 }: LogActivityParams): Promise<void> => {
     if (!accountId || !accountOwnerId) return;
 
-    try {
-        const activitiesRef = collection(
-            db,
-            'artifacts',
-            APP_ID,
-            'users',
-            accountOwnerId,
-            'accounts',
-            accountId,
-            'activity'
-        );
-
-        const activityData = createActivityEntry(
-            action,
-            accountId,
-            accountOwnerId,
-            actorId,
-            actorName,
-            details
-        );
-
-        await addDoc(activitiesRef, activityData);
-    } catch (err) {
+    try {} catch (err) {
         console.error('Failed to log activity:', err);
         // Non-blocking - don't throw
killedBy: logAccountActivity writes activity to Firestore
statusReason: expected "vi.fn()" to be called once, but got 0 times

[Killed] BlockStatement
src/utils/activityLogger.ts:58:19
         );
 
         await addDoc(activitiesRef, activityData);
-    } catch (err) {
-        console.error('Failed to log activity:', err);
-        // Non-blocking - don't throw
-    }
+    } catch (err) {}
 };
 
killedBy: logAccountActivity swallows errors (non-blocking)
statusReason: expected "error" to be called at least once
