[Killed] ConditionalExpression
src/services/TransferOperations.ts:31:9
     createdAt: string,
     isBackdated: boolean
 ): void {
-    if (!payload.destinationAccountId) {
+    if (false) {
         throw new AnchorError('Transfer missing destination account', 'VALIDATION');
     }
killedBy: TransferOperations processTransferTransaction throws VALIDATION error if destination account missing
statusReason: expected [Function] to throw error including 'Transfer missing destination account' but got 'Destination account not found'

[Killed] BlockStatement
src/services/TransferOperations.ts:31:40
     createdAt: string,
     isBackdated: boolean
 ): void {
-    if (!payload.destinationAccountId) {
-        throw new AnchorError('Transfer missing destination account', 'VALIDATION');
-    }
+    if (!payload.destinationAccountId) {}
 
     const destAccount = accounts.find(a => a.id === payload.destinationAccountId);
killedBy: TransferOperations processTransferTransaction throws VALIDATION error if destination account missing
statusReason: expected [Function] to throw error including 'Transfer missing destination account' but got 'Destination account not found'

[Killed] ConditionalExpression
src/services/TransferOperations.ts:35:44
         throw new AnchorError('Transfer missing destination account', 'VALIDATION');
     }
 
-    const destAccount = accounts.find(a => a.id === payload.destinationAccountId);
+    const destAccount = accounts.find(a => false);
     if (!destAccount) {
         throw new AnchorError('Destination account not found', 'VALIDATION');
killedBy: TransferOperations processTransferTransaction creates two linked transactions (source expense, dest income)
statusReason: Destination account not found

[Killed] ConditionalExpression
src/services/TransferOperations.ts:35:44
         throw new AnchorError('Transfer missing destination account', 'VALIDATION');
     }
 
-    const destAccount = accounts.find(a => a.id === payload.destinationAccountId);
+    const destAccount = accounts.find(a => true);
     if (!destAccount) {
         throw new AnchorError('Destination account not found', 'VALIDATION');
killedBy: TransferOperations processTransferTransaction throws VALIDATION error if destination account not found
statusReason: expected function to throw an error, but it didn't

[Killed] StringLiteral
src/services/TransferOperations.ts:37:31
 
     const destAccount = accounts.find(a => a.id === payload.destinationAccountId);
     if (!destAccount) {
-        throw new AnchorError('Destination account not found', 'VALIDATION');
+        throw new AnchorError("", 'VALIDATION');
     }
 
killedBy: TransferOperations processTransferTransaction throws VALIDATION error if destination account not found
statusReason: expected [Function] to throw error including 'Destination account not found' but got ''

[Killed] BooleanLiteral
src/services/TransferOperations.ts:40:9
         throw new AnchorError('Destination account not found', 'VALIDATION');
     }
 
-    if (!canAddTransaction(destAccount, userId)) {
+    if (canAddTransaction(destAccount, userId)) {
         throw new AnchorError(
             `Permission denied: You cannot add transactions to ${destAccount.name}.`,
killedBy: TransferOperations processTransferTransaction creates two linked transactions (source expense, dest income)
statusReason: Permission denied: You cannot add transactions to Savings.

[Killed] BlockStatement
src/services/TransferOperations.ts:40:50
         throw new AnchorError('Destination account not found', 'VALIDATION');
     }
 
-    if (!canAddTransaction(destAccount, userId)) {
-        throw new AnchorError(
-            `Permission denied: You cannot add transactions to ${destAccount.name}.`,
-            'PERMISSION'
-        );
-    }
+    if (!canAddTransaction(destAccount, userId)) {}
 
     const linkId = crypto.randomUUID().slice(0, 12);
killedBy: TransferOperations processTransferTransaction throws PERMISSION error if user lacks rights to dest account
statusReason: expected function to throw an error, but it didn't

[Survived] MethodExpression
src/services/TransferOperations.ts:47:20
         );
     }
 
-    const linkId = crypto.randomUUID().slice(0, 12);
+    const linkId = crypto.randomUUID();
     const sourceTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
     const destTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', destAccount.ownerId || userId, 'finance'));

[Survived] StringLiteral
src/services/TransferOperations.ts:48:51
     }
 
     const linkId = crypto.randomUUID().slice(0, 12);
-    const sourceTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
+    const sourceTxRef = doc(collection(firestore, "", APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
     const destTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', destAccount.ownerId || userId, 'finance'));
 

[Survived] StringLiteral
src/services/TransferOperations.ts:48:114
     }
 
     const linkId = crypto.randomUUID().slice(0, 12);
-    const sourceTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
+    const sourceTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, ""));
     const destTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', destAccount.ownerId || userId, 'finance'));
 

[Survived] StringLiteral
src/services/TransferOperations.ts:49:70
 
     const linkId = crypto.randomUUID().slice(0, 12);
     const sourceTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
-    const destTxRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', destAccount.ownerId || userId, 'finance'));
+    const destTxRef = doc(collection(firestore, 'artifacts', APP_ID, "", destAccount.ownerId || userId, 'finance'));
 
     const destAmount = payload.destinationAmountCents ?? payload.amountCents;

[Killed] ObjectLiteral
src/services/TransferOperations.ts:54:28
     const destAmount = payload.destinationAmountCents ?? payload.amountCents;
 
     // Record 1: Source (expense - money leaving)
-    batch.set(sourceTxRef, {
-        ...payload,
-        id: sourceTxRef.id,
-        date: transactionDate,
-        createdAt,
-        isBackdated,
-        type: 'expense',
-        category: 'Transfer',
-        title: `Transfer to ${destAccount.name}`,
-        accountName: sourceAccount.name,
-        currency: sourceAccount.currency,
-        createdBy: userId,
-        isSoftDeleted: false,
-        accountOwnerId: sourceAccount.ownerId || userId,
-        accountShares: sourceAccount.shares || {},
-        linkId,
-        linkedTransactionId: destTxRef.id,
-        linkedUserId: destAccount.ownerId || userId
-    });
+    batch.set(sourceTxRef, {});
 
     // Record 2: Destination (income - money arriving)
killedBy: TransferOperations processTransferTransaction creates two linked transactions (source expense, dest income)
statusReason: expected 1st "vi.fn()" call to have been called with [ Anything, ObjectContaining{…} ]

[Killed] StringLiteral
src/services/TransferOperations.ts:60:15
         date: transactionDate,
         createdAt,
         isBackdated,
-        type: 'expense',
+        type: "",
         category: 'Transfer',
         title: `Transfer to ${destAccount.name}`,
killedBy: TransferOperations processTransferTransaction creates two linked transactions (source expense, dest income)
statusReason: expected 1st "vi.fn()" call to have been called with [ Anything, ObjectContaining{…} ]

[Survived] BooleanLiteral
src/services/TransferOperations.ts:66:24
         accountName: sourceAccount.name,
         currency: sourceAccount.currency,
         createdBy: userId,
-        isSoftDeleted: false,
+        isSoftDeleted: true,
         accountOwnerId: sourceAccount.ownerId || userId,
         accountShares: sourceAccount.shares || {},

[Killed] LogicalOperator
src/services/TransferOperations.ts:67:25
         currency: sourceAccount.currency,
         createdBy: userId,
         isSoftDeleted: false,
-        accountOwnerId: sourceAccount.ownerId || userId,
+        accountOwnerId: sourceAccount.ownerId && userId,
         accountShares: sourceAccount.shares || {},
         linkId,
killedBy: TransferOperations processTransferTransaction preserves account ownership in accountOwnerId field
statusReason: expected 'user-preserve' to be 'owner-1' // Object.is equality

[Killed] ConditionalExpression
src/services/TransferOperations.ts:67:25
         currency: sourceAccount.currency,
         createdBy: userId,
         isSoftDeleted: false,
-        accountOwnerId: sourceAccount.ownerId || userId,
+        accountOwnerId: true,
         accountShares: sourceAccount.shares || {},
         linkId,
killedBy: TransferOperations processTransferTransaction preserves account ownership in accountOwnerId field
statusReason: expected true to be 'owner-1' // Object.is equality

[Survived] ConditionalExpression
src/services/TransferOperations.ts:68:24
         createdBy: userId,
         isSoftDeleted: false,
         accountOwnerId: sourceAccount.ownerId || userId,
-        accountShares: sourceAccount.shares || {},
+        accountShares: false,
         linkId,
         linkedTransactionId: destTxRef.id,

[Survived] LogicalOperator
src/services/TransferOperations.ts:68:24
         createdBy: userId,
         isSoftDeleted: false,
         accountOwnerId: sourceAccount.ownerId || userId,
-        accountShares: sourceAccount.shares || {},
+        accountShares: sourceAccount.shares && {},
         linkId,
         linkedTransactionId: destTxRef.id,

[Survived] ConditionalExpression
src/services/TransferOperations.ts:71:23
         accountShares: sourceAccount.shares || {},
         linkId,
         linkedTransactionId: destTxRef.id,
-        linkedUserId: destAccount.ownerId || userId
+        linkedUserId: false
     });
 

[Survived] LogicalOperator
src/services/TransferOperations.ts:71:23
         accountShares: sourceAccount.shares || {},
         linkId,
         linkedTransactionId: destTxRef.id,
-        linkedUserId: destAccount.ownerId || userId
+        linkedUserId: destAccount.ownerId && userId
     });
 

[Killed] ObjectLiteral
src/services/TransferOperations.ts:75:26
     });
 
     // Record 2: Destination (income - money arriving)
-    batch.set(destTxRef, {
-        ...payload,
-        id: destTxRef.id,
-        amountCents: destAmount, // Use converted amount
-        date: transactionDate,
-        createdAt,
-        isBackdated,
-        type: 'income',
-        category: 'Transfer',
-        title: `Transfer from ${sourceAccount.name}`,
-        accountId: destAccount.id,
-        accountName: destAccount.name,
-        currency: destAccount.currency,
-        createdBy: userId,
-        isSoftDeleted: false,
-        accountOwnerId: destAccount.ownerId || userId,
-        accountShares: destAccount.shares || {},
-        linkId,
-        linkedTransactionId: sourceTxRef.id,
-        linkedUserId: sourceAccount.ownerId || userId
-    });
+    batch.set(destTxRef, {});
 
     // Update balances
killedBy: TransferOperations processTransferTransaction creates two linked transactions (source expense, dest income)
statusReason: expected 2nd "vi.fn()" call to have been called with [ Anything, ObjectContaining{…} ]

[Killed] StringLiteral
src/services/TransferOperations.ts:83:19
         createdAt,
         isBackdated,
         type: 'income',
-        category: 'Transfer',
+        category: "",
         title: `Transfer from ${sourceAccount.name}`,
         accountId: destAccount.id,
killedBy: TransferOperations processTransferTransaction creates two linked transactions (source expense, dest income)
statusReason: expected 2nd "vi.fn()" call to have been called with [ Anything, ObjectContaining{…} ]

[Killed] ConditionalExpression
src/services/TransferOperations.ts:90:25
         currency: destAccount.currency,
         createdBy: userId,
         isSoftDeleted: false,
-        accountOwnerId: destAccount.ownerId || userId,
+        accountOwnerId: false,
         accountShares: destAccount.shares || {},
         linkId,
killedBy: TransferOperations processTransferTransaction preserves account ownership in accountOwnerId field
statusReason: expected false to be 'owner-2' // Object.is equality

[Killed] ConditionalExpression
src/services/TransferOperations.ts:90:25
         currency: destAccount.currency,
         createdBy: userId,
         isSoftDeleted: false,
-        accountOwnerId: destAccount.ownerId || userId,
+        accountOwnerId: true,
         accountShares: destAccount.shares || {},
         linkId,
killedBy: TransferOperations processTransferTransaction preserves account ownership in accountOwnerId field
statusReason: expected true to be 'owner-2' // Object.is equality

[Survived] LogicalOperator
src/services/TransferOperations.ts:91:24
         createdBy: userId,
         isSoftDeleted: false,
         accountOwnerId: destAccount.ownerId || userId,
-        accountShares: destAccount.shares || {},
+        accountShares: destAccount.shares && {},
         linkId,
         linkedTransactionId: sourceTxRef.id,

[Survived] ConditionalExpression
src/services/TransferOperations.ts:91:24
         createdBy: userId,
         isSoftDeleted: false,
         accountOwnerId: destAccount.ownerId || userId,
-        accountShares: destAccount.shares || {},
+        accountShares: true,
         linkId,
         linkedTransactionId: sourceTxRef.id,

[Survived] ConditionalExpression
src/services/TransferOperations.ts:94:23
         accountShares: destAccount.shares || {},
         linkId,
         linkedTransactionId: sourceTxRef.id,
-        linkedUserId: sourceAccount.ownerId || userId
+        linkedUserId: false
     });
 

[Survived] ConditionalExpression
src/services/TransferOperations.ts:94:23
         accountShares: destAccount.shares || {},
         linkId,
         linkedTransactionId: sourceTxRef.id,
-        linkedUserId: sourceAccount.ownerId || userId
+        linkedUserId: true
     });
 

[Survived] StringLiteral
src/services/TransferOperations.ts:98:104
     });
 
     // Update balances
-    const sourceAccRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
+    const sourceAccRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, "", sourceAccount.id);
     const destAccRef = doc(firestore, 'artifacts', APP_ID, 'users', destAccount.ownerId || userId, 'accounts', destAccount.id);
     batch.update(sourceAccRef, { balanceCents: increment(-payload.amountCents) });

[Survived] StringLiteral
src/services/TransferOperations.ts:99:60
 
     // Update balances
     const sourceAccRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
-    const destAccRef = doc(firestore, 'artifacts', APP_ID, 'users', destAccount.ownerId || userId, 'accounts', destAccount.id);
+    const destAccRef = doc(firestore, 'artifacts', APP_ID, "", destAccount.ownerId || userId, 'accounts', destAccount.id);
     batch.update(sourceAccRef, { balanceCents: increment(-payload.amountCents) });
     batch.update(destAccRef, { balanceCents: increment(destAmount) });

[Killed] UnaryOperator
src/services/TransferOperations.ts:100:58
     // Update balances
     const sourceAccRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
     const destAccRef = doc(firestore, 'artifacts', APP_ID, 'users', destAccount.ownerId || userId, 'accounts', destAccount.id);
-    batch.update(sourceAccRef, { balanceCents: increment(-payload.amountCents) });
+    batch.update(sourceAccRef, { balanceCents: increment(+payload.amountCents) });
     batch.update(destAccRef, { balanceCents: increment(destAmount) });
 }
killedBy: TransferOperations processTransferTransaction decreases source account balance
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, { …(1) } ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Killed] BlockStatement
src/services/TransferOperations.ts:116:9
     transactionDate: string,
     createdAt: string,
     isBackdated: boolean
-): void {
-    // Exclude destinationAccountId (only for transfers) - explicitly omit with rest
-    const { destinationAccountId: _ignored, ...transactionData } = payload;
-    void _ignored; // Explicitly discard to satisfy linter
-    const txRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
-
-    batch.set(txRef, {
-        ...transactionData,
-        id: txRef.id,
-        date: transactionDate,
-        createdAt,
-        isBackdated,
-        accountName: sourceAccount.name,
-        currency: sourceAccount.currency,
-        createdBy: userId,
-        isSoftDeleted: false,
-        accountOwnerId: sourceAccount.ownerId || userId,
-        accountShares: sourceAccount.shares || {},
-    });
-
-    const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
-    batch.update(accRef, {
-        balanceCents: increment(payload.type === 'income' ? payload.amountCents : -payload.amountCents)
-    });
-}
+): void {}
 
killedBy: useFinanceService Transaction Management should add income transaction and update account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Number of calls: 0

[Survived] StringLiteral
src/services/TransferOperations.ts:120:45
     // Exclude destinationAccountId (only for transfers) - explicitly omit with rest
     const { destinationAccountId: _ignored, ...transactionData } = payload;
     void _ignored; // Explicitly discard to satisfy linter
-    const txRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
+    const txRef = doc(collection(firestore, "", APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
 
     batch.set(txRef, {

[Killed] ObjectLiteral
src/services/TransferOperations.ts:122:22
     void _ignored; // Explicitly discard to satisfy linter
     const txRef = doc(collection(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'finance'));
 
-    batch.set(txRef, {
-        ...transactionData,
-        id: txRef.id,
-        date: transactionDate,
-        createdAt,
-        isBackdated,
-        accountName: sourceAccount.name,
-        currency: sourceAccount.currency,
-        createdBy: userId,
-        isSoftDeleted: false,
-        accountOwnerId: sourceAccount.ownerId || userId,
-        accountShares: sourceAccount.shares || {},
-    });
+    batch.set(txRef, {});
 
     const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
killedBy: useFinanceService Transaction Management should add income transaction and update account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Survived] StringLiteral
src/services/TransferOperations.ts:136:98
         accountShares: sourceAccount.shares || {},
     });
 
-    const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
+    const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, "", sourceAccount.id);
     batch.update(accRef, {
         balanceCents: increment(payload.type === 'income' ? payload.amountCents : -payload.amountCents)

[Survived] StringLiteral
src/services/TransferOperations.ts:136:56
         accountShares: sourceAccount.shares || {},
     });
 
-    const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
+    const accRef = doc(firestore, 'artifacts', APP_ID, "", sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
     batch.update(accRef, {
         balanceCents: increment(payload.type === 'income' ? payload.amountCents : -payload.amountCents)

[Killed] ObjectLiteral
src/services/TransferOperations.ts:137:26
     });
 
     const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
-    batch.update(accRef, {
-        balanceCents: increment(payload.type === 'income' ? payload.amountCents : -payload.amountCents)
-    });
+    batch.update(accRef, {});
 }
 
killedBy: useFinanceService Transaction Management should add income transaction and update account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Killed] ConditionalExpression
src/services/TransferOperations.ts:138:33
 
     const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
     batch.update(accRef, {
-        balanceCents: increment(payload.type === 'income' ? payload.amountCents : -payload.amountCents)
+        balanceCents: increment(false ? payload.amountCents : -payload.amountCents)
     });
 }
killedBy: useFinanceService Transaction Management should add income transaction and update account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Anything,

[Killed] ConditionalExpression
src/services/TransferOperations.ts:138:33
 
     const accRef = doc(firestore, 'artifacts', APP_ID, 'users', sourceAccount.ownerId || userId, 'accounts', sourceAccount.id);
     batch.update(accRef, {
-        balanceCents: increment(payload.type === 'income' ? payload.amountCents : -payload.amountCents)
+        balanceCents: increment(true ? payload.amountCents : -payload.amountCents)
     });
 }
killedBy: useFinanceService Transaction Management should add expense transaction and update account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Anything,
