[Killed] BooleanLiteral
src/utils/rateLimit.ts:43:29
             firstAttemptTime: now,
             lockedUntil: null
         });
-        return { isLimited: false, attemptsRemaining: config.maxAttempts - 1 };
+        return { isLimited: true, attemptsRemaining: config.maxAttempts - 1 };
     }
 
killedBy: useCommitmentService Task Management Functions should add a task
statusReason: Too many commitments created. Please try again in 0 seconds.

[Killed] ArithmeticOperator
src/utils/rateLimit.ts:43:55
             firstAttemptTime: now,
             lockedUntil: null
         });
-        return { isLimited: false, attemptsRemaining: config.maxAttempts - 1 };
+        return { isLimited: false, attemptsRemaining: config.maxAttempts + 1 };
     }
 
killedBy: rateLimit checkRateLimit allows first attempt and tracks remaining
statusReason: expected 4 to be 2 // Object.is equality

[Killed] ConditionalExpression
src/utils/rateLimit.ts:47:30
     }
 
     // Check if locked out
-    if (state.lockedUntil && now < state.lockedUntil) {
+    if (state.lockedUntil && true) {
         return {
             isLimited: true,
killedBy: rateLimit checkRateLimit resets attempts after lockout expires
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/utils/rateLimit.ts:47:30
     }
 
     // Check if locked out
-    if (state.lockedUntil && now < state.lockedUntil) {
+    if (state.lockedUntil && now >= state.lockedUntil) {
         return {
             isLimited: true,
killedBy: rateLimit checkRateLimit resets attempts after lockout expires
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/rateLimit.ts:49:24
     // Check if locked out
     if (state.lockedUntil && now < state.lockedUntil) {
         return {
-            isLimited: true,
+            isLimited: false,
             retryAfterMs: state.lockedUntil - now
         };
killedBy: rateLimit checkRateLimit stays locked during lockout period
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/utils/rateLimit.ts:50:27
     if (state.lockedUntil && now < state.lockedUntil) {
         return {
             isLimited: true,
-            retryAfterMs: state.lockedUntil - now
+            retryAfterMs: state.lockedUntil + now
         };
     }

[Killed] ConditionalExpression
src/utils/rateLimit.ts:55:9
     }
 
     // Lockout elapsed: treat next attempt as a fresh window.
-    if (state.lockedUntil && now >= state.lockedUntil) {
+    if (false) {
         rateLimitStates.set(key, {
             attempts: 1,
killedBy: rateLimit checkRateLimit resets attempts after lockout expires
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/utils/rateLimit.ts:55:56
     }
 
     // Lockout elapsed: treat next attempt as a fresh window.
-    if (state.lockedUntil && now >= state.lockedUntil) {
-        rateLimitStates.set(key, {
-            attempts: 1,
-            firstAttemptTime: now,
-            lockedUntil: null
-        });
-        return { isLimited: false, attemptsRemaining: config.maxAttempts - 1 };
-    }
+    if (state.lockedUntil && now >= state.lockedUntil) {}
 
     // Check if window has expired
killedBy: rateLimit checkRateLimit resets attempts after lockout expires
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/rateLimit.ts:65:9
     }
 
     // Check if window has expired
-    if (now - state.firstAttemptTime > config.windowMs) {
+    if (false) {
         // Reset the window
         rateLimitStates.set(key, {
killedBy: rateLimit checkRateLimit resets after window expires
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/rateLimit.ts:65:57
     }
 
     // Check if window has expired
-    if (now - state.firstAttemptTime > config.windowMs) {
-        // Reset the window
-        rateLimitStates.set(key, {
-            attempts: 1,
-            firstAttemptTime: now,
-            lockedUntil: null
-        });
-        return { isLimited: false, attemptsRemaining: config.maxAttempts - 1 };
-    }
+    if (now - state.firstAttemptTime > config.windowMs) {}
 
     // Check if max attempts exceeded
killedBy: rateLimit checkRateLimit resets after window expires
statusReason: expected 1 to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/rateLimit.ts:76:47
     }
 
     // Check if max attempts exceeded
-    if (state.attempts >= config.maxAttempts) {
-        const lockoutMs = config.lockoutMs || config.windowMs;
-        const lockedUntil = now + lockoutMs;
-        rateLimitStates.set(key, { ...state, lockedUntil });
-        return {
-            isLimited: true,
-            retryAfterMs: lockoutMs
-        };
-    }
+    if (state.attempts >= config.maxAttempts) {}
 
     // Increment attempts
killedBy: rateLimit checkRateLimit triggers lockout after max attempts
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/utils/rateLimit.ts:76:9
     }
 
     // Check if max attempts exceeded
-    if (state.attempts >= config.maxAttempts) {
+    if (state.attempts < config.maxAttempts) {
         const lockoutMs = config.lockoutMs || config.windowMs;
         const lockedUntil = now + lockoutMs;
killedBy: rateLimit checkRateLimit decrements remaining attempts on subsequent calls
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/utils/rateLimit.ts:78:29
     // Check if max attempts exceeded
     if (state.attempts >= config.maxAttempts) {
         const lockoutMs = config.lockoutMs || config.windowMs;
-        const lockedUntil = now + lockoutMs;
+        const lockedUntil = now - lockoutMs;
         rateLimitStates.set(key, { ...state, lockedUntil });
         return {
killedBy: rateLimit checkRateLimit stays locked during lockout period
statusReason: expected false to be true // Object.is equality

[Killed] UpdateOperator
src/utils/rateLimit.ts:87:5
     }
 
     // Increment attempts
-    state.attempts++;
+    state.attempts--;
     return {
         isLimited: false,
killedBy: rateLimit checkRateLimit decrements remaining attempts on subsequent calls
statusReason: expected 3 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/utils/rateLimit.ts:89:20
     // Increment attempts
     state.attempts++;
     return {
-        isLimited: false,
+        isLimited: true,
         attemptsRemaining: config.maxAttempts - state.attempts
     };
killedBy: rateLimit checkRateLimit decrements remaining attempts on subsequent calls
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
src/utils/rateLimit.ts:90:28
     state.attempts++;
     return {
         isLimited: false,
-        attemptsRemaining: config.maxAttempts - state.attempts
+        attemptsRemaining: config.maxAttempts + state.attempts
     };
 }
killedBy: rateLimit checkRateLimit decrements remaining attempts on subsequent calls
statusReason: expected 5 to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/rateLimit.ts:97:51
 /**
  * Reset rate limit for a key (call on successful operation)
  */
-export function resetRateLimit(key: string): void {
-    rateLimitStates.delete(key);
-}
+export function resetRateLimit(key: string): void {}
 
 /**
killedBy: rateLimit checkRateLimit decrements remaining attempts on subsequent calls
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/utils/rateLimit.ts:105:31
  * Format retry time for user display
  */
 export function formatRetryTime(ms: number): string {
-    const seconds = Math.ceil(ms / 1000);
+    const seconds = Math.ceil(ms * 1000);
     if (seconds < 60) {
         return `${seconds} second${seconds !== 1 ? 's' : ''}`;
killedBy: rateLimit formatRetryTime formats seconds (singular)
statusReason: expected '16667 minutes' to be '1 second' // Object.is equality

[Killed] ConditionalExpression
src/utils/rateLimit.ts:106:9
  */
 export function formatRetryTime(ms: number): string {
     const seconds = Math.ceil(ms / 1000);
-    if (seconds < 60) {
+    if (false) {
         return `${seconds} second${seconds !== 1 ? 's' : ''}`;
     }
killedBy: rateLimit formatRetryTime formats seconds (singular)
statusReason: expected '1 minute' to be '1 second' // Object.is equality

[Killed] EqualityOperator
src/utils/rateLimit.ts:106:9
  */
 export function formatRetryTime(ms: number): string {
     const seconds = Math.ceil(ms / 1000);
-    if (seconds < 60) {
+    if (seconds >= 60) {
         return `${seconds} second${seconds !== 1 ? 's' : ''}`;
     }
killedBy: rateLimit formatRetryTime formats seconds (singular)
statusReason: expected '1 minute' to be '1 second' // Object.is equality

[Killed] EqualityOperator
src/utils/rateLimit.ts:107:36
 export function formatRetryTime(ms: number): string {
     const seconds = Math.ceil(ms / 1000);
     if (seconds < 60) {
-        return `${seconds} second${seconds !== 1 ? 's' : ''}`;
+        return `${seconds} second${seconds === 1 ? 's' : ''}`;
     }
     const minutes = Math.ceil(seconds / 60);
killedBy: rateLimit formatRetryTime formats seconds (singular)
statusReason: expected '1 seconds' to be '1 second' // Object.is equality

[Killed] ConditionalExpression
src/utils/rateLimit.ts:107:36
 export function formatRetryTime(ms: number): string {
     const seconds = Math.ceil(ms / 1000);
     if (seconds < 60) {
-        return `${seconds} second${seconds !== 1 ? 's' : ''}`;
+        return `${seconds} second${false ? 's' : ''}`;
     }
     const minutes = Math.ceil(seconds / 60);
killedBy: rateLimit formatRetryTime formats seconds (plural)
statusReason: expected '5 second' to be '5 seconds' // Object.is equality

[Killed] ArithmeticOperator
src/utils/rateLimit.ts:109:31
     if (seconds < 60) {
         return `${seconds} second${seconds !== 1 ? 's' : ''}`;
     }
-    const minutes = Math.ceil(seconds / 60);
+    const minutes = Math.ceil(seconds * 60);
     return `${minutes} minute${minutes !== 1 ? 's' : ''}`;
 }
killedBy: rateLimit formatRetryTime formats minutes (singular)
statusReason: expected '3600 minutes' to be '1 minute' // Object.is equality

[Killed] ConditionalExpression
src/utils/rateLimit.ts:110:32
         return `${seconds} second${seconds !== 1 ? 's' : ''}`;
     }
     const minutes = Math.ceil(seconds / 60);
-    return `${minutes} minute${minutes !== 1 ? 's' : ''}`;
+    return `${minutes} minute${false ? 's' : ''}`;
 }
 
killedBy: rateLimit formatRetryTime formats minutes (plural)
statusReason: expected '2 minute' to be '2 minutes' // Object.is equality

[Killed] EqualityOperator
src/utils/rateLimit.ts:110:32
         return `${seconds} second${seconds !== 1 ? 's' : ''}`;
     }
     const minutes = Math.ceil(seconds / 60);
-    return `${minutes} minute${minutes !== 1 ? 's' : ''}`;
+    return `${minutes} minute${minutes === 1 ? 's' : ''}`;
 }
 
killedBy: rateLimit formatRetryTime formats minutes (singular)
statusReason: expected '1 minutes' to be '1 minute' // Object.is equality
