[Survived] ConditionalExpression
src/utils/financeInsightsWeekly.ts:15:42
 const getStartOfWeek = (d: Date) => {
     const date = new Date(d);
     const day = date.getDay();
-    const diff = date.getDate() - day + (day === 0 ? -6 : 1);
+    const diff = date.getDate() - day + (true ? -6 : 1);
     date.setDate(diff);
     date.setHours(0, 0, 0, 0);

[Survived] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:15:18
 const getStartOfWeek = (d: Date) => {
     const date = new Date(d);
     const day = date.getDay();
-    const diff = date.getDate() - day + (day === 0 ? -6 : 1);
+    const diff = date.getDate() + day + (day === 0 ? -6 : 1);
     date.setDate(diff);
     date.setHours(0, 0, 0, 0);

[Killed] MethodExpression
src/utils/financeInsightsWeekly.ts:16:5
     const date = new Date(d);
     const day = date.getDay();
     const diff = date.getDate() - day + (day === 0 ? -6 : 1);
-    date.setDate(diff);
+    date.setTime(diff);
     date.setHours(0, 0, 0, 0);
     return date;
killedBy: AccountDetailsView filters transactions by search query
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:34:50
     
     // Use start and end of the reference month
     const monthStart = new Date(ref.getFullYear(), ref.getMonth(), 1);
-    const monthEnd = new Date(ref.getFullYear(), ref.getMonth() + 1, 0, 23, 59, 59, 999);
+    const monthEnd = new Date(ref.getFullYear(), ref.getMonth() - 1, 0, 23, 59, 59, 999);
     
     // Generate weeks that cover the month
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected undefined to be 5000 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:40:12
     let weekStart = getStartOfWeek(monthStart);
     const today = new Date();
     
-    while (weekStart <= monthEnd) {
+    while (weekStart > monthEnd) {
         const weekEnd = new Date(weekStart);
         weekEnd.setDate(weekEnd.getDate() + 6);
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected undefined to be 5000 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:40:12
     let weekStart = getStartOfWeek(monthStart);
     const today = new Date();
     
-    while (weekStart <= monthEnd) {
+    while (false) {
         const weekEnd = new Date(weekStart);
         weekEnd.setDate(weekEnd.getDate() + 6);
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected undefined to be 5000 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:42:25
     
     while (weekStart <= monthEnd) {
         const weekEnd = new Date(weekStart);
-        weekEnd.setDate(weekEnd.getDate() + 6);
+        weekEnd.setDate(weekEnd.getDate() - 6);
         weekEnd.setHours(23, 59, 59, 999);
 
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected undefined to be 5000 // Object.is equality

[Killed] MethodExpression
src/utils/financeInsightsWeekly.ts:42:9
     
     while (weekStart <= monthEnd) {
         const weekEnd = new Date(weekStart);
-        weekEnd.setDate(weekEnd.getDate() + 6);
+        weekEnd.setTime(weekEnd.getDate() + 6);
         weekEnd.setHours(23, 59, 59, 999);
 
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected undefined to be 5000 // Object.is equality

[Killed] MethodExpression
src/utils/financeInsightsWeekly.ts:45:25
         weekEnd.setDate(weekEnd.getDate() + 6);
         weekEnd.setHours(23, 59, 59, 999);
 
-        const weekTxs = transactions.filter(t => {
-            if (!t || !t.date) return false;
-            const date = new Date(t.date);
-            return date >= weekStart && date <= weekEnd;
-        });
+        const weekTxs = transactions;
 
         const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
killedBy: financeInsights getWeeklySpending skips transactions with no date
statusReason: expected 100 to be +0 // Object.is equality

[Killed] BlockStatement
src/utils/financeInsightsWeekly.ts:45:50
         weekEnd.setDate(weekEnd.getDate() + 6);
         weekEnd.setHours(23, 59, 59, 999);
 
-        const weekTxs = transactions.filter(t => {
-            if (!t || !t.date) return false;
-            const date = new Date(t.date);
-            return date >= weekStart && date <= weekEnd;
-        });
+        const weekTxs = transactions.filter(t => {});
 
         const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:46:17
         weekEnd.setHours(23, 59, 59, 999);
 
         const weekTxs = transactions.filter(t => {
-            if (!t || !t.date) return false;
+            if (false) return false;
             const date = new Date(t.date);
             return date >= weekStart && date <= weekEnd;
killedBy: financeInsights getWeeklySpending skips null transactions in array
statusReason: Cannot read properties of null (reading 'date')

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:46:17
         weekEnd.setHours(23, 59, 59, 999);
 
         const weekTxs = transactions.filter(t => {
-            if (!t || !t.date) return false;
+            if (true) return false;
             const date = new Date(t.date);
             return date >= weekStart && date <= weekEnd;
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:48:41
         const weekTxs = transactions.filter(t => {
             if (!t || !t.date) return false;
             const date = new Date(t.date);
-            return date >= weekStart && date <= weekEnd;
+            return date >= weekStart && date > weekEnd;
         });
 
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:48:20
         const weekTxs = transactions.filter(t => {
             if (!t || !t.date) return false;
             const date = new Date(t.date);
-            return date >= weekStart && date <= weekEnd;
+            return false;
         });
 
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsightsWeekly.ts:51:105
             return date >= weekStart && date <= weekEnd;
         });
 
-        const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
+        const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents && 0), 0);
         const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:51:49
             return date >= weekStart && date <= weekEnd;
         });
 
-        const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
+        const income = weekTxs.filter(t => t && true).reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected 5015.99 to be 5000 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:52:50
         });
 
         const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
-        const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
+        const expense = weekTxs.filter(t => t && t.type !== 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
         const isCurrentWeek = today >= weekStart && today <= weekEnd;
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected 5000 to be 15.99 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:52:45
         });
 
         const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
-        const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
+        const expense = weekTxs.filter(t => false).reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
         const isCurrentWeek = today >= weekStart && today <= weekEnd;
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 15.99 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:54:53
         const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
-        const isCurrentWeek = today >= weekStart && today <= weekEnd;
+        const isCurrentWeek = today >= weekStart && true;
         const label = isCurrentWeek && !referenceDate ? 'This Week' : formatDateLabel(weekStart);
         
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:54:53
         const income = weekTxs.filter(t => t && t.type === 'income').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
-        const isCurrentWeek = today >= weekStart && today <= weekEnd;
+        const isCurrentWeek = today >= weekStart && today > weekEnd;
         const label = isCurrentWeek && !referenceDate ? 'This Week' : formatDateLabel(weekStart);
         
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsightsWeekly.ts:55:23
         const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
         const isCurrentWeek = today >= weekStart && today <= weekEnd;
-        const label = isCurrentWeek && !referenceDate ? 'This Week' : formatDateLabel(weekStart);
+        const label = isCurrentWeek || !referenceDate ? 'This Week' : formatDateLabel(weekStart);
         
         weeks.push({ label, income, expense, net: income - expense, weekStart: new Date(weekStart) });
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected +0 to be 5000 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:55:23
         const expense = weekTxs.filter(t => t && t.type === 'expense').reduce((sum, t) => sum + fromCents(t.amountCents || 0), 0);
         
         const isCurrentWeek = today >= weekStart && today <= weekEnd;
-        const label = isCurrentWeek && !referenceDate ? 'This Week' : formatDateLabel(weekStart);
+        const label = false ? 'This Week' : formatDateLabel(weekStart);
         
         weeks.push({ label, income, expense, net: income - expense, weekStart: new Date(weekStart) });
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected undefined to be 5000 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:57:51
         const isCurrentWeek = today >= weekStart && today <= weekEnd;
         const label = isCurrentWeek && !referenceDate ? 'This Week' : formatDateLabel(weekStart);
         
-        weeks.push({ label, income, expense, net: income - expense, weekStart: new Date(weekStart) });
+        weeks.push({ label, income, expense, net: income + expense, weekStart: new Date(weekStart) });
         
         weekStart = new Date(weekStart);
killedBy: financeInsights getWeeklySpending calculates income and expense for the current week
statusReason: expected 5015.99 to be 4984.01 // Object.is equality

[Timeout] MethodExpression
src/utils/financeInsightsWeekly.ts:60:9
         weeks.push({ label, income, expense, net: income - expense, weekStart: new Date(weekStart) });
         
         weekStart = new Date(weekStart);
-        weekStart.setDate(weekStart.getDate() + 7);
+        weekStart.setTime(weekStart.getDate() + 7);
     }
     

[Timeout] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:60:27
         weeks.push({ label, income, expense, net: income - expense, weekStart: new Date(weekStart) });
         
         weekStart = new Date(weekStart);
-        weekStart.setDate(weekStart.getDate() + 7);
+        weekStart.setDate(weekStart.getDate() - 7);
     }
     

[Killed] BlockStatement
src/utils/financeInsightsWeekly.ts:68:31
 
 export const detectRecurring = (transactions: AnchorTransaction[]): RecurringTransactionGroup[] => {
     const groups: Record<string, AnchorTransaction[]> = {};
-    transactions.forEach(t => {
-        if (!t || t.type !== 'expense' || !t.title) return;
-        const key = `${t.title.trim().toLowerCase()}-${t.amountCents || 0}`;
-        if (!groups[key]) groups[key] = [];
-        groups[key].push(t);
-    });
+    transactions.forEach(t => {});
 
     const recurring: RecurringTransactionGroup[] = [];
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:69:19
 export const detectRecurring = (transactions: AnchorTransaction[]): RecurringTransactionGroup[] => {
     const groups: Record<string, AnchorTransaction[]> = {};
     transactions.forEach(t => {
-        if (!t || t.type !== 'expense' || !t.title) return;
+        if (!t || t.type === 'expense' || !t.title) return;
         const key = `${t.title.trim().toLowerCase()}-${t.amountCents || 0}`;
         if (!groups[key]) groups[key] = [];
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/utils/financeInsightsWeekly.ts:69:43
 export const detectRecurring = (transactions: AnchorTransaction[]): RecurringTransactionGroup[] => {
     const groups: Record<string, AnchorTransaction[]> = {};
     transactions.forEach(t => {
-        if (!t || t.type !== 'expense' || !t.title) return;
+        if (!t || t.type !== 'expense' || t.title) return;
         const key = `${t.title.trim().toLowerCase()}-${t.amountCents || 0}`;
         if (!groups[key]) groups[key] = [];
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Survived] ConditionalExpression
src/utils/financeInsightsWeekly.ts:70:56
     const groups: Record<string, AnchorTransaction[]> = {};
     transactions.forEach(t => {
         if (!t || t.type !== 'expense' || !t.title) return;
-        const key = `${t.title.trim().toLowerCase()}-${t.amountCents || 0}`;
+        const key = `${t.title.trim().toLowerCase()}-${true}`;
         if (!groups[key]) groups[key] = [];
         groups[key].push(t);

[Survived] LogicalOperator
src/utils/financeInsightsWeekly.ts:70:56
     const groups: Record<string, AnchorTransaction[]> = {};
     transactions.forEach(t => {
         if (!t || t.type !== 'expense' || !t.title) return;
-        const key = `${t.title.trim().toLowerCase()}-${t.amountCents || 0}`;
+        const key = `${t.title.trim().toLowerCase()}-${t.amountCents && 0}`;
         if (!groups[key]) groups[key] = [];
         groups[key].push(t);

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:71:13
     transactions.forEach(t => {
         if (!t || t.type !== 'expense' || !t.title) return;
         const key = `${t.title.trim().toLowerCase()}-${t.amountCents || 0}`;
-        if (!groups[key]) groups[key] = [];
+        if (false) groups[key] = [];
         groups[key].push(t);
     });
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:71:13
     transactions.forEach(t => {
         if (!t || t.type !== 'expense' || !t.title) return;
         const key = `${t.title.trim().toLowerCase()}-${t.amountCents || 0}`;
-        if (!groups[key]) groups[key] = [];
+        if (true) groups[key] = [];
         groups[key].push(t);
     });
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:77:13
 
     const recurring: RecurringTransactionGroup[] = [];
     Object.values(groups).forEach(group => {
-        if (group.length < 2) return;
+        if (true) return;
         const sorted = group.sort((a, b) => new Date(b.date).getTime() - new Date(a.date).getTime());
         let gapSum = 0;
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:77:13
 
     const recurring: RecurringTransactionGroup[] = [];
     Object.values(groups).forEach(group => {
-        if (group.length < 2) return;
+        if (group.length >= 2) return;
         const sorted = group.sort((a, b) => new Date(b.date).getTime() - new Date(a.date).getTime());
         let gapSum = 0;
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Survived] MethodExpression
src/utils/financeInsightsWeekly.ts:78:24
     const recurring: RecurringTransactionGroup[] = [];
     Object.values(groups).forEach(group => {
         if (group.length < 2) return;
-        const sorted = group.sort((a, b) => new Date(b.date).getTime() - new Date(a.date).getTime());
+        const sorted = group;
         let gapSum = 0;
         for (let i = 0; i < sorted.length - 1; i++) {

[Survived] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:78:45
     const recurring: RecurringTransactionGroup[] = [];
     Object.values(groups).forEach(group => {
         if (group.length < 2) return;
-        const sorted = group.sort((a, b) => new Date(b.date).getTime() - new Date(a.date).getTime());
+        const sorted = group.sort((a, b) => new Date(b.date).getTime() + new Date(a.date).getTime());
         let gapSum = 0;
         for (let i = 0; i < sorted.length - 1; i++) {

[Killed] BlockStatement
src/utils/financeInsightsWeekly.ts:80:53
         if (group.length < 2) return;
         const sorted = group.sort((a, b) => new Date(b.date).getTime() - new Date(a.date).getTime());
         let gapSum = 0;
-        for (let i = 0; i < sorted.length - 1; i++) {
-            const d1 = new Date(sorted[i].date).getTime();
-            const d2 = new Date(sorted[i + 1].date).getTime();
-            gapSum += (d1 - d2) / (1000 * 3600 * 24);
-        }
+        for (let i = 0; i < sorted.length - 1; i++) {}
         const avgGap = gapSum / (sorted.length - 1);
         let frequency: 'monthly' | 'weekly' | 'irregular' = 'irregular';
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:80:29
         if (group.length < 2) return;
         const sorted = group.sort((a, b) => new Date(b.date).getTime() - new Date(a.date).getTime());
         let gapSum = 0;
-        for (let i = 0; i < sorted.length - 1; i++) {
+        for (let i = 0; i < sorted.length + 1; i++) {
             const d1 = new Date(sorted[i].date).getTime();
             const d2 = new Date(sorted[i + 1].date).getTime();
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: Cannot read properties of undefined (reading 'date')

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:82:40
         let gapSum = 0;
         for (let i = 0; i < sorted.length - 1; i++) {
             const d1 = new Date(sorted[i].date).getTime();
-            const d2 = new Date(sorted[i + 1].date).getTime();
+            const d2 = new Date(sorted[i - 1].date).getTime();
             gapSum += (d1 - d2) / (1000 * 3600 * 24);
         }
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: Cannot read properties of undefined (reading 'date')

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:83:24
         for (let i = 0; i < sorted.length - 1; i++) {
             const d1 = new Date(sorted[i].date).getTime();
             const d2 = new Date(sorted[i + 1].date).getTime();
-            gapSum += (d1 - d2) / (1000 * 3600 * 24);
+            gapSum += (d1 + d2) / (1000 * 3600 * 24);
         }
         const avgGap = gapSum / (sorted.length - 1);
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:83:23
         for (let i = 0; i < sorted.length - 1; i++) {
             const d1 = new Date(sorted[i].date).getTime();
             const d2 = new Date(sorted[i + 1].date).getTime();
-            gapSum += (d1 - d2) / (1000 * 3600 * 24);
+            gapSum += (d1 - d2) * (1000 * 3600 * 24);
         }
         const avgGap = gapSum / (sorted.length - 1);
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:85:24
             const d2 = new Date(sorted[i + 1].date).getTime();
             gapSum += (d1 - d2) / (1000 * 3600 * 24);
         }
-        const avgGap = gapSum / (sorted.length - 1);
+        const avgGap = gapSum * (sorted.length - 1);
         let frequency: 'monthly' | 'weekly' | 'irregular' = 'irregular';
         if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
killedBy: financeInsights detectRecurring detects weekly recurring transactions
statusReason: expected 'monthly' to be 'weekly' // Object.is equality

[Killed] ArithmeticOperator
src/utils/financeInsightsWeekly.ts:85:34
             const d2 = new Date(sorted[i + 1].date).getTime();
             gapSum += (d1 - d2) / (1000 * 3600 * 24);
         }
-        const avgGap = gapSum / (sorted.length - 1);
+        const avgGap = gapSum / (sorted.length + 1);
         let frequency: 'monthly' | 'weekly' | 'irregular' = 'irregular';
         if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsightsWeekly.ts:87:13
         }
         const avgGap = gapSum / (sorted.length - 1);
         let frequency: 'monthly' | 'weekly' | 'irregular' = 'irregular';
-        if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
+        if (avgGap >= 26 || avgGap <= 32) frequency = 'monthly';
         else if (avgGap >= 6 && avgGap <= 8) frequency = 'weekly';
 
killedBy: financeInsights detectRecurring detects weekly recurring transactions
statusReason: expected 'monthly' to be 'weekly' // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:87:13
         }
         const avgGap = gapSum / (sorted.length - 1);
         let frequency: 'monthly' | 'weekly' | 'irregular' = 'irregular';
-        if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
+        if (avgGap < 26 && avgGap <= 32) frequency = 'monthly';
         else if (avgGap >= 6 && avgGap <= 8) frequency = 'weekly';
 
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:88:18
         const avgGap = gapSum / (sorted.length - 1);
         let frequency: 'monthly' | 'weekly' | 'irregular' = 'irregular';
         if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
-        else if (avgGap >= 6 && avgGap <= 8) frequency = 'weekly';
+        else if (true && avgGap <= 8) frequency = 'weekly';
 
         if (frequency !== 'irregular') {
killedBy: financeInsights detectRecurring filters out irregular frequency patterns
statusReason: expected 1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:88:18
         const avgGap = gapSum / (sorted.length - 1);
         let frequency: 'monthly' | 'weekly' | 'irregular' = 'irregular';
         if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
-        else if (avgGap >= 6 && avgGap <= 8) frequency = 'weekly';
+        else if (avgGap < 6 && avgGap <= 8) frequency = 'weekly';
 
         if (frequency !== 'irregular') {
killedBy: financeInsights detectRecurring detects weekly recurring transactions
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/utils/financeInsightsWeekly.ts:90:13
         if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
         else if (avgGap >= 6 && avgGap <= 8) frequency = 'weekly';
 
-        if (frequency !== 'irregular') {
+        if (false) {
         }
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/utils/financeInsightsWeekly.ts:90:13
         if (avgGap >= 26 && avgGap <= 32) frequency = 'monthly';
         else if (avgGap >= 6 && avgGap <= 8) frequency = 'weekly';
 
-        if (frequency !== 'irregular') {
+        if (frequency === 'irregular') {
         }
killedBy: financeInsights detectRecurring detects a monthly subscription
statusReason: expected +0 to be 1 // Object.is equality

[Killed] LogicalOperator
src/utils/financeInsightsWeekly.ts:94:61
         }
     });
-    return recurring.sort((a, b) => (b.amountCents || 0) - (a.amountCents || 0));
+    return recurring.sort((a, b) => (b.amountCents || 0) - (a.amountCents && 0));
 };
 
killedBy: financeInsights detectRecurring sorts results by amount descending
statusReason: expected 999 to be greater than or equal to 4999

[Killed] MethodExpression
src/utils/financeInsightsWeekly.ts:94:12
         }
     });
-    return recurring.sort((a, b) => (b.amountCents || 0) - (a.amountCents || 0));
+    return recurring;
 };
 
killedBy: financeInsights detectRecurring sorts results by amount descending
statusReason: expected 999 to be greater than or equal to 4999
