[Killed] MethodExpression
src/services/fabric/QueryEngine.ts:18:20
 function spendingSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const expenses = input.transactions.filter((tx) => {
-    if (tx.type !== 'expense' || tx.isSoftDeleted) return false;
-    const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
-  });
+  const expenses = input.transactions;
 
   const total = expenses.reduce((sum, tx) => sum + tx.amountCents, 0);
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'You spent $1043.00 this month across …' to contain '$43.00'

[Killed] BlockStatement
src/services/fabric/QueryEngine.ts:18:54
 function spendingSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const expenses = input.transactions.filter((tx) => {
-    if (tx.type !== 'expense' || tx.isSoftDeleted) return false;
-    const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
-  });
+  const expenses = input.transactions.filter((tx) => {});
 
   const total = expenses.reduce((sum, tx) => sum + tx.amountCents, 0);
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Killed] BooleanLiteral
src/services/fabric/QueryEngine.ts:19:59
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const expenses = input.transactions.filter((tx) => {
-    if (tx.type !== 'expense' || tx.isSoftDeleted) return false;
+    if (tx.type !== 'expense' || tx.isSoftDeleted) return true;
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'You spent $1043.00 this month across …' to contain '$43.00'

[Killed] LogicalOperator
src/services/fabric/QueryEngine.ts:19:9
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const expenses = input.transactions.filter((tx) => {
-    if (tx.type !== 'expense' || tx.isSoftDeleted) return false;
+    if (tx.type !== 'expense' && tx.isSoftDeleted) return false;
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'You spent $1043.00 this month across …' to contain '$43.00'

[Killed] ConditionalExpression
src/services/fabric/QueryEngine.ts:21:12
   const expenses = input.transactions.filter((tx) => {
     if (tx.type !== 'expense' || tx.isSoftDeleted) return false;
     const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
+    return false;
   });
 
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Killed] EqualityOperator
src/services/fabric/QueryEngine.ts:21:45
   const expenses = input.transactions.filter((tx) => {
     if (tx.type !== 'expense' || tx.isSoftDeleted) return false;
     const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
+    return !!date && date >= range.start && date > range.end;
   });
 
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Killed] ArithmeticOperator
src/services/fabric/QueryEngine.ts:24:46
     return !!date && date >= range.start && date <= range.end;
   });
 
-  const total = expenses.reduce((sum, tx) => sum + tx.amountCents, 0);
+  const total = expenses.reduce((sum, tx) => sum - tx.amountCents, 0);
   const byCategory = sumByCategory(expenses);
 
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'You spent $-43.00 this month across 2…' to contain '$43.00'

[Survived] MethodExpression
src/services/fabric/QueryEngine.ts:27:23
   const total = expenses.reduce((sum, tx) => sum + tx.amountCents, 0);
   const byCategory = sumByCategory(expenses);
 
-  const topCategory = Object.entries(byCategory).sort((a, b) => b[1] - a[1]).at(0);
+  const topCategory = Object.entries(byCategory).at(0);
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);
 

[Survived] ArithmeticOperator
src/services/fabric/QueryEngine.ts:27:65
   const total = expenses.reduce((sum, tx) => sum + tx.amountCents, 0);
   const byCategory = sumByCategory(expenses);
 
-  const topCategory = Object.entries(byCategory).sort((a, b) => b[1] - a[1]).at(0);
+  const topCategory = Object.entries(byCategory).sort((a, b) => b[1] + a[1]).at(0);
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);
 

[NoCoverage] BlockStatement
src/services/fabric/QueryEngine.ts:32:23
 
   // Check if the category filter was specified
   const categoryFilter = input.intent.entities.category;
-  if (categoryFilter) {
-    const filtered = expenses.filter(
-      (tx) => tx.category?.toLowerCase().includes(categoryFilter.toLowerCase()),
-    );
-    const filteredTotal = filtered.reduce((sum, tx) => sum + tx.amountCents, 0);
-    return {
-      data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },
-      summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
-      detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
-      visualizable: filtered.length > 0,
-      actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
-    };
-  }
+  if (categoryFilter) {}
 
   return {

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:33:22
   // Check if the category filter was specified
   const categoryFilter = input.intent.entities.category;
   if (categoryFilter) {
-    const filtered = expenses.filter(
-      (tx) => tx.category?.toLowerCase().includes(categoryFilter.toLowerCase()),
-    );
+    const filtered = expenses;
     const filteredTotal = filtered.reduce((sum, tx) => sum + tx.amountCents, 0);
     return {

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:34:51
   const categoryFilter = input.intent.entities.category;
   if (categoryFilter) {
     const filtered = expenses.filter(
-      (tx) => tx.category?.toLowerCase().includes(categoryFilter.toLowerCase()),
+      (tx) => tx.category?.toLowerCase().includes(categoryFilter.toUpperCase()),
     );
     const filteredTotal = filtered.reduce((sum, tx) => sum + tx.amountCents, 0);

[NoCoverage] OptionalChaining
src/services/fabric/QueryEngine.ts:34:15
   const categoryFilter = input.intent.entities.category;
   if (categoryFilter) {
     const filtered = expenses.filter(
-      (tx) => tx.category?.toLowerCase().includes(categoryFilter.toLowerCase()),
+      (tx) => tx.category.toLowerCase().includes(categoryFilter.toLowerCase()),
     );
     const filteredTotal = filtered.reduce((sum, tx) => sum + tx.amountCents, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:36:56
     const filtered = expenses.filter(
       (tx) => tx.category?.toLowerCase().includes(categoryFilter.toLowerCase()),
     );
-    const filteredTotal = filtered.reduce((sum, tx) => sum + tx.amountCents, 0);
+    const filteredTotal = filtered.reduce((sum, tx) => sum - tx.amountCents, 0);
     return {
       data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:39:142
     const filteredTotal = filtered.reduce((sum, tx) => sum + tx.amountCents, 0);
     return {
       data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },
-      summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
+      summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${false ? '' : 's'}.`,
       detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
       visualizable: filtered.length > 0,

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:39:142
     const filteredTotal = filtered.reduce((sum, tx) => sum + tx.amountCents, 0);
     return {
       data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },
-      summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
+      summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${true ? '' : 's'}.`,
       detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
       visualizable: filtered.length > 0,

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:40:15
     return {
       data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },
       summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
-      detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
+      detail: filtered.length !== 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
       visualizable: filtered.length > 0,
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:40:15
     return {
       data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },
       summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
-      detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
+      detail: false ? `No ${categoryFilter} expenses found for that period.` : undefined,
       visualizable: filtered.length > 0,
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:41:21
       data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },
       summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
       detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
-      visualizable: filtered.length > 0,
+      visualizable: filtered.length >= 0,
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
     };

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:41:21
       data: { totalCents: filteredTotal, count: filtered.length, category: categoryFilter },
       summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
       detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
-      visualizable: filtered.length > 0,
+      visualizable: false,
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
     };

[NoCoverage] StringLiteral
src/services/fabric/QueryEngine.ts:42:77
       summary: `You spent ${formatCents(filteredTotal, currency)} on ${categoryFilter} ${periodLabel} across ${filtered.length} transaction${filtered.length === 1 ? '' : 's'}.`,
       detail: filtered.length === 0 ? `No ${categoryFilter} expenses found for that period.` : undefined,
       visualizable: filtered.length > 0,
-      actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
+      actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: "" } }],
     };
   }

[Survived] ObjectLiteral
src/services/fabric/QueryEngine.ts:47:11
   }
 
   return {
-    data: { totalCents: total, count: expenses.length, topCategory },
+    data: {},
     summary: expenses.length === 0
       ? `No expenses found for ${periodLabel}.`

[Killed] ConditionalExpression
src/services/fabric/QueryEngine.ts:48:14
 
   return {
     data: { totalCents: total, count: expenses.length, topCategory },
-    summary: expenses.length === 0
+    summary: true
       ? `No expenses found for ${periodLabel}.`
       : `You spent ${formatCents(total, currency)} ${periodLabel} across ${expenses.length} transaction${expenses.length === 1 ? '' : 's'}.`,
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Survived] ConditionalExpression
src/services/fabric/QueryEngine.ts:48:14
 
   return {
     data: { totalCents: total, count: expenses.length, topCategory },
-    summary: expenses.length === 0
+    summary: false
       ? `No expenses found for ${periodLabel}.`
       : `You spent ${formatCents(total, currency)} ${periodLabel} across ${expenses.length} transaction${expenses.length === 1 ? '' : 's'}.`,

[Survived] StringLiteral
src/services/fabric/QueryEngine.ts:49:9
   return {
     data: { totalCents: total, count: expenses.length, topCategory },
     summary: expenses.length === 0
-      ? `No expenses found for ${periodLabel}.`
+      ? ``
       : `You spent ${formatCents(total, currency)} ${periodLabel} across ${expenses.length} transaction${expenses.length === 1 ? '' : 's'}.`,
     detail: topCategory

[Survived] ConditionalExpression
src/services/fabric/QueryEngine.ts:50:106
     data: { totalCents: total, count: expenses.length, topCategory },
     summary: expenses.length === 0
       ? `No expenses found for ${periodLabel}.`
-      : `You spent ${formatCents(total, currency)} ${periodLabel} across ${expenses.length} transaction${expenses.length === 1 ? '' : 's'}.`,
+      : `You spent ${formatCents(total, currency)} ${periodLabel} across ${expenses.length} transaction${true ? '' : 's'}.`,
     detail: topCategory
       ? `Top category: ${topCategory[0]} at ${formatCents(topCategory[1], currency)}.`

[Survived] EqualityOperator
src/services/fabric/QueryEngine.ts:50:106
     data: { totalCents: total, count: expenses.length, topCategory },
     summary: expenses.length === 0
       ? `No expenses found for ${periodLabel}.`
-      : `You spent ${formatCents(total, currency)} ${periodLabel} across ${expenses.length} transaction${expenses.length === 1 ? '' : 's'}.`,
+      : `You spent ${formatCents(total, currency)} ${periodLabel} across ${expenses.length} transaction${expenses.length !== 1 ? '' : 's'}.`,
     detail: topCategory
       ? `Top category: ${topCategory[0]} at ${formatCents(topCategory[1], currency)}.`

[Killed] ConditionalExpression
src/services/fabric/QueryEngine.ts:54:19
     detail: topCategory
       ? `Top category: ${topCategory[0]} at ${formatCents(topCategory[1], currency)}.`
       : undefined,
-    visualizable: expenses.length > 0,
+    visualizable: false,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
   };
killedBy: FabricService returns structured query results for spending question
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/QueryEngine.ts:54:19
     detail: topCategory
       ? `Top category: ${topCategory[0]} at ${formatCents(topCategory[1], currency)}.`
       : undefined,
-    visualizable: expenses.length > 0,
+    visualizable: expenses.length <= 0,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
   };
killedBy: FabricService returns structured query results for spending question
statusReason: expected false to be true // Object.is equality

[Survived] ArrayDeclaration
src/services/fabric/QueryEngine.ts:55:14
       ? `Top category: ${topCategory[0]} at ${formatCents(topCategory[1], currency)}.`
       : undefined,
     visualizable: expenses.length > 0,
-    actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
+    actions: [],
   };
 }

[Survived] BlockStatement
src/services/fabric/QueryEngine.ts:61:55
 
 function commitmentsSummary(input: RunFabricQueryInput): FabricQueryResult {
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const filtered = input.commitments.filter((task) => {
-    const date = toDate(task.createdAt ?? null);
-    return !date || (date >= range.start && date <= range.end);
-  });
+  const filtered = input.commitments.filter((task) => {});
   const tasks = filtered.length > 0 ? filtered : input.commitments;
 

[Survived] MethodExpression
src/services/fabric/QueryEngine.ts:61:20
 
 function commitmentsSummary(input: RunFabricQueryInput): FabricQueryResult {
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const filtered = input.commitments.filter((task) => {
-    const date = toDate(task.createdAt ?? null);
-    return !date || (date >= range.start && date <= range.end);
-  });
+  const filtered = input.commitments;
   const tasks = filtered.length > 0 ? filtered : input.commitments;
 

[Survived] LogicalOperator
src/services/fabric/QueryEngine.ts:62:25
 function commitmentsSummary(input: RunFabricQueryInput): FabricQueryResult {
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const filtered = input.commitments.filter((task) => {
-    const date = toDate(task.createdAt ?? null);
+    const date = toDate(task.createdAt && null);
     return !date || (date >= range.start && date <= range.end);
   });

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:63:45
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const filtered = input.commitments.filter((task) => {
     const date = toDate(task.createdAt ?? null);
-    return !date || (date >= range.start && date <= range.end);
+    return !date || (date >= range.start && date < range.end);
   });
   const tasks = filtered.length > 0 ? filtered : input.commitments;

[Survived] ConditionalExpression
src/services/fabric/QueryEngine.ts:63:12
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const filtered = input.commitments.filter((task) => {
     const date = toDate(task.createdAt ?? null);
-    return !date || (date >= range.start && date <= range.end);
+    return false;
   });
   const tasks = filtered.length > 0 ? filtered : input.commitments;

[Killed] ConditionalExpression
src/services/fabric/QueryEngine.ts:65:17
     const date = toDate(task.createdAt ?? null);
     return !date || (date >= range.start && date <= range.end);
   });
-  const tasks = filtered.length > 0 ? filtered : input.commitments;
+  const tasks = true ? filtered : input.commitments;
 
   const total = tasks.length;
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 0% (0/0).' to contain '50%'

[Killed] EqualityOperator
src/services/fabric/QueryEngine.ts:65:17
     const date = toDate(task.createdAt ?? null);
     return !date || (date >= range.start && date <= range.end);
   });
-  const tasks = filtered.length > 0 ? filtered : input.commitments;
+  const tasks = filtered.length >= 0 ? filtered : input.commitments;
 
   const total = tasks.length;
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 0% (0/0).' to contain '50%'

[Killed] MethodExpression
src/services/fabric/QueryEngine.ts:68:21
   const tasks = filtered.length > 0 ? filtered : input.commitments;
 
   const total = tasks.length;
-  const completed = tasks.filter((task) => task.completed).length;
+  const completed = tasks.length;
   const rate = total > 0 ? Math.round((completed / total) * 100) : 0;
   const bestStreak = tasks.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 100% (2/2).' to contain '50%'

[Killed] ArrowFunction
src/services/fabric/QueryEngine.ts:68:34
   const tasks = filtered.length > 0 ? filtered : input.commitments;
 
   const total = tasks.length;
-  const completed = tasks.filter((task) => task.completed).length;
+  const completed = tasks.filter(() => undefined).length;
   const rate = total > 0 ? Math.round((completed / total) * 100) : 0;
   const bestStreak = tasks.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 0% (0/2).' to contain '50%'

[Killed] ArithmeticOperator
src/services/fabric/QueryEngine.ts:69:40
 
   const total = tasks.length;
   const completed = tasks.filter((task) => task.completed).length;
-  const rate = total > 0 ? Math.round((completed / total) * 100) : 0;
+  const rate = total > 0 ? Math.round((completed * total) * 100) : 0;
   const bestStreak = tasks.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
 
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 200% (1/2).' to contain '50%'

[Killed] ConditionalExpression
src/services/fabric/QueryEngine.ts:69:16
 
   const total = tasks.length;
   const completed = tasks.filter((task) => task.completed).length;
-  const rate = total > 0 ? Math.round((completed / total) * 100) : 0;
+  const rate = false ? Math.round((completed / total) * 100) : 0;
   const bestStreak = tasks.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
 
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 0% (1/2).' to contain '50%'

[Survived] MethodExpression
src/services/fabric/QueryEngine.ts:70:47
   const total = tasks.length;
   const completed = tasks.filter((task) => task.completed).length;
   const rate = total > 0 ? Math.round((completed / total) * 100) : 0;
-  const bestStreak = tasks.reduce((max, t) => Math.max(max, t.currentStreak ?? 0), 0);
+  const bestStreak = tasks.reduce((max, t) => Math.min(max, t.currentStreak ?? 0), 0);
 
   return {

[Survived] EqualityOperator
src/services/fabric/QueryEngine.ts:75:13
   return {
     data: { total, completed, rate, bestStreak },
     summary: `Commitment completion is ${rate}% (${completed}/${total}).`,
-    detail: rate >= 80
+    detail: rate > 80
       ? `Great consistency! Best streak: ${bestStreak} day${bestStreak === 1 ? '' : 's'}.`
       : rate >= 50

[Survived] ConditionalExpression
src/services/fabric/QueryEngine.ts:75:13
   return {
     data: { total, completed, rate, bestStreak },
     summary: `Commitment completion is ${rate}% (${completed}/${total}).`,
-    detail: rate >= 80
+    detail: true
       ? `Great consistency! Best streak: ${bestStreak} day${bestStreak === 1 ? '' : 's'}.`
       : rate >= 50

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:76:61
     data: { total, completed, rate, bestStreak },
     summary: `Commitment completion is ${rate}% (${completed}/${total}).`,
     detail: rate >= 80
-      ? `Great consistency! Best streak: ${bestStreak} day${bestStreak === 1 ? '' : 's'}.`
+      ? `Great consistency! Best streak: ${bestStreak} day${bestStreak !== 1 ? '' : 's'}.`
       : rate >= 50
         ? 'You can boost this by completing one pending task today.'

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:76:61
     data: { total, completed, rate, bestStreak },
     summary: `Commitment completion is ${rate}% (${completed}/${total}).`,
     detail: rate >= 80
-      ? `Great consistency! Best streak: ${bestStreak} day${bestStreak === 1 ? '' : 's'}.`
+      ? `Great consistency! Best streak: ${bestStreak} day${true ? '' : 's'}.`
       : rate >= 50
         ? 'You can boost this by completing one pending task today.'

[Survived] EqualityOperator
src/services/fabric/QueryEngine.ts:77:9
     summary: `Commitment completion is ${rate}% (${completed}/${total}).`,
     detail: rate >= 80
       ? `Great consistency! Best streak: ${bestStreak} day${bestStreak === 1 ? '' : 's'}.`
-      : rate >= 50
+      : rate < 50
         ? 'You can boost this by completing one pending task today.'
         : 'Consider narrowing your active commitments to build momentum.',

[Survived] ConditionalExpression
src/services/fabric/QueryEngine.ts:77:9
     summary: `Commitment completion is ${rate}% (${completed}/${total}).`,
     detail: rate >= 80
       ? `Great consistency! Best streak: ${bestStreak} day${bestStreak === 1 ? '' : 's'}.`
-      : rate >= 50
+      : false
         ? 'You can boost this by completing one pending task today.'
         : 'Consider narrowing your active commitments to build momentum.',

[Killed] BooleanLiteral
src/services/fabric/QueryEngine.ts:80:19
       : rate >= 50
         ? 'You can boost this by completing one pending task today.'
         : 'Consider narrowing your active commitments to build momentum.',
-    visualizable: true,
+    visualizable: false,
     actions: [{ label: 'Open Commitments', type: 'navigate', payload: { page: 'commitments' } }],
   };
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected false to be true // Object.is equality

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:88:3
 function weekSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const weekStart = new Date(input.now);
-  weekStart.setDate(weekStart.getDate() - 6);
+  weekStart.setTime(weekStart.getDate() - 6);
   weekStart.setHours(0, 0, 0, 0);
 

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:88:21
 function weekSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const weekStart = new Date(input.now);
-  weekStart.setDate(weekStart.getDate() - 6);
+  weekStart.setDate(weekStart.getDate() + 6);
   weekStart.setHours(0, 0, 0, 0);
 

[NoCoverage] BlockStatement
src/services/fabric/QueryEngine.ts:91:54
   weekStart.setDate(weekStart.getDate() - 6);
   weekStart.setHours(0, 0, 0, 0);
 
-  const weekTxns = input.transactions.filter((tx) => {
-    const d = toDate(tx.date);
-    return !!d && d >= weekStart;
-  });
+  const weekTxns = input.transactions.filter((tx) => {});
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
   const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:91:20
   weekStart.setDate(weekStart.getDate() - 6);
   weekStart.setHours(0, 0, 0, 0);
 
-  const weekTxns = input.transactions.filter((tx) => {
-    const d = toDate(tx.date);
-    return !!d && d >= weekStart;
-  });
+  const weekTxns = input.transactions;
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
   const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:93:12
 
   const weekTxns = input.transactions.filter((tx) => {
     const d = toDate(tx.date);
-    return !!d && d >= weekStart;
+    return false;
   });
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:93:19
 
   const weekTxns = input.transactions.filter((tx) => {
     const d = toDate(tx.date);
-    return !!d && d >= weekStart;
+    return !!d && true;
   });
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:95:79
     const d = toDate(tx.date);
     return !!d && d >= weekStart;
   });
-  const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
+  const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s - t.amountCents, 0);
   const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);
   const completed = input.commitments.filter((t) => t.completed).length;

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:95:40
     const d = toDate(tx.date);
     return !!d && d >= weekStart;
   });
-  const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
+  const spent = weekTxns.filter((t) => true).reduce((s, t) => s + t.amountCents, 0);
   const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);
   const completed = input.commitments.filter((t) => t.completed).length;
