[NoCoverage] ArrowFunction
src/services/fabric/QueryEngine.ts:96:34
     return !!d && d >= weekStart;
   });
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
-  const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);
+  const income = weekTxns.filter(() => undefined).reduce((s, t) => s + t.amountCents, 0);
   const completed = input.commitments.filter((t) => t.completed).length;
   const total = input.commitments.length;

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:96:41
     return !!d && d >= weekStart;
   });
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
-  const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);
+  const income = weekTxns.filter((t) => false).reduce((s, t) => s + t.amountCents, 0);
   const completed = input.commitments.filter((t) => t.completed).length;
   const total = input.commitments.length;

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:97:21
   });
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
   const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);
-  const completed = input.commitments.filter((t) => t.completed).length;
+  const completed = input.commitments.length;
   const total = input.commitments.length;
 

[NoCoverage] ArrowFunction
src/services/fabric/QueryEngine.ts:97:46
   });
   const spent = weekTxns.filter((t) => t.type === 'expense').reduce((s, t) => s + t.amountCents, 0);
   const income = weekTxns.filter((t) => t.type === 'income').reduce((s, t) => s + t.amountCents, 0);
-  const completed = input.commitments.filter((t) => t.completed).length;
+  const completed = input.commitments.filter(() => undefined).length;
   const total = input.commitments.length;
 

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:103:13
   return {
     data: { spent, income, completed, total },
     summary: `This week: ${formatCents(spent, currency)} spent, ${formatCents(income, currency)} earned. Commitments: ${completed}/${total} done.`,
-    detail: income > spent ? `You're ${formatCents(income - spent, currency)} ahead — good week!` : undefined,
+    detail: false ? `You're ${formatCents(income - spent, currency)} ahead — good week!` : undefined,
     visualizable: true,
     actions: [

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:103:13
   return {
     data: { spent, income, completed, total },
     summary: `This week: ${formatCents(spent, currency)} spent, ${formatCents(income, currency)} earned. Commitments: ${completed}/${total} done.`,
-    detail: income > spent ? `You're ${formatCents(income - spent, currency)} ahead — good week!` : undefined,
+    detail: income >= spent ? `You're ${formatCents(income - spent, currency)} ahead — good week!` : undefined,
     visualizable: true,
     actions: [

[NoCoverage] BooleanLiteral
src/services/fabric/QueryEngine.ts:104:19
     data: { spent, income, completed, total },
     summary: `This week: ${formatCents(spent, currency)} spent, ${formatCents(income, currency)} earned. Commitments: ${completed}/${total} done.`,
     detail: income > spent ? `You're ${formatCents(income - spent, currency)} ahead — good week!` : undefined,
-    visualizable: true,
+    visualizable: false,
     actions: [
       { label: 'View Finance', type: 'navigate', payload: { page: 'finance' } },

[NoCoverage] StringLiteral
src/services/fabric/QueryEngine.ts:106:67
     detail: income > spent ? `You're ${formatCents(income - spent, currency)} ahead — good week!` : undefined,
     visualizable: true,
     actions: [
-      { label: 'View Finance', type: 'navigate', payload: { page: 'finance' } },
+      { label: 'View Finance', type: 'navigate', payload: { page: "" } },
       { label: 'View Commitments', type: 'navigate', payload: { page: 'commitments' } },
     ],

[NoCoverage] ObjectLiteral
src/services/fabric/QueryEngine.ts:106:59
     detail: income > spent ? `You're ${formatCents(income - spent, currency)} ahead — good week!` : undefined,
     visualizable: true,
     actions: [
-      { label: 'View Finance', type: 'navigate', payload: { page: 'finance' } },
+      { label: 'View Finance', type: 'navigate', payload: {} },
       { label: 'View Commitments', type: 'navigate', payload: { page: 'commitments' } },
     ],

[NoCoverage] StringLiteral
src/services/fabric/QueryEngine.ts:107:16
     visualizable: true,
     actions: [
       { label: 'View Finance', type: 'navigate', payload: { page: 'finance' } },
-      { label: 'View Commitments', type: 'navigate', payload: { page: 'commitments' } },
+      { label: "", type: 'navigate', payload: { page: 'commitments' } },
     ],
   };

[NoCoverage] StringLiteral
src/services/fabric/QueryEngine.ts:107:71
     visualizable: true,
     actions: [
       { label: 'View Finance', type: 'navigate', payload: { page: 'finance' } },
-      { label: 'View Commitments', type: 'navigate', payload: { page: 'commitments' } },
+      { label: 'View Commitments', type: 'navigate', payload: { page: "" } },
     ],
   };

[NoCoverage] BlockStatement
src/services/fabric/QueryEngine.ts:115:53
 function incomeSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const incomes = input.transactions.filter((tx) => {
-    if (tx.type !== 'income' || tx.isSoftDeleted) return false;
-    const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
-  });
+  const incomes = input.transactions.filter((tx) => {});
   const total = incomes.reduce((sum, tx) => sum + tx.amountCents, 0);
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:115:19
 function incomeSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const incomes = input.transactions.filter((tx) => {
-    if (tx.type !== 'income' || tx.isSoftDeleted) return false;
-    const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
-  });
+  const incomes = input.transactions;
   const total = incomes.reduce((sum, tx) => sum + tx.amountCents, 0);
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:116:9
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const incomes = input.transactions.filter((tx) => {
-    if (tx.type !== 'income' || tx.isSoftDeleted) return false;
+    if (tx.type === 'income' || tx.isSoftDeleted) return false;
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:116:9
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const incomes = input.transactions.filter((tx) => {
-    if (tx.type !== 'income' || tx.isSoftDeleted) return false;
+    if (false) return false;
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:118:22
   const incomes = input.transactions.filter((tx) => {
     if (tx.type !== 'income' || tx.isSoftDeleted) return false;
     const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
+    return !!date && date > range.start && date <= range.end;
   });
   const total = incomes.reduce((sum, tx) => sum + tx.amountCents, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:120:45
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;
   });
-  const total = incomes.reduce((sum, tx) => sum + tx.amountCents, 0);
+  const total = incomes.reduce((sum, tx) => sum - tx.amountCents, 0);
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);
   return {

[NoCoverage] ObjectLiteral
src/services/fabric/QueryEngine.ts:123:11
   const total = incomes.reduce((sum, tx) => sum + tx.amountCents, 0);
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);
   return {
-    data: { totalCents: total, count: incomes.length },
+    data: {},
     summary: incomes.length === 0
       ? `No income recorded for ${periodLabel}.`

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:124:14
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);
   return {
     data: { totalCents: total, count: incomes.length },
-    summary: incomes.length === 0
+    summary: true
       ? `No income recorded for ${periodLabel}.`
       : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:124:14
   const periodLabel = formatPeriodLabel(input.intent.entities.timePeriod);
   return {
     data: { totalCents: total, count: incomes.length },
-    summary: incomes.length === 0
+    summary: false
       ? `No income recorded for ${periodLabel}.`
       : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:126:113
     data: { totalCents: total, count: incomes.length },
     summary: incomes.length === 0
       ? `No income recorded for ${periodLabel}.`
-      : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,
+      : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length !== 1 ? '' : 's'}.`,
     visualizable: incomes.length > 0,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:126:113
     data: { totalCents: total, count: incomes.length },
     summary: incomes.length === 0
       ? `No income recorded for ${periodLabel}.`
-      : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,
+      : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${true ? '' : 's'}.`,
     visualizable: incomes.length > 0,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:127:19
     summary: incomes.length === 0
       ? `No income recorded for ${periodLabel}.`
       : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,
-    visualizable: incomes.length > 0,
+    visualizable: false,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
   };

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:127:19
     summary: incomes.length === 0
       ? `No income recorded for ${periodLabel}.`
       : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,
-    visualizable: incomes.length > 0,
+    visualizable: incomes.length >= 0,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
   };

[NoCoverage] ArrayDeclaration
src/services/fabric/QueryEngine.ts:128:14
       ? `No income recorded for ${periodLabel}.`
       : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,
     visualizable: incomes.length > 0,
-    actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
+    actions: [],
   };
 }

[NoCoverage] StringLiteral
src/services/fabric/QueryEngine.ts:128:75
       ? `No income recorded for ${periodLabel}.`
       : `You earned ${formatCents(total, currency)} ${periodLabel} across ${incomes.length} income transaction${incomes.length === 1 ? '' : 's'}.`,
     visualizable: incomes.length > 0,
-    actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
+    actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: "" } }],
   };
 }

[NoCoverage] ArrowFunction
src/services/fabric/QueryEngine.ts:134:40
 
 function accountsSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
-  const active = input.accounts.filter((a) => !a.isArchived);
+  const active = input.accounts.filter(() => undefined);
   if (active.length === 0) {
     return {

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:134:18
 
 function accountsSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
-  const active = input.accounts.filter((a) => !a.isArchived);
+  const active = input.accounts;
   if (active.length === 0) {
     return {

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:135:7
 function accountsSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const active = input.accounts.filter((a) => !a.isArchived);
-  if (active.length === 0) {
+  if (false) {
     return {
       data: null,

[NoCoverage] BlockStatement
src/services/fabric/QueryEngine.ts:135:28
 function accountsSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const active = input.accounts.filter((a) => !a.isArchived);
-  if (active.length === 0) {
-    return {
-      data: null,
-      summary: 'No accounts found. Add an account in Finance to get started.',
-      visualizable: false,
-      actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
-    };
-  }
+  if (active.length === 0) {}
   const totalCents = active.reduce((sum, a) => sum + a.balanceCents, 0);
   const top = [...active].sort((a, b) => b.balanceCents - a.balanceCents).at(0);

[NoCoverage] BooleanLiteral
src/services/fabric/QueryEngine.ts:139:21
     return {
       data: null,
       summary: 'No accounts found. Add an account in Finance to get started.',
-      visualizable: false,
+      visualizable: true,
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
     };

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:143:48
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
     };
   }
-  const totalCents = active.reduce((sum, a) => sum + a.balanceCents, 0);
+  const totalCents = active.reduce((sum, a) => sum - a.balanceCents, 0);
   const top = [...active].sort((a, b) => b.balanceCents - a.balanceCents).at(0);
   return {

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:144:15
     };
   }
   const totalCents = active.reduce((sum, a) => sum + a.balanceCents, 0);
-  const top = [...active].sort((a, b) => b.balanceCents - a.balanceCents).at(0);
+  const top = [...active].at(0);
   return {
     data: { accounts: active.length, totalCents },

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:144:42
     };
   }
   const totalCents = active.reduce((sum, a) => sum + a.balanceCents, 0);
-  const top = [...active].sort((a, b) => b.balanceCents - a.balanceCents).at(0);
+  const top = [...active].sort((a, b) => b.balanceCents + a.balanceCents).at(0);
   return {
     data: { accounts: active.length, totalCents },

[NoCoverage] ObjectLiteral
src/services/fabric/QueryEngine.ts:146:11
   const totalCents = active.reduce((sum, a) => sum + a.balanceCents, 0);
   const top = [...active].sort((a, b) => b.balanceCents - a.balanceCents).at(0);
   return {
-    data: { accounts: active.length, totalCents },
+    data: {},
     summary: `You have ${active.length} account${active.length === 1 ? '' : 's'} with a combined balance of ${formatCents(totalCents, currency)}.`,
     detail: top ? `Highest balance: ${top.name} at ${formatCents(top.balanceCents, currency)}.` : undefined,

[NoCoverage] EqualityOperator
src/services/fabric/QueryEngine.ts:147:50
   const top = [...active].sort((a, b) => b.balanceCents - a.balanceCents).at(0);
   return {
     data: { accounts: active.length, totalCents },
-    summary: `You have ${active.length} account${active.length === 1 ? '' : 's'} with a combined balance of ${formatCents(totalCents, currency)}.`,
+    summary: `You have ${active.length} account${active.length !== 1 ? '' : 's'} with a combined balance of ${formatCents(totalCents, currency)}.`,
     detail: top ? `Highest balance: ${top.name} at ${formatCents(top.balanceCents, currency)}.` : undefined,
     visualizable: true,

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:147:50
   const top = [...active].sort((a, b) => b.balanceCents - a.balanceCents).at(0);
   return {
     data: { accounts: active.length, totalCents },
-    summary: `You have ${active.length} account${active.length === 1 ? '' : 's'} with a combined balance of ${formatCents(totalCents, currency)}.`,
+    summary: `You have ${active.length} account${false ? '' : 's'} with a combined balance of ${formatCents(totalCents, currency)}.`,
     detail: top ? `Highest balance: ${top.name} at ${formatCents(top.balanceCents, currency)}.` : undefined,
     visualizable: true,

[NoCoverage] StringLiteral
src/services/fabric/QueryEngine.ts:148:19
   return {
     data: { accounts: active.length, totalCents },
     summary: `You have ${active.length} account${active.length === 1 ? '' : 's'} with a combined balance of ${formatCents(totalCents, currency)}.`,
-    detail: top ? `Highest balance: ${top.name} at ${formatCents(top.balanceCents, currency)}.` : undefined,
+    detail: top ? `` : undefined,
     visualizable: true,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],

[NoCoverage] BooleanLiteral
src/services/fabric/QueryEngine.ts:149:19
     data: { accounts: active.length, totalCents },
     summary: `You have ${active.length} account${active.length === 1 ? '' : 's'} with a combined balance of ${formatCents(totalCents, currency)}.`,
     detail: top ? `Highest balance: ${top.name} at ${formatCents(top.balanceCents, currency)}.` : undefined,
-    visualizable: true,
+    visualizable: false,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
   };

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:156:48
 
 function recurringSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
-  const active = input.recurring.filter((r) => r.status === 'active');
+  const active = input.recurring.filter((r) => true);
   if (active.length === 0) {
     return {

[NoCoverage] ArrowFunction
src/services/fabric/QueryEngine.ts:156:41
 
 function recurringSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
-  const active = input.recurring.filter((r) => r.status === 'active');
+  const active = input.recurring.filter(() => undefined);
   if (active.length === 0) {
     return {

[NoCoverage] BlockStatement
src/services/fabric/QueryEngine.ts:157:28
 function recurringSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const active = input.recurring.filter((r) => r.status === 'active');
-  if (active.length === 0) {
-    return {
-      data: null,
-      summary: 'No active recurring transactions found.',
-      visualizable: false,
-      actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
-    };
-  }
+  if (active.length === 0) {}
   const totalMonthlyCents = active
     .filter((r) => r.frequency === 'monthly')

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:157:7
 function recurringSummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const active = input.recurring.filter((r) => r.status === 'active');
-  if (active.length === 0) {
+  if (false) {
     return {
       data: null,

[NoCoverage] BooleanLiteral
src/services/fabric/QueryEngine.ts:161:21
     return {
       data: null,
       summary: 'No active recurring transactions found.',
-      visualizable: false,
+      visualizable: true,
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
     };

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:165:29
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
     };
   }
-  const totalMonthlyCents = active
-    .filter((r) => r.frequency === 'monthly')
+  const totalMonthlyCents = active
     .reduce((sum, r) => sum + r.amountCents, 0);
   const upcoming = [...active]

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:166:20
     };
   }
   const totalMonthlyCents = active
-    .filter((r) => r.frequency === 'monthly')
+    .filter((r) => true)
     .reduce((sum, r) => sum + r.amountCents, 0);
   const upcoming = [...active]

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:166:20
     };
   }
   const totalMonthlyCents = active
-    .filter((r) => r.frequency === 'monthly')
+    .filter((r) => false)
     .reduce((sum, r) => sum + r.amountCents, 0);
   const upcoming = [...active]

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:167:25
   }
   const totalMonthlyCents = active
     .filter((r) => r.frequency === 'monthly')
-    .reduce((sum, r) => sum + r.amountCents, 0);
+    .reduce((sum, r) => sum - r.amountCents, 0);
   const upcoming = [...active]
     .sort((a, b) => new Date(a.nextRunAt).getTime() - new Date(b.nextRunAt).getTime())

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:168:20
   const totalMonthlyCents = active
     .filter((r) => r.frequency === 'monthly')
     .reduce((sum, r) => sum + r.amountCents, 0);
-  const upcoming = [...active]
-    .sort((a, b) => new Date(a.nextRunAt).getTime() - new Date(b.nextRunAt).getTime())
+  const upcoming = [...active]
     .at(0);
   return {

[NoCoverage] ArithmeticOperator
src/services/fabric/QueryEngine.ts:169:21
     .filter((r) => r.frequency === 'monthly')
     .reduce((sum, r) => sum + r.amountCents, 0);
   const upcoming = [...active]
-    .sort((a, b) => new Date(a.nextRunAt).getTime() - new Date(b.nextRunAt).getTime())
+    .sort((a, b) => new Date(a.nextRunAt).getTime() + new Date(b.nextRunAt).getTime())
     .at(0);
   return {

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:173:104
     .at(0);
   return {
     data: { count: active.length, totalMonthlyCents },
-    summary: `You have ${active.length} active recurring transaction${active.length === 1 ? '' : 's'}${totalMonthlyCents > 0 ? `, totalling ${formatCents(totalMonthlyCents, currency)}/month` : ''}.`,
+    summary: `You have ${active.length} active recurring transaction${active.length === 1 ? '' : 's'}${false ? `, totalling ${formatCents(totalMonthlyCents, currency)}/month` : ''}.`,
     detail: upcoming ? `Next due: ${upcoming.title} on ${new Date(upcoming.nextRunAt).toLocaleDateString()}.` : undefined,
     visualizable: true,

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:173:71
     .at(0);
   return {
     data: { count: active.length, totalMonthlyCents },
-    summary: `You have ${active.length} active recurring transaction${active.length === 1 ? '' : 's'}${totalMonthlyCents > 0 ? `, totalling ${formatCents(totalMonthlyCents, currency)}/month` : ''}.`,
+    summary: `You have ${active.length} active recurring transaction${false ? '' : 's'}${totalMonthlyCents > 0 ? `, totalling ${formatCents(totalMonthlyCents, currency)}/month` : ''}.`,
     detail: upcoming ? `Next due: ${upcoming.title} on ${new Date(upcoming.nextRunAt).toLocaleDateString()}.` : undefined,
     visualizable: true,

[NoCoverage] BooleanLiteral
src/services/fabric/QueryEngine.ts:175:19
     data: { count: active.length, totalMonthlyCents },
     summary: `You have ${active.length} active recurring transaction${active.length === 1 ? '' : 's'}${totalMonthlyCents > 0 ? `, totalling ${formatCents(totalMonthlyCents, currency)}/month` : ''}.`,
     detail: upcoming ? `Next due: ${upcoming.title} on ${new Date(upcoming.nextRunAt).toLocaleDateString()}.` : undefined,
-    visualizable: true,
+    visualizable: false,
     actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
   };

[NoCoverage] StringLiteral
src/services/fabric/QueryEngine.ts:176:24
     summary: `You have ${active.length} active recurring transaction${active.length === 1 ? '' : 's'}${totalMonthlyCents > 0 ? `, totalling ${formatCents(totalMonthlyCents, currency)}/month` : ''}.`,
     detail: upcoming ? `Next due: ${upcoming.title} on ${new Date(upcoming.nextRunAt).toLocaleDateString()}.` : undefined,
     visualizable: true,
-    actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
+    actions: [{ label: "", type: 'navigate', payload: { page: 'finance' } }],
   };
 }

[NoCoverage] MethodExpression
src/services/fabric/QueryEngine.ts:183:22
 function familySummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const familyTxns = input.transactions.filter((tx) => {
-    if (tx.scope !== 'family' || tx.isSoftDeleted) return false;
-    const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
-  });
+  const familyTxns = input.transactions;
   if (familyTxns.length === 0) {
     return {

[NoCoverage] BlockStatement
src/services/fabric/QueryEngine.ts:183:56
 function familySummary(input: RunFabricQueryInput): FabricQueryResult {
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
-  const familyTxns = input.transactions.filter((tx) => {
-    if (tx.scope !== 'family' || tx.isSoftDeleted) return false;
-    const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
-  });
+  const familyTxns = input.transactions.filter((tx) => {});
   if (familyTxns.length === 0) {
     return {

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:184:9
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const familyTxns = input.transactions.filter((tx) => {
-    if (tx.scope !== 'family' || tx.isSoftDeleted) return false;
+    if (false) return false;
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:184:9
   const currency = detectPrimaryCurrency(input.transactions);
   const range = getDateRange(input.intent.entities.timePeriod, input.now);
   const familyTxns = input.transactions.filter((tx) => {
-    if (tx.scope !== 'family' || tx.isSoftDeleted) return false;
+    if (false || tx.isSoftDeleted) return false;
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:186:45
   const familyTxns = input.transactions.filter((tx) => {
     if (tx.scope !== 'family' || tx.isSoftDeleted) return false;
     const date = toDate(tx.date);
-    return !!date && date >= range.start && date <= range.end;
+    return !!date && date >= range.start && true;
   });
   if (familyTxns.length === 0) {

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:188:7
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;
   });
-  if (familyTxns.length === 0) {
+  if (true) {
     return {
       data: null,

[NoCoverage] ConditionalExpression
src/services/fabric/QueryEngine.ts:188:7
     const date = toDate(tx.date);
     return !!date && date >= range.start && date <= range.end;
   });
-  if (familyTxns.length === 0) {
+  if (false) {
     return {
       data: null,

[NoCoverage] BooleanLiteral
src/services/fabric/QueryEngine.ts:192:21
     return {
       data: null,
       summary: 'No shared family transactions found for that period.',
-      visualizable: false,
+      visualizable: true,
       actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
     };

[NoCoverage] ArrayDeclaration
src/services/fabric/QueryEngine.ts:193:16
       data: null,
       summary: 'No shared family transactions found for that period.',
       visualizable: false,
-      actions: [{ label: 'Open Finance', type: 'navigate', payload: { page: 'finance' } }],
+      actions: [],
     };
   }
