[Killed] BlockStatement
src/services/FinanceService.ts:37:98
         return this.accountService.addAccount(userId, payload);
     }
 
-    async deleteAccount(userId: string, userName: string, account: AnchorAccount): Promise<void> {
-        return this.accountService.deleteAccount(userId, userName, account);
-    }
+    async deleteAccount(userId: string, userName: string, account: AnchorAccount): Promise<void> {}
 
     async renameAccount(userId: string, userName: string, account: AnchorAccount, newName: string): Promise<void> {
killedBy: useFinanceService Account Management should call deleteAccount with correct ID (soft delete)
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, { isArchived: true } ]

Number of calls: 0

[Killed] BlockStatement
src/services/FinanceService.ts:41:115
         return this.accountService.deleteAccount(userId, userName, account);
     }
 
-    async renameAccount(userId: string, userName: string, account: AnchorAccount, newName: string): Promise<void> {
-        return this.accountService.renameAccount(userId, userName, account, newName);
-    }
+    async renameAccount(userId: string, userName: string, account: AnchorAccount, newName: string): Promise<void> {}
 
     // Transaction Operations
killedBy: useFinanceService Account Management should call renameAccount with correct data and update audit trail
statusReason: expected "vi.fn()" to be called with arguments: [ ObjectContaining{…}, …(1) ]

Number of calls: 0

[Killed] BlockStatement
src/services/FinanceService.ts:46:119
     }
 
     // Transaction Operations
-    async addTransaction(userId: string, payload: CreateTransactionPayload, accounts: AnchorAccount[]): Promise<void> {
-        return this.transactionService.addTransaction(userId, payload, accounts);
-    }
+    async addTransaction(userId: string, payload: CreateTransactionPayload, accounts: AnchorAccount[]): Promise<void> {}
 
     async deleteTransaction(
killedBy: useFinanceService Transaction Management should add income transaction and update account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/services/FinanceService.ts:53:22
     async deleteTransaction(
         userId: string, transactionId: string, accountId: string,
         accounts: AnchorAccount[], transactions: AnchorTransaction[]
-    ): Promise<void> {
-        return this.transactionService.deleteTransaction(userId, transactionId, accountId, accounts, transactions);
-    }
+    ): Promise<void> {}
 
     async updateTransaction(
killedBy: useFinanceService Transaction Management should delete transaction and reverse account balance correctly
statusReason: expected "vi.fn()" to be called with arguments: [ Anything, ObjectContaining{…} ]

Number of calls: 0

[Killed] BlockStatement
src/services/FinanceService.ts:60:22
     async updateTransaction(
         userId: string, transactionId: string, accountId: string,
         updates: UpdateTransactionPayload, accounts: AnchorAccount[]
-    ): Promise<void> {
-        return this.transactionService.updateTransaction(userId, transactionId, accountId, updates, accounts);
-    }
+    ): Promise<void> {}
 }
 
killedBy: FinanceService Transaction Operations updateTransaction delegates to TransactionService.updateTransaction with correct arguments
statusReason: expected "vi.fn()" to be called with arguments: [ 'user-tx-update', 'tx-456', …(3) ]

Number of calls: 0
