[Killed] ObjectLiteral
src/services/fabric/behaviorEngineUtils.ts:23:25
 export const CONFIRMED_THRESHOLD = 0.5;
 
 export function toSignature(trigger: PatternTrigger, action: PatternAction): string {
-  return JSON.stringify({
-    triggerType: trigger.type,
-    trigger,
-    actionType: action.type,
-    action,
-  });
+  return JSON.stringify({});
 }
 
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/services/fabric/behaviorEngineUtils.ts:36:39
   dismissed: number,
   recentOccurrences: number
 ): number {
-  const baseConfidence = frequency / (frequency + dismissed + 2);
+  const baseConfidence = frequency / (frequency + dismissed - 2);
   const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
   const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected 1 to be greater than 1

[Killed] ArithmeticOperator
src/services/fabric/behaviorEngineUtils.ts:36:26
   dismissed: number,
   recentOccurrences: number
 ): number {
-  const baseConfidence = frequency / (frequency + dismissed + 2);
+  const baseConfidence = frequency * (frequency + dismissed + 2);
   const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
   const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected 1 to be greater than 1

[Killed] EqualityOperator
src/services/fabric/behaviorEngineUtils.ts:37:24
   recentOccurrences: number
 ): number {
   const baseConfidence = frequency / (frequency + dismissed + 2);
-  const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
+  const recencyBoost = frequency <= 0 ? recentOccurrences / frequency : 0;
   const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
   return Math.max(0, Math.min(1, Number(weighted.toFixed(4))));
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] ConditionalExpression
src/services/fabric/behaviorEngineUtils.ts:37:24
   recentOccurrences: number
 ): number {
   const baseConfidence = frequency / (frequency + dismissed + 2);
-  const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
+  const recencyBoost = false ? recentOccurrences / frequency : 0;
   const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
   return Math.max(0, Math.min(1, Number(weighted.toFixed(4))));
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0.35 to be greater than 0.4

[Killed] ArithmeticOperator
src/services/fabric/behaviorEngineUtils.ts:38:20
 ): number {
   const baseConfidence = frequency / (frequency + dismissed + 2);
   const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
-  const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
+  const weighted = baseConfidence / (0.7 + 0.3 * recencyBoost);
   return Math.max(0, Math.min(1, Number(weighted.toFixed(4))));
 }
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected 0.6 to be greater than 1

[Killed] ArithmeticOperator
src/services/fabric/behaviorEngineUtils.ts:38:44
 ): number {
   const baseConfidence = frequency / (frequency + dismissed + 2);
   const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
-  const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
+  const weighted = baseConfidence * (0.7 + 0.3 / recencyBoost);
   return Math.max(0, Math.min(1, Number(weighted.toFixed(4))));
 }
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected 0.6 to be greater than 1

[Killed] MethodExpression
src/services/fabric/behaviorEngineUtils.ts:39:22
   const baseConfidence = frequency / (frequency + dismissed + 2);
   const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
   const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
-  return Math.max(0, Math.min(1, Number(weighted.toFixed(4))));
+  return Math.max(0, Math.max(1, Number(weighted.toFixed(4))));
 }
 
killedBy: BehavioralEngine gives higher confidence to more recent patterns
statusReason: expected 1 to be greater than 1

[Killed] MethodExpression
src/services/fabric/behaviorEngineUtils.ts:39:10
   const baseConfidence = frequency / (frequency + dismissed + 2);
   const recencyBoost = frequency > 0 ? recentOccurrences / frequency : 0;
   const weighted = baseConfidence * (0.7 + 0.3 * recencyBoost);
-  return Math.max(0, Math.min(1, Number(weighted.toFixed(4))));
+  return Math.min(0, Math.min(1, Number(weighted.toFixed(4))));
 }
 
killedBy: BehavioralEngine records new pattern and increments frequency on repeats
statusReason: expected 0 to be greater than 0.4
