[Killed] ArrowFunction
src/services/fabric/seedPatterns.ts:5:50
 import { calculateConfidence } from './behaviorEngineUtils';
 
 function buildFinancePatterns(transactions: AnchorTransaction[], nowIso: string): UserPattern[] {
-  const activeTransactions = transactions.filter((tx) => !tx.isSoftDeleted && tx.type === 'expense');
+  const activeTransactions = transactions.filter(() => undefined);
   const categoryCount = new Map<string, number>();
 
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/services/fabric/seedPatterns.ts:5:58
 import { calculateConfidence } from './behaviorEngineUtils';
 
 function buildFinancePatterns(transactions: AnchorTransaction[], nowIso: string): UserPattern[] {
-  const activeTransactions = transactions.filter((tx) => !tx.isSoftDeleted && tx.type === 'expense');
+  const activeTransactions = transactions.filter((tx) => tx.isSoftDeleted && tx.type === 'expense');
   const categoryCount = new Map<string, number>();
 
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/fabric/seedPatterns.ts:8:40
   const activeTransactions = transactions.filter((tx) => !tx.isSoftDeleted && tx.type === 'expense');
   const categoryCount = new Map<string, number>();
 
-  for (const tx of activeTransactions) {
-    const key = tx.category || 'General';
-    categoryCount.set(key, (categoryCount.get(key) ?? 0) + 1);
-  }
+  for (const tx of activeTransactions) {}
 
   const patterns: UserPattern[] = [];
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/services/fabric/seedPatterns.ts:9:17
   const categoryCount = new Map<string, number>();
 
   for (const tx of activeTransactions) {
-    const key = tx.category || 'General';
+    const key = tx.category && 'General';
     categoryCount.set(key, (categoryCount.get(key) ?? 0) + 1);
   }

[Killed] ArithmeticOperator
src/services/fabric/seedPatterns.ts:10:28
 
   for (const tx of activeTransactions) {
     const key = tx.category || 'General';
-    categoryCount.set(key, (categoryCount.get(key) ?? 0) + 1);
+    categoryCount.set(key, (categoryCount.get(key) ?? 0) - 1);
   }
 
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/services/fabric/seedPatterns.ts:14:60
   }
 
   const patterns: UserPattern[] = [];
-  for (const [category, count] of categoryCount.entries()) {
-    if (count < 2) continue;
-    patterns.push({
-      id: `seed-finance-${category.toLowerCase().replace(/\s+/g, '-')}`,
-      trigger: { type: 'transaction_recorded', category },
-      followUpAction: { type: 'review_budget', category },
-      frequency: count,
-      confidence: Math.max(0.55, calculateConfidence(count, 0, count)),
-      lastOccurred: nowIso,
-      averageDelayMs: 0,
-      dismissed: 0,
-      createdAt: nowIso,
-      updatedAt: nowIso,
-    });
-  }
+  for (const [category, count] of categoryCount.entries()) {}
 
   return patterns;
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/seedPatterns.ts:15:9
 
   const patterns: UserPattern[] = [];
   for (const [category, count] of categoryCount.entries()) {
-    if (count < 2) continue;
+    if (count >= 2) continue;
     patterns.push({
       id: `seed-finance-${category.toLowerCase().replace(/\s+/g, '-')}`,
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/seedPatterns.ts:15:9
 
   const patterns: UserPattern[] = [];
   for (const [category, count] of categoryCount.entries()) {
-    if (count < 2) continue;
+    if (true) continue;
     patterns.push({
       id: `seed-finance-${category.toLowerCase().replace(/\s+/g, '-')}`,
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/services/fabric/seedPatterns.ts:17:27
   for (const [category, count] of categoryCount.entries()) {
     if (count < 2) continue;
     patterns.push({
-      id: `seed-finance-${category.toLowerCase().replace(/\s+/g, '-')}`,
+      id: `seed-finance-${category.toUpperCase().replace(/\s+/g, '-')}`,
       trigger: { type: 'transaction_recorded', category },
       followUpAction: { type: 'review_budget', category },

[Survived] Regex
src/services/fabric/seedPatterns.ts:17:58
   for (const [category, count] of categoryCount.entries()) {
     if (count < 2) continue;
     patterns.push({
-      id: `seed-finance-${category.toLowerCase().replace(/\s+/g, '-')}`,
+      id: `seed-finance-${category.toLowerCase().replace(/\S+/g, '-')}`,
       trigger: { type: 'transaction_recorded', category },
       followUpAction: { type: 'review_budget', category },

[Survived] MethodExpression
src/services/fabric/seedPatterns.ts:21:19
       trigger: { type: 'transaction_recorded', category },
       followUpAction: { type: 'review_budget', category },
       frequency: count,
-      confidence: Math.max(0.55, calculateConfidence(count, 0, count)),
+      confidence: Math.min(0.55, calculateConfidence(count, 0, count)),
       lastOccurred: nowIso,
       averageDelayMs: 0,

[Survived] MethodExpression
src/services/fabric/seedPatterns.ts:34:28
 }
 
 function buildCommitmentPatterns(commitments: AnchorTask[], nowIso: string): UserPattern[] {
-  const commitmentByTime = commitments
-    .filter((task) => task.completed && task.timeOfDay && task.timeOfDay !== 'any')
+  const commitmentByTime = commitments
     .reduce<Record<string, number>>((acc, task) => {
       const key = task.timeOfDay as string;

[Killed] EqualityOperator
src/services/fabric/seedPatterns.ts:35:59
 
 function buildCommitmentPatterns(commitments: AnchorTask[], nowIso: string): UserPattern[] {
   const commitmentByTime = commitments
-    .filter((task) => task.completed && task.timeOfDay && task.timeOfDay !== 'any')
+    .filter((task) => task.completed && task.timeOfDay && task.timeOfDay === 'any')
     .reduce<Record<string, number>>((acc, task) => {
       const key = task.timeOfDay as string;
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/services/fabric/seedPatterns.ts:35:13
 
 function buildCommitmentPatterns(commitments: AnchorTask[], nowIso: string): UserPattern[] {
   const commitmentByTime = commitments
-    .filter((task) => task.completed && task.timeOfDay && task.timeOfDay !== 'any')
+    .filter(() => undefined)
     .reduce<Record<string, number>>((acc, task) => {
       const key = task.timeOfDay as string;
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/seedPatterns.ts:38:18
     .filter((task) => task.completed && task.timeOfDay && task.timeOfDay !== 'any')
     .reduce<Record<string, number>>((acc, task) => {
       const key = task.timeOfDay as string;
-      acc[key] = (acc[key] ?? 0) + 1;
+      acc[key] = (acc[key] ?? 0) - 1;
       return acc;
     }, {});
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/services/fabric/seedPatterns.ts:38:19
     .filter((task) => task.completed && task.timeOfDay && task.timeOfDay !== 'any')
     .reduce<Record<string, number>>((acc, task) => {
       const key = task.timeOfDay as string;
-      acc[key] = (acc[key] ?? 0) + 1;
+      acc[key] = (acc[key] && 0) + 1;
       return acc;
     }, {});

[Survived] ObjectLiteral
src/services/fabric/seedPatterns.ts:42:51
       return acc;
     }, {});
 
-  const hourByTimeOfDay: Record<string, number> = {
-    morning: 8,
-    afternoon: 14,
-    evening: 18,
-  };
+  const hourByTimeOfDay: Record<string, number> = {};
 
   const patterns: UserPattern[] = [];

[Killed] BlockStatement
src/services/fabric/seedPatterns.ts:49:70
   };
 
   const patterns: UserPattern[] = [];
-  for (const [timeOfDay, count] of Object.entries(commitmentByTime)) {
-    if (count < 2) continue;
-    const trigger: PatternTrigger = { type: 'time_of_day', hour: hourByTimeOfDay[timeOfDay] ?? 9 };
-    patterns.push({
-      id: `seed-commitment-${timeOfDay}`,
-      trigger,
-      followUpAction: { type: 'check_commitment' },
-      frequency: count,
-      confidence: Math.max(0.55, calculateConfidence(count, 0, count)),
-      lastOccurred: nowIso,
-      averageDelayMs: 0,
-      dismissed: 0,
-      createdAt: nowIso,
-      updatedAt: nowIso,
-    });
-  }
+  for (const [timeOfDay, count] of Object.entries(commitmentByTime)) {}
 
   return patterns;
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/seedPatterns.ts:50:9
 
   const patterns: UserPattern[] = [];
   for (const [timeOfDay, count] of Object.entries(commitmentByTime)) {
-    if (count < 2) continue;
+    if (count <= 2) continue;
     const trigger: PatternTrigger = { type: 'time_of_day', hour: hourByTimeOfDay[timeOfDay] ?? 9 };
     patterns.push({
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/services/fabric/seedPatterns.ts:50:9
 
   const patterns: UserPattern[] = [];
   for (const [timeOfDay, count] of Object.entries(commitmentByTime)) {
-    if (count < 2) continue;
+    if (count >= 2) continue;
     const trigger: PatternTrigger = { type: 'time_of_day', hour: hourByTimeOfDay[timeOfDay] ?? 9 };
     patterns.push({
killedBy: BehavioralEngine seeds patterns from existing transaction and commitment history
statusReason: expected false to be true // Object.is equality

[Survived] LogicalOperator
src/services/fabric/seedPatterns.ts:51:66
   const patterns: UserPattern[] = [];
   for (const [timeOfDay, count] of Object.entries(commitmentByTime)) {
     if (count < 2) continue;
-    const trigger: PatternTrigger = { type: 'time_of_day', hour: hourByTimeOfDay[timeOfDay] ?? 9 };
+    const trigger: PatternTrigger = { type: 'time_of_day', hour: hourByTimeOfDay[timeOfDay] && 9 };
     patterns.push({
       id: `seed-commitment-${timeOfDay}`,
