[Killed] StringLiteral
src/utils/error.ts:15:21
 
     constructor(message: string, category: ErrorCategory = 'UNKNOWN', originalError?: unknown) {
         super(message);
-        this.name = 'AnchorError';
+        this.name = "";
         this.category = category;
         this.userMessage = message;
killedBy: AnchorError creates with message and default category
statusReason: expected '' to be 'AnchorError' // Object.is equality

[Survived] BlockStatement
src/utils/error.ts:21:92
         this.originalError = originalError;
 
         // Ensure stack trace is captured correctly (V8-specific API)
-        if ('captureStackTrace' in Error && typeof Error.captureStackTrace === 'function') {
-            Error.captureStackTrace(this, AnchorError);
-        }
+        if ('captureStackTrace' in Error && typeof Error.captureStackTrace === 'function') {}
     }
 

[Killed] StringLiteral
src/utils/error.ts:46:71
  * Global error handler utility
  * Logs to console AND reports to Sentry with full context
  */
-export const handleError = (error: unknown, fallbackMessage: string = 'An unexpected error occurred'): AnchorError => {
+export const handleError = (error: unknown, fallbackMessage: string = ""): AnchorError => {
     if (AnchorError.isAnchorError(error)) {
         console.error(`[${error.category}] ${error.message}`, error.originalError);
killedBy: handleError uses default fallback when none provided
statusReason: expected '' to be 'An unexpected error occurred' // Object.is equality

[Killed] BlockStatement
src/utils/error.ts:47:43
  * Logs to console AND reports to Sentry with full context
  */
 export const handleError = (error: unknown, fallbackMessage: string = 'An unexpected error occurred'): AnchorError => {
-    if (AnchorError.isAnchorError(error)) {
-        console.error(`[${error.category}] ${error.message}`, error.originalError);
-
-        Sentry.captureException(error.originalError || error, {
-            level: SENTRY_LEVEL[error.category],
-            tags: { category: error.category },
-            extra: {
-                userMessage: error.userMessage,
-                originalError: error.originalError instanceof Error ? error.originalError.message : error.originalError,
-            },
-        });
-        return error;
-    }
+    if (AnchorError.isAnchorError(error)) {}
 
     console.error('[UNKNOWN]', error);
killedBy: handleError returns the same AnchorError if already wrapped
statusReason: expected AnchorError: An unexpected error occurred { …(3) } to be AnchorError: auth failed { …(3) } // Object.is equality

[Killed] ConditionalExpression
src/utils/error.ts:50:33
     if (AnchorError.isAnchorError(error)) {
         console.error(`[${error.category}] ${error.message}`, error.originalError);
 
-        Sentry.captureException(error.originalError || error, {
+        Sentry.captureException(false, {
             level: SENTRY_LEVEL[error.category],
             tags: { category: error.category },
killedBy: handleError reports AnchorError to Sentry with correct level
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

@@ -1,14 +1,12 @@
  [

[Killed] LogicalOperator
src/utils/error.ts:50:33
     if (AnchorError.isAnchorError(error)) {
         console.error(`[${error.category}] ${error.message}`, error.originalError);
 
-        Sentry.captureException(error.originalError || error, {
+        Sentry.captureException(error.originalError && error, {
             level: SENTRY_LEVEL[error.category],
             tags: { category: error.category },
killedBy: handleError reports AnchorError to Sentry with correct level
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

@@ -1,14 +1,12 @@
  [

[Survived] ObjectLiteral
src/utils/error.ts:53:20
         Sentry.captureException(error.originalError || error, {
             level: SENTRY_LEVEL[error.category],
             tags: { category: error.category },
-            extra: {
-                userMessage: error.userMessage,
-                originalError: error.originalError instanceof Error ? error.originalError.message : error.originalError,
-            },
+            extra: {},
         });
         return error;

[Killed] ObjectLiteral
src/utils/error.ts:64:36
     console.error('[UNKNOWN]', error);
 
     const wrapped = new AnchorError(fallbackMessage, 'UNKNOWN', error);
-    Sentry.captureException(error, {
-        level: 'error',
-        tags: { category: 'UNKNOWN' },
-        extra: { fallbackMessage },
-    });
+    Sentry.captureException(error, {});
     return wrapped;
 };
killedBy: handleError reports plain errors to Sentry as UNKNOWN
statusReason: expected "vi.fn()" to be called with arguments: [ Any<Error>, ObjectContaining{…} ]

Received: 

  1st vi.fn() call:

  [
-   Any<Error>,

[Survived] ObjectLiteral
src/utils/error.ts:67:16
     Sentry.captureException(error, {
         level: 'error',
         tags: { category: 'UNKNOWN' },
-        extra: { fallbackMessage },
+        extra: {},
     });
     return wrapped;

[Killed] BlockStatement
src/utils/error.ts:83:105
  *   showToast('Failed to save', 'error');
  * }
  */
-export const captureError = (error: unknown, context: string, extra?: Record<string, unknown>): void => {
-    const err = error instanceof Error ? error : new Error(String(error));
-    Sentry.captureException(err, {
-        level: AnchorError.isAnchorError(error) ? SENTRY_LEVEL[error.category] : 'error',
-        tags: {
-            context,
-            category: AnchorError.isAnchorError(error) ? error.category : 'UNKNOWN',
-        },
-        extra: {
-            ...extra,
-            originalMessage: err.message,
-        },
-    });
-};
+export const captureError = (error: unknown, context: string, extra?: Record<string, unknown>): void => {};
 
killedBy: captureError sends Error to Sentry with context tag
statusReason: expected "vi.fn()" to be called with arguments: [ Error: fetch failed, …(1) ]

Number of calls: 0

[Killed] ObjectLiteral
src/utils/error.ts:85:34
  */
 export const captureError = (error: unknown, context: string, extra?: Record<string, unknown>): void => {
     const err = error instanceof Error ? error : new Error(String(error));
-    Sentry.captureException(err, {
-        level: AnchorError.isAnchorError(error) ? SENTRY_LEVEL[error.category] : 'error',
-        tags: {
-            context,
-            category: AnchorError.isAnchorError(error) ? error.category : 'UNKNOWN',
-        },
-        extra: {
-            ...extra,
-            originalMessage: err.message,
-        },
-    });
+    Sentry.captureException(err, {});
 };
 
killedBy: captureError sends Error to Sentry with context tag
statusReason: expected "vi.fn()" to be called with arguments: [ Error: fetch failed, …(1) ]

Received: 

  1st vi.fn() call:

  [
    Error {

[Survived] StringLiteral
src/utils/error.ts:89:75
         level: AnchorError.isAnchorError(error) ? SENTRY_LEVEL[error.category] : 'error',
         tags: {
             context,
-            category: AnchorError.isAnchorError(error) ? error.category : 'UNKNOWN',
+            category: AnchorError.isAnchorError(error) ? error.category : "",
         },
         extra: {
