[Killed] EqualityOperator
src/utils/moneyUtils.ts:19:33
         const commaCount = (cleaned.match(/,/g) || []).length;
         const periodCount = (cleaned.match(/\./g) || []).length;
 
-        if (commaCount === 1 && periodCount === 0) {
+        if (commaCount === 1 && periodCount !== 0) {
             // European notation: "10,50" -> "10.50"
             cleaned = cleaned.replace(',', '.');
killedBy: TransactionForm (Transfers) submits a valid cross-currency transfer
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] EqualityOperator
src/utils/moneyUtils.ts:19:13
         const commaCount = (cleaned.match(/,/g) || []).length;
         const periodCount = (cleaned.match(/\./g) || []).length;
 
-        if (commaCount === 1 && periodCount === 0) {
+        if (commaCount !== 1 && periodCount === 0) {
             // European notation: "10,50" -> "10.50"
             cleaned = cleaned.replace(',', '.');
killedBy: moneyUtils parseInputToCents handles comma-first European-style input if accidentally passed
statusReason: expected 105000 to be 1050 // Object.is equality

[Killed] BlockStatement
src/utils/moneyUtils.ts:22:16
         if (commaCount === 1 && periodCount === 0) {
             // European notation: "10,50" -> "10.50"
             cleaned = cleaned.replace(',', '.');
-        } else {
-            // US notation: "1,000.50" -> remove thousand separators
-            cleaned = cleaned.replace(/,/g, '');
-        }
+        } else {}
 
         const parsed = parseFloat(cleaned);
killedBy: TransactionForm (Transfers) submits a valid cross-currency transfer
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
src/utils/moneyUtils.ts:28:47
         }
 
         const parsed = parseFloat(cleaned);
-        return isNaN(parsed) ? 0 : Math.round(parsed * 100);
+        return isNaN(parsed) ? 0 : Math.round(parsed / 100);
     }
     return Math.round(displayAmount * 100);
killedBy: TransactionForm (Transfers) submits a valid same-currency transfer
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ArithmeticOperator
src/utils/moneyUtils.ts:30:23
         const parsed = parseFloat(cleaned);
         return isNaN(parsed) ? 0 : Math.round(parsed * 100);
     }
-    return Math.round(displayAmount * 100);
+    return Math.round(displayAmount / 100);
 };
 
killedBy: moneyUtils toCents converts display amounts to cents
statusReason: expected +0 to be 1050 // Object.is equality

[Killed] ConditionalExpression
src/utils/moneyUtils.ts:37:9
  * Convert storage cents (1050) to display amount (10.50)
  */
 export const fromCents = (cents: number): number => {
-    if (!cents) return 0;
+    if (true) return 0;
     return cents / 100;
 };
killedBy: TransactionForm (Transfers) submits a valid same-currency transfer
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BooleanLiteral
src/utils/moneyUtils.ts:37:9
  * Convert storage cents (1050) to display amount (10.50)
  */
 export const fromCents = (cents: number): number => {
-    if (!cents) return 0;
+    if (cents) return 0;
     return cents / 100;
 };
killedBy: calculateNetWorth sums NGN accounts correctly (cents → display)
statusReason: expected +0 to be 3000 // Object.is equality

[Killed] ArithmeticOperator
src/utils/moneyUtils.ts:38:12
  */
 export const fromCents = (cents: number): number => {
     if (!cents) return 0;
-    return cents / 100;
+    return cents * 100;
 };
 
killedBy: FinanceView Account Rendering displays account balances with correct currency formatting
statusReason: Unable to find an element with the text: /\$5,000\.00/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="relative space-y-8"
    >

[Killed] EqualityOperator
src/utils/moneyUtils.ts:46:20
  */
 export const formatMoney = (cents: number, currency: 'USD' | 'NGN' = 'USD'): string => {
     const amount = fromCents(cents);
-    const symbol = currency === 'NGN' ? '₦' : '$';
+    const symbol = currency !== 'NGN' ? '₦' : '$';
     return `${symbol}${amount.toLocaleString('en-US', { minimumFractionDigits: 2, maximumFractionDigits: 2 })}`;
 };
killedBy: moneyUtils formatMoney formats USD correctly
statusReason: expected '₦10.50' to be '$10.50' // Object.is equality

[Killed] ConditionalExpression
src/utils/moneyUtils.ts:46:20
  */
 export const formatMoney = (cents: number, currency: 'USD' | 'NGN' = 'USD'): string => {
     const amount = fromCents(cents);
-    const symbol = currency === 'NGN' ? '₦' : '$';
+    const symbol = false ? '₦' : '$';
     return `${symbol}${amount.toLocaleString('en-US', { minimumFractionDigits: 2, maximumFractionDigits: 2 })}`;
 };
killedBy: moneyUtils formatMoney formats NGN correctly
statusReason: expected '$10.50' to be '₦10.50' // Object.is equality

[Killed] ArithmeticOperator
src/utils/moneyUtils.ts:54:12
  * Safely add two money amounts (in cents)
  */
 export const addMoney = (a: number, b: number): number => {
-    return a + b;
+    return a - b;
 };
 
killedBy: moneyUtils addMoney / subtractMoney safely adds money
statusReason: expected 800 to be 1300 // Object.is equality

[Killed] ArithmeticOperator
src/utils/moneyUtils.ts:61:12
  * Safely subtract money amounts (in cents)
  */
 export const subtractMoney = (a: number, b: number): number => {
-    return a - b;
+    return a + b;
 };
 
killedBy: moneyUtils addMoney / subtractMoney safely subtracts money
statusReason: expected 1300 to be 800 // Object.is equality
