[Killed] BlockStatement
src/utils/offlineQueue.ts:23:108
     return Array.isArray(data) ? data : [];
 }
 
-export async function enqueueTransaction(userId: string, payload: CreateTransactionPayload): Promise<void> {
-    const queue = await readQueue();
-    const entry: QueueEntry = {
-        id: crypto.randomUUID(),
-        userId,
-        payload,
-        createdAt: new Date().toISOString(),
-    };
-    queue.push(entry);
-    await set(IDB_KEY, queue);
-}
+export async function enqueueTransaction(userId: string, payload: CreateTransactionPayload): Promise<void> {}
 
 export async function getQueueLength(): Promise<number> {
killedBy: offlineQueue enqueueTransaction adds a transaction to an empty queue
statusReason: expected "vi.fn()" to be called with arguments: [ 'anchor_offline_queue', …(1) ]

Number of calls: 0

[Killed] ConditionalExpression
src/utils/offlineQueue.ts:43:9
     processor: (entry: QueueEntry) => Promise<void>,
 ): Promise<ProcessResult> {
     const queue = await readQueue();
-    if (queue.length === 0) return { succeeded: 0, failed: 0 };
+    if (true) return { succeeded: 0, failed: 0 };
 
     const failed: QueueEntry[] = [];
killedBy: offlineQueue processQueue calls the processor for each queued entry and clears on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] EqualityOperator
src/utils/offlineQueue.ts:43:9
     processor: (entry: QueueEntry) => Promise<void>,
 ): Promise<ProcessResult> {
     const queue = await readQueue();
-    if (queue.length === 0) return { succeeded: 0, failed: 0 };
+    if (queue.length !== 0) return { succeeded: 0, failed: 0 };
 
     const failed: QueueEntry[] = [];
killedBy: offlineQueue processQueue calls the processor for each queued entry and clears on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/utils/offlineQueue.ts:48:32
     const failed: QueueEntry[] = [];
     let succeeded = 0;
 
-    for (const entry of queue) {
-        try {
-            await processor(entry);
-            succeeded++;
-        } catch {
-            failed.push(entry);
-        }
-    }
+    for (const entry of queue) {}
 
     await set(IDB_KEY, failed);
killedBy: offlineQueue processQueue calls the processor for each queued entry and clears on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/utils/offlineQueue.ts:49:13
     let succeeded = 0;
 
     for (const entry of queue) {
-        try {
-            await processor(entry);
-            succeeded++;
-        } catch {
+        try {} catch {
             failed.push(entry);
         }
killedBy: offlineQueue processQueue calls the processor for each queued entry and clears on success
statusReason: expected "vi.fn()" to be called 2 times, but got 0 times

[Killed] UpdateOperator
src/utils/offlineQueue.ts:51:13
     for (const entry of queue) {
         try {
             await processor(entry);
-            succeeded++;
+            succeeded--;
         } catch {
             failed.push(entry);
killedBy: offlineQueue processQueue calls the processor for each queued entry and clears on success
statusReason: expected -2 to be 2 // Object.is equality

[Killed] BlockStatement
src/utils/offlineQueue.ts:52:17
         try {
             await processor(entry);
             succeeded++;
-        } catch {
-            failed.push(entry);
-        }
+        } catch {}
     }
 
killedBy: offlineQueue processQueue retains failed entries in queue
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/utils/offlineQueue.ts:61:51
     return { succeeded, failed: failed.length };
 }
 
-export async function clearQueue(): Promise<void> {
-    await del(IDB_KEY);
-}
+export async function clearQueue(): Promise<void> {}
 
killedBy: offlineQueue clearQueue removes all entries from IndexedDB
statusReason: expected "vi.fn()" to be called with arguments: [ 'anchor_offline_queue' ]

Number of calls: 0
