[Killed] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:14:16
 
 function startOfWeek(now: Date): Date {
   const copy = new Date(now);
-  copy.setDate(copy.getDate() - 6);
+  copy.setDate(copy.getDate() + 6);
   copy.setHours(0, 0, 0, 0);
   return copy;
killedBy: FabricService builds predictions and weekly report
statusReason: expected +0 to be 1500 // Object.is equality

[Survived] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:14:3
 
 function startOfWeek(now: Date): Date {
   const copy = new Date(now);
-  copy.setDate(copy.getDate() - 6);
+  copy.setTime(copy.getDate() - 6);
   copy.setHours(0, 0, 0, 0);
   return copy;

[Killed] ArrowFunction
src/services/fabric/WeeklyReportEngine.ts:24:54
   const weekEnd = new Date(input.now);
   weekEnd.setHours(23, 59, 59, 999);
 
-  const weekTransactions = input.transactions.filter((tx) =>
-    withinRange(tx.date, weekStart, weekEnd),
+  const weekTransactions = input.transactions.filter(() => undefined,
   );
   const weekCommitments = input.commitments.filter((task) =>
killedBy: FabricService builds predictions and weekly report
statusReason: expected +0 to be 1500 // Object.is equality

[Survived] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:24:28
   const weekEnd = new Date(input.now);
   weekEnd.setHours(23, 59, 59, 999);
 
-  const weekTransactions = input.transactions.filter((tx) =>
-    withinRange(tx.date, weekStart, weekEnd),
-  );
+  const weekTransactions = input.transactions;
   const weekCommitments = input.commitments.filter((task) =>
     withinRange(task.createdAt ?? null, weekStart, weekEnd),

[Killed] ArrowFunction
src/services/fabric/WeeklyReportEngine.ts:27:52
   const weekTransactions = input.transactions.filter((tx) =>
     withinRange(tx.date, weekStart, weekEnd),
   );
-  const weekCommitments = input.commitments.filter((task) =>
-    withinRange(task.createdAt ?? null, weekStart, weekEnd),
+  const weekCommitments = input.commitments.filter(() => undefined,
   );
 
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 50 // Object.is equality

[Survived] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:27:27
   const weekTransactions = input.transactions.filter((tx) =>
     withinRange(tx.date, weekStart, weekEnd),
   );
-  const weekCommitments = input.commitments.filter((task) =>
-    withinRange(task.createdAt ?? null, weekStart, weekEnd),
-  );
+  const weekCommitments = input.commitments;
 
   const currency = detectPrimaryCurrency(input.transactions);

[Killed] LogicalOperator
src/services/fabric/WeeklyReportEngine.ts:28:17
     withinRange(tx.date, weekStart, weekEnd),
   );
   const weekCommitments = input.commitments.filter((task) =>
-    withinRange(task.createdAt ?? null, weekStart, weekEnd),
+    withinRange(task.createdAt && null, weekStart, weekEnd),
   );
 
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 50 // Object.is equality

[Killed] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:33:27
 
   const currency = detectPrimaryCurrency(input.transactions);
 
-  const totalSpentCents = weekTransactions
-    .filter((tx) => tx.type === 'expense')
+  const totalSpentCents = weekTransactions
     .reduce((sum, tx) => sum + tx.amountCents, 0);
   const totalIncomeCents = weekTransactions
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected 2050 to be 50 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:34:21
   const currency = detectPrimaryCurrency(input.transactions);
 
   const totalSpentCents = weekTransactions
-    .filter((tx) => tx.type === 'expense')
+    .filter((tx) => true)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
   const totalIncomeCents = weekTransactions
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected 2050 to be 50 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:34:21
   const currency = detectPrimaryCurrency(input.transactions);
 
   const totalSpentCents = weekTransactions
-    .filter((tx) => tx.type === 'expense')
+    .filter((tx) => false)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
   const totalIncomeCents = weekTransactions
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 50 // Object.is equality

[Killed] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:36:28
   const totalSpentCents = weekTransactions
     .filter((tx) => tx.type === 'expense')
     .reduce((sum, tx) => sum + tx.amountCents, 0);
-  const totalIncomeCents = weekTransactions
-    .filter((tx) => tx.type === 'income')
+  const totalIncomeCents = weekTransactions
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected 2050 to be 2000 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:37:21
     .filter((tx) => tx.type === 'expense')
     .reduce((sum, tx) => sum + tx.amountCents, 0);
   const totalIncomeCents = weekTransactions
-    .filter((tx) => tx.type === 'income')
+    .filter((tx) => true)
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected 2050 to be 2000 // Object.is equality

[Killed] EqualityOperator
src/services/fabric/WeeklyReportEngine.ts:37:21
     .filter((tx) => tx.type === 'expense')
     .reduce((sum, tx) => sum + tx.amountCents, 0);
   const totalIncomeCents = weekTransactions
-    .filter((tx) => tx.type === 'income')
+    .filter((tx) => tx.type !== 'income')
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected 50 to be 2000 // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:38:26
     .reduce((sum, tx) => sum + tx.amountCents, 0);
   const totalIncomeCents = weekTransactions
     .filter((tx) => tx.type === 'income')
-    .reduce((sum, tx) => sum + tx.amountCents, 0);
+    .reduce((sum, tx) => sum - tx.amountCents, 0);
 
   const topCategoryMap = sumByCategory(weekTransactions.filter((tx) => tx.type === 'expense'));
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected -2000 to be 2000 // Object.is equality

[Survived] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:40:40
     .filter((tx) => tx.type === 'income')
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  const topCategoryMap = sumByCategory(weekTransactions.filter((tx) => tx.type === 'expense'));
+  const topCategoryMap = sumByCategory(weekTransactions);
   const [topCategoryName, topCategoryValue] = Object.entries(topCategoryMap)
     .sort((a, b) => b[1] - a[1])

[Survived] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:40:72
     .filter((tx) => tx.type === 'income')
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
-  const topCategoryMap = sumByCategory(weekTransactions.filter((tx) => tx.type === 'expense'));
+  const topCategoryMap = sumByCategory(weekTransactions.filter((tx) => false));
   const [topCategoryName, topCategoryValue] = Object.entries(topCategoryMap)
     .sort((a, b) => b[1] - a[1])

[Survived] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:41:47
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   const topCategoryMap = sumByCategory(weekTransactions.filter((tx) => tx.type === 'expense'));
-  const [topCategoryName, topCategoryValue] = Object.entries(topCategoryMap)
-    .sort((a, b) => b[1] - a[1])
+  const [topCategoryName, topCategoryValue] = Object.entries(topCategoryMap)
     .at(0) ?? ['General', 0];
 

[NoCoverage] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:42:21
 
   const topCategoryMap = sumByCategory(weekTransactions.filter((tx) => tx.type === 'expense'));
   const [topCategoryName, topCategoryValue] = Object.entries(topCategoryMap)
-    .sort((a, b) => b[1] - a[1])
+    .sort((a, b) => b[1] + a[1])
     .at(0) ?? ['General', 0];
 

[NoCoverage] StringLiteral
src/services/fabric/WeeklyReportEngine.ts:43:16
   const topCategoryMap = sumByCategory(weekTransactions.filter((tx) => tx.type === 'expense'));
   const [topCategoryName, topCategoryValue] = Object.entries(topCategoryMap)
     .sort((a, b) => b[1] - a[1])
-    .at(0) ?? ['General', 0];
+    .at(0) ?? ["", 0];
 
   // ── vsLastWeek: compare total spend to the previous 7-day window ────────────

[Survived] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:47:30
 
   // ── vsLastWeek: compare total spend to the previous 7-day window ────────────
   const { start: prevStart, end: prevEnd } = previousWeekRange(weekStart, weekEnd);
-  const lastWeekSpentCents = input.transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd))
+  const lastWeekSpentCents = input.transactions
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] EqualityOperator
src/services/fabric/WeeklyReportEngine.ts:48:21
   // ── vsLastWeek: compare total spend to the previous 7-day window ────────────
   const { start: prevStart, end: prevEnd } = previousWeekRange(weekStart, weekEnd);
   const lastWeekSpentCents = input.transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd))
+    .filter((tx) => tx.type !== 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[Survived] LogicalOperator
src/services/fabric/WeeklyReportEngine.ts:48:21
   // ── vsLastWeek: compare total spend to the previous 7-day window ────────────
   const { start: prevStart, end: prevEnd } = previousWeekRange(weekStart, weekEnd);
   const lastWeekSpentCents = input.transactions
-    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd))
+    .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted || withinRange(tx.date, prevStart, prevEnd))
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 

[NoCoverage] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:49:26
   const { start: prevStart, end: prevEnd } = previousWeekRange(weekStart, weekEnd);
   const lastWeekSpentCents = input.transactions
     .filter((tx) => tx.type === 'expense' && !tx.isSoftDeleted && withinRange(tx.date, prevStart, prevEnd))
-    .reduce((sum, tx) => sum + tx.amountCents, 0);
+    .reduce((sum, tx) => sum - tx.amountCents, 0);
 
   const vsLastWeek =

[Survived] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:52:5
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   const vsLastWeek =
-    lastWeekSpentCents > 0
+    true
       ? Number((((totalSpentCents - lastWeekSpentCents) / lastWeekSpentCents) * 100).toFixed(1))
       : 0;

[Survived] EqualityOperator
src/services/fabric/WeeklyReportEngine.ts:52:5
     .reduce((sum, tx) => sum + tx.amountCents, 0);
 
   const vsLastWeek =
-    lastWeekSpentCents > 0
+    lastWeekSpentCents >= 0
       ? Number((((totalSpentCents - lastWeekSpentCents) / lastWeekSpentCents) * 100).toFixed(1))
       : 0;

[NoCoverage] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:53:19
 
   const vsLastWeek =
     lastWeekSpentCents > 0
-      ? Number((((totalSpentCents - lastWeekSpentCents) / lastWeekSpentCents) * 100).toFixed(1))
+      ? Number((((totalSpentCents + lastWeekSpentCents) / lastWeekSpentCents) * 100).toFixed(1))
       : 0;
 

[NoCoverage] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:53:17
 
   const vsLastWeek =
     lastWeekSpentCents > 0
-      ? Number((((totalSpentCents - lastWeekSpentCents) / lastWeekSpentCents) * 100).toFixed(1))
+      ? Number(((totalSpentCents - lastWeekSpentCents) / lastWeekSpentCents / 100).toFixed(1))
       : 0;
 

[Killed] ArrowFunction
src/services/fabric/WeeklyReportEngine.ts:57:44
       : 0;
 
   // ── Commitment summary ───────────────────────────────────────────────────────
-  const completed = weekCommitments.filter((task) => task.completed).length;
+  const completed = weekCommitments.filter(() => undefined).length;
   const missed = weekCommitments.filter((task) => !task.completed).length;
   const completionRate =
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 50 // Object.is equality

[Killed] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:57:21
       : 0;
 
   // ── Commitment summary ───────────────────────────────────────────────────────
-  const completed = weekCommitments.filter((task) => task.completed).length;
+  const completed = weekCommitments.length;
   const missed = weekCommitments.filter((task) => !task.completed).length;
   const completionRate =
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected 100 to be 50 // Object.is equality

[Survived] BooleanLiteral
src/services/fabric/WeeklyReportEngine.ts:58:51
 
   // ── Commitment summary ───────────────────────────────────────────────────────
   const completed = weekCommitments.filter((task) => task.completed).length;
-  const missed = weekCommitments.filter((task) => !task.completed).length;
+  const missed = weekCommitments.filter((task) => task.completed).length;
   const completionRate =
     weekCommitments.length > 0

[Survived] ArrowFunction
src/services/fabric/WeeklyReportEngine.ts:58:41
 
   // ── Commitment summary ───────────────────────────────────────────────────────
   const completed = weekCommitments.filter((task) => task.completed).length;
-  const missed = weekCommitments.filter((task) => !task.completed).length;
+  const missed = weekCommitments.filter(() => undefined).length;
   const completionRate =
     weekCommitments.length > 0

[Killed] EqualityOperator
src/services/fabric/WeeklyReportEngine.ts:60:5
   const completed = weekCommitments.filter((task) => task.completed).length;
   const missed = weekCommitments.filter((task) => !task.completed).length;
   const completionRate =
-    weekCommitments.length > 0
+    weekCommitments.length <= 0
       ? Math.round((completed / weekCommitments.length) * 100)
       : 0;
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 50 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:60:5
   const completed = weekCommitments.filter((task) => task.completed).length;
   const missed = weekCommitments.filter((task) => !task.completed).length;
   const completionRate =
-    weekCommitments.length > 0
+    false
       ? Math.round((completed / weekCommitments.length) * 100)
       : 0;
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 50 // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:61:21
   const missed = weekCommitments.filter((task) => !task.completed).length;
   const completionRate =
     weekCommitments.length > 0
-      ? Math.round((completed / weekCommitments.length) * 100)
+      ? Math.round((completed * weekCommitments.length) * 100)
       : 0;
 
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected 200 to be 50 // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:61:20
   const missed = weekCommitments.filter((task) => !task.completed).length;
   const completionRate =
     weekCommitments.length > 0
-      ? Math.round((completed / weekCommitments.length) * 100)
+      ? Math.round(completed / weekCommitments.length / 100)
       : 0;
 
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 50 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:67:14
   const longestStreakTask = weekCommitments.reduce<{ name: string; days: number }>(
     (best, task) => {
       const streak = task.currentStreak ?? 0;
-      return streak > best.days ? { name: task.title, days: streak } : best;
+      return false ? { name: task.title, days: streak } : best;
     },
     { name: 'N/A', days: 0 },
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 4 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:67:14
   const longestStreakTask = weekCommitments.reduce<{ name: string; days: number }>(
     (best, task) => {
       const streak = task.currentStreak ?? 0;
-      return streak > best.days ? { name: task.title, days: streak } : best;
+      return true ? { name: task.title, days: streak } : best;
     },
     { name: 'N/A', days: 0 },
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: expected +0 to be 4 // Object.is equality

[Killed] LogicalOperator
src/services/fabric/WeeklyReportEngine.ts:75:23
   const categoryScores = weekCommitments.reduce<Record<string, { total: number; completed: number }>>(
     (acc, task) => {
       const key = task.category;
-      const current = acc[key] ?? { total: 0, completed: 0 };
+      const current = acc[key] && {
+  total: 0,
+  completed: 0
+};
       current.total += 1;
       current.completed += task.completed ? 1 : 0;
killedBy: buildWeeklyReport builds weekly report metrics from transactions and commitments
statusReason: Cannot read properties of undefined (reading 'total')

[Survived] ObjectLiteral
src/services/fabric/WeeklyReportEngine.ts:75:35
   const categoryScores = weekCommitments.reduce<Record<string, { total: number; completed: number }>>(
     (acc, task) => {
       const key = task.category;
-      const current = acc[key] ?? { total: 0, completed: 0 };
+      const current = acc[key] ?? {};
       current.total += 1;
       current.completed += task.completed ? 1 : 0;

[Survived] AssignmentOperator
src/services/fabric/WeeklyReportEngine.ts:76:7
     (acc, task) => {
       const key = task.category;
       const current = acc[key] ?? { total: 0, completed: 0 };
-      current.total += 1;
+      current.total -= 1;
       current.completed += task.completed ? 1 : 0;
       acc[key] = current;

[Survived] AssignmentOperator
src/services/fabric/WeeklyReportEngine.ts:77:7
       const key = task.category;
       const current = acc[key] ?? { total: 0, completed: 0 };
       current.total += 1;
-      current.completed += task.completed ? 1 : 0;
+      current.completed -= task.completed ? 1 : 0;
       acc[key] = current;
       return acc;

[Survived] MethodExpression
src/services/fabric/WeeklyReportEngine.ts:84:28
     {},
   );
 
-  const rankedCategories = Object.entries(categoryScores)
-    .map(([name, score]) => ({
-      name,
-      rate: score.total > 0 ? score.completed / score.total : 0,
-    }))
-    .sort((a, b) => b.rate - a.rate);
+  const rankedCategories = Object.entries(categoryScores).map(([name, score]) => ({
+  name,
+  rate: score.total > 0 ? score.completed / score.total : 0
+}));
 
   return {

[Survived] EqualityOperator
src/services/fabric/WeeklyReportEngine.ts:87:13
   const rankedCategories = Object.entries(categoryScores)
     .map(([name, score]) => ({
       name,
-      rate: score.total > 0 ? score.completed / score.total : 0,
+      rate: score.total <= 0 ? score.completed / score.total : 0,
     }))
     .sort((a, b) => b.rate - a.rate);

[Survived] ConditionalExpression
src/services/fabric/WeeklyReportEngine.ts:87:13
   const rankedCategories = Object.entries(categoryScores)
     .map(([name, score]) => ({
       name,
-      rate: score.total > 0 ? score.completed / score.total : 0,
+      rate: true ? score.completed / score.total : 0,
     }))
     .sort((a, b) => b.rate - a.rate);

[NoCoverage] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:89:21
       name,
       rate: score.total > 0 ? score.completed / score.total : 0,
     }))
-    .sort((a, b) => b.rate - a.rate);
+    .sort((a, b) => b.rate + a.rate);
 
   return {

[NoCoverage] StringLiteral
src/services/fabric/WeeklyReportEngine.ts:106:53
       skipped: 0, // Not tracked at the data model level; requires explicit user action
       missed,
       completionRate,
-      bestCategory: rankedCategories.at(0)?.name ?? 'N/A',
+      bestCategory: rankedCategories.at(0)?.name ?? "",
       worstCategory: rankedCategories.at(-1)?.name ?? 'N/A',
       longestStreak: longestStreakTask,

[Survived] UnaryOperator
src/services/fabric/WeeklyReportEngine.ts:107:42
       missed,
       completionRate,
       bestCategory: rankedCategories.at(0)?.name ?? 'N/A',
-      worstCategory: rankedCategories.at(-1)?.name ?? 'N/A',
+      worstCategory: rankedCategories.at(+1)?.name ?? 'N/A',
       longestStreak: longestStreakTask,
     },

[NoCoverage] StringLiteral
src/services/fabric/WeeklyReportEngine.ts:107:55
       missed,
       completionRate,
       bestCategory: rankedCategories.at(0)?.name ?? 'N/A',
-      worstCategory: rankedCategories.at(-1)?.name ?? 'N/A',
+      worstCategory: rankedCategories.at(-1)?.name ?? "",
       longestStreak: longestStreakTask,
     },

[Survived] ArithmeticOperator
src/services/fabric/WeeklyReportEngine.ts:113:30
     financeSummary: {
       totalSpent: fromCents(totalSpentCents),
       totalIncome: fromCents(totalIncomeCents),
-      netCashFlow: fromCents(totalIncomeCents - totalSpentCents),
+      netCashFlow: fromCents(totalIncomeCents + totalSpentCents),
       topCategory: { name: topCategoryName, amount: fromCents(topCategoryValue) },
       vsLastWeek,
