[Killed] ConditionalExpression
src/services/fabric/fabricUtils.ts:5:7
 
 /** Safely parse a Date | string | undefined into a Date, or null on failure. */
 export function toDate(value: Date | string | undefined | null): Date | null {
-  if (!value) return null;
+  if (true) return null;
   const parsed = new Date(value as string | Date);
   if (Number.isNaN(parsed.getTime())) return null;
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Killed] BooleanLiteral
src/services/fabric/fabricUtils.ts:5:7
 
 /** Safely parse a Date | string | undefined into a Date, or null on failure. */
 export function toDate(value: Date | string | undefined | null): Date | null {
-  if (!value) return null;
+  if (value) return null;
   const parsed = new Date(value as string | Date);
   if (Number.isNaN(parsed.getTime())) return null;
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Killed] ConditionalExpression
src/services/fabric/fabricUtils.ts:7:7
 export function toDate(value: Date | string | undefined | null): Date | null {
   if (!value) return null;
   const parsed = new Date(value as string | Date);
-  if (Number.isNaN(parsed.getTime())) return null;
+  if (true) return null;
   return parsed;
 }
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:7:7
 export function toDate(value: Date | string | undefined | null): Date | null {
   if (!value) return null;
   const parsed = new Date(value as string | Date);
-  if (Number.isNaN(parsed.getTime())) return null;
+  if (false) return null;
   return parsed;
 }

[NoCoverage] BooleanLiteral
src/services/fabric/fabricUtils.ts:14:23
 /** Returns true if the value falls within [start, end] inclusive. */
 export function withinRange(value: Date | string | undefined | null, start: Date, end: Date): boolean {
   const parsed = toDate(value);
-  if (!parsed) return false;
+  if (!parsed) return true;
   return parsed >= start && parsed <= end;
 }

[Killed] EqualityOperator
src/services/fabric/fabricUtils.ts:15:29
 export function withinRange(value: Date | string | undefined | null, start: Date, end: Date): boolean {
   const parsed = toDate(value);
   if (!parsed) return false;
-  return parsed >= start && parsed <= end;
+  return parsed >= start && parsed > end;
 }
 
killedBy: FabricService builds predictions and weekly report
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ConditionalExpression
src/services/fabric/fabricUtils.ts:15:10
 export function withinRange(value: Date | string | undefined | null, start: Date, end: Date): boolean {
   const parsed = toDate(value);
   if (!parsed) return false;
-  return parsed >= start && parsed <= end;
+  return false;
 }
 
killedBy: FabricService builds predictions and weekly report
statusReason: expected +0 to be 1500 // Object.is equality

[Killed] ArithmeticOperator
src/services/fabric/fabricUtils.ts:25:18
  * Respects the user's currency (₦ for NGN, $ for USD).
  */
 export function formatCents(cents: number, currency: Currency = 'USD'): string {
-  const amount = cents / 100;
+  const amount = cents * 100;
   if (currency === 'NGN') {
     return `₦${amount.toLocaleString('en-NG', { minimumFractionDigits: 2, maximumFractionDigits: 2 })}`;
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'You spent $430000.00 this month acros…' to contain '$43.00'

[Killed] EqualityOperator
src/services/fabric/fabricUtils.ts:26:7
  */
 export function formatCents(cents: number, currency: Currency = 'USD'): string {
   const amount = cents / 100;
-  if (currency === 'NGN') {
+  if (currency !== 'NGN') {
     return `₦${amount.toLocaleString('en-NG', { minimumFractionDigits: 2, maximumFractionDigits: 2 })}`;
   }
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'You spent ₦43.00 this month across 2 …' to contain '$43.00'

[Killed] ConditionalExpression
src/services/fabric/fabricUtils.ts:26:7
  */
 export function formatCents(cents: number, currency: Currency = 'USD'): string {
   const amount = cents / 100;
-  if (currency === 'NGN') {
+  if (true) {
     return `₦${amount.toLocaleString('en-NG', { minimumFractionDigits: 2, maximumFractionDigits: 2 })}`;
   }
killedBy: runFabricQuery returns spending summary for query_spending intent
statusReason: expected 'You spent ₦43.00 this month across 2 …' to contain '$43.00'

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:37:43
  * Falls back to USD if no transactions exist.
  */
 export function detectPrimaryCurrency(transactions: AnchorTransaction[]): Currency {
-  const first = transactions.find((tx) => tx.currency === 'NGN' || tx.currency === 'USD');
+  const first = transactions.find((tx) => true);
   return (first?.currency as Currency) ?? 'USD';
 }

[Survived] EqualityOperator
src/services/fabric/fabricUtils.ts:37:68
  * Falls back to USD if no transactions exist.
  */
 export function detectPrimaryCurrency(transactions: AnchorTransaction[]): Currency {
-  const first = transactions.find((tx) => tx.currency === 'NGN' || tx.currency === 'USD');
+  const first = transactions.find((tx) => tx.currency === 'NGN' || tx.currency !== 'USD');
   return (first?.currency as Currency) ?? 'USD';
 }

[Survived] LogicalOperator
src/services/fabric/fabricUtils.ts:38:10
  */
 export function detectPrimaryCurrency(transactions: AnchorTransaction[]): Currency {
   const first = transactions.find((tx) => tx.currency === 'NGN' || tx.currency === 'USD');
-  return (first?.currency as Currency) ?? 'USD';
+  return first?.currency as Currency && 'USD';
 }
 

[Survived] StringLiteral
src/services/fabric/fabricUtils.ts:38:43
  */
 export function detectPrimaryCurrency(transactions: AnchorTransaction[]): Currency {
   const first = transactions.find((tx) => tx.currency === 'NGN' || tx.currency === 'USD');
-  return (first?.currency as Currency) ?? 'USD';
+  return (first?.currency as Currency) ?? "";
 }
 

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:58:31
   const end = new Date(now);
   const start = new Date(now);
 
-  if (timePeriod === 'today') {
-    start.setHours(0, 0, 0, 0);
-    end.setHours(23, 59, 59, 999);
-    return { start, end };
-  }
+  if (timePeriod === 'today') {}
 
   if (timePeriod === 'yesterday') {

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:58:7
   const end = new Date(now);
   const start = new Date(now);
 
-  if (timePeriod === 'today') {
+  if (false) {
     start.setHours(0, 0, 0, 0);
     end.setHours(23, 59, 59, 999);

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:64:35
     return { start, end };
   }
 
-  if (timePeriod === 'yesterday') {
-    start.setDate(start.getDate() - 1);
-    start.setHours(0, 0, 0, 0);
-    end.setDate(end.getDate() - 1);
-    end.setHours(23, 59, 59, 999);
-    return { start, end };
-  }
+  if (timePeriod === 'yesterday') {}
 
   if (timePeriod === 'this_week' || timePeriod === 'last_week') {

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:64:7
     return { start, end };
   }
 
-  if (timePeriod === 'yesterday') {
+  if (false) {
     start.setDate(start.getDate() - 1);
     start.setHours(0, 0, 0, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:65:19
   }
 
   if (timePeriod === 'yesterday') {
-    start.setDate(start.getDate() - 1);
+    start.setDate(start.getDate() + 1);
     start.setHours(0, 0, 0, 0);
     end.setDate(end.getDate() - 1);

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:65:5
   }
 
   if (timePeriod === 'yesterday') {
-    start.setDate(start.getDate() - 1);
+    start.setTime(start.getDate() - 1);
     start.setHours(0, 0, 0, 0);
     end.setDate(end.getDate() - 1);

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:67:5
   if (timePeriod === 'yesterday') {
     start.setDate(start.getDate() - 1);
     start.setHours(0, 0, 0, 0);
-    end.setDate(end.getDate() - 1);
+    end.setTime(end.getDate() - 1);
     end.setHours(23, 59, 59, 999);
     return { start, end };

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:67:17
   if (timePeriod === 'yesterday') {
     start.setDate(start.getDate() - 1);
     start.setHours(0, 0, 0, 0);
-    end.setDate(end.getDate() - 1);
+    end.setDate(end.getDate() + 1);
     end.setHours(23, 59, 59, 999);
     return { start, end };

[Survived] BlockStatement
src/services/fabric/fabricUtils.ts:72:65
     return { start, end };
   }
 
-  if (timePeriod === 'this_week' || timePeriod === 'last_week') {
-    const day = start.getDay();
-    const mondayOffset = day === 0 ? -6 : 1 - day;
-    start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
-    start.setHours(0, 0, 0, 0);
-    end.setTime(start.getTime());
-    end.setDate(start.getDate() + 6);
-    end.setHours(23, 59, 59, 999);
-    return { start, end };
-  }
+  if (timePeriod === 'this_week' || timePeriod === 'last_week') {}
 
   if (timePeriod === 'this_year') {

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:72:7
     return { start, end };
   }
 
-  if (timePeriod === 'this_week' || timePeriod === 'last_week') {
+  if (false) {
     const day = start.getDay();
     const mondayOffset = day === 0 ? -6 : 1 - day;

[Killed] ConditionalExpression
src/services/fabric/fabricUtils.ts:74:26
 
   if (timePeriod === 'this_week' || timePeriod === 'last_week') {
     const day = start.getDay();
-    const mondayOffset = day === 0 ? -6 : 1 - day;
+    const mondayOffset = true ? -6 : 1 - day;
     start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
     start.setHours(0, 0, 0, 0);
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 0% (0/1).' to contain '50%'

[Killed] EqualityOperator
src/services/fabric/fabricUtils.ts:74:26
 
   if (timePeriod === 'this_week' || timePeriod === 'last_week') {
     const day = start.getDay();
-    const mondayOffset = day === 0 ? -6 : 1 - day;
+    const mondayOffset = day !== 0 ? -6 : 1 - day;
     start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
     start.setHours(0, 0, 0, 0);
killedBy: runFabricQuery returns commitments summary for query_commitments intent
statusReason: expected 'Commitment completion is 0% (0/1).' to contain '50%'

[NoCoverage] UnaryOperator
src/services/fabric/fabricUtils.ts:75:82
   if (timePeriod === 'this_week' || timePeriod === 'last_week') {
     const day = start.getDay();
     const mondayOffset = day === 0 ? -6 : 1 - day;
-    start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
+    start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? +7 : 0));
     start.setHours(0, 0, 0, 0);
     end.setTime(start.getTime());

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:75:53
   if (timePeriod === 'this_week' || timePeriod === 'last_week') {
     const day = start.getDay();
     const mondayOffset = day === 0 ? -6 : 1 - day;
-    start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
+    start.setDate(start.getDate() + mondayOffset + (false ? -7 : 0));
     start.setHours(0, 0, 0, 0);
     end.setTime(start.getTime());

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:77:5
     const mondayOffset = day === 0 ? -6 : 1 - day;
     start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
     start.setHours(0, 0, 0, 0);
-    end.setTime(start.getTime());
+    end.setDate(start.getTime());
     end.setDate(start.getDate() + 6);
     end.setHours(23, 59, 59, 999);

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:78:5
     start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
     start.setHours(0, 0, 0, 0);
     end.setTime(start.getTime());
-    end.setDate(start.getDate() + 6);
+    end.setTime(start.getDate() + 6);
     end.setHours(23, 59, 59, 999);
     return { start, end };

[Survived] ArithmeticOperator
src/services/fabric/fabricUtils.ts:78:17
     start.setDate(start.getDate() + mondayOffset + (timePeriod === 'last_week' ? -7 : 0));
     start.setHours(0, 0, 0, 0);
     end.setTime(start.getTime());
-    end.setDate(start.getDate() + 6);
+    end.setDate(start.getDate() - 6);
     end.setHours(23, 59, 59, 999);
     return { start, end };

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:83:35
     return { start, end };
   }
 
-  if (timePeriod === 'this_year') {
-    start.setMonth(0, 1);
-    start.setHours(0, 0, 0, 0);
-    end.setMonth(11, 31);
-    end.setHours(23, 59, 59, 999);
-    return { start, end };
-  }
+  if (timePeriod === 'this_year') {}
 
   if (timePeriod === 'last_year') {

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:83:7
     return { start, end };
   }
 
-  if (timePeriod === 'this_year') {
+  if (false) {
     start.setMonth(0, 1);
     start.setHours(0, 0, 0, 0);

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:84:5
   }
 
   if (timePeriod === 'this_year') {
-    start.setMonth(0, 1);
+    start.setFullYear(0, 1);
     start.setHours(0, 0, 0, 0);
     end.setMonth(11, 31);

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:86:5
   if (timePeriod === 'this_year') {
     start.setMonth(0, 1);
     start.setHours(0, 0, 0, 0);
-    end.setMonth(11, 31);
+    end.setFullYear(11, 31);
     end.setHours(23, 59, 59, 999);
     return { start, end };

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:91:35
     return { start, end };
   }
 
-  if (timePeriod === 'last_year') {
-    start.setFullYear(start.getFullYear() - 1, 0, 1);
-    start.setHours(0, 0, 0, 0);
-    end.setFullYear(start.getFullYear(), 11, 31);
-    end.setHours(23, 59, 59, 999);
-    return { start, end };
-  }
+  if (timePeriod === 'last_year') {}
 
   // month_YYYY_MM — specific calendar month

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:91:7
     return { start, end };
   }
 
-  if (timePeriod === 'last_year') {
+  if (false) {
     start.setFullYear(start.getFullYear() - 1, 0, 1);
     start.setHours(0, 0, 0, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:92:23
   }
 
   if (timePeriod === 'last_year') {
-    start.setFullYear(start.getFullYear() - 1, 0, 1);
+    start.setFullYear(start.getFullYear() + 1, 0, 1);
     start.setHours(0, 0, 0, 0);
     end.setFullYear(start.getFullYear(), 11, 31);

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:100:7
   }
 
   // month_YYYY_MM — specific calendar month
-  if (timePeriod?.startsWith('month_')) {
+  if (timePeriod?.endsWith('month_')) {
     const parts = timePeriod.split('_');
     const year = parseInt(parts[1], 10);

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:100:41
   }
 
   // month_YYYY_MM — specific calendar month
-  if (timePeriod?.startsWith('month_')) {
-    const parts = timePeriod.split('_');
-    const year = parseInt(parts[1], 10);
-    const month = parseInt(parts[2], 10) - 1; // 0-indexed
-    if (!Number.isNaN(year) && !Number.isNaN(month)) {
-      start.setFullYear(year, month, 1);
-      start.setHours(0, 0, 0, 0);
-      end.setFullYear(year, month + 1, 0);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
-  }
+  if (timePeriod?.startsWith('month_')) {}
 
   // year_YYYY — full calendar year

[NoCoverage] StringLiteral
src/services/fabric/fabricUtils.ts:101:36
 
   // month_YYYY_MM — specific calendar month
   if (timePeriod?.startsWith('month_')) {
-    const parts = timePeriod.split('_');
+    const parts = timePeriod.split("");
     const year = parseInt(parts[1], 10);
     const month = parseInt(parts[2], 10) - 1; // 0-indexed

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:103:19
   if (timePeriod?.startsWith('month_')) {
     const parts = timePeriod.split('_');
     const year = parseInt(parts[1], 10);
-    const month = parseInt(parts[2], 10) - 1; // 0-indexed
+    const month = parseInt(parts[2], 10) + 1; // 0-indexed
     if (!Number.isNaN(year) && !Number.isNaN(month)) {
       start.setFullYear(year, month, 1);

[NoCoverage] BooleanLiteral
src/services/fabric/fabricUtils.ts:104:32
     const parts = timePeriod.split('_');
     const year = parseInt(parts[1], 10);
     const month = parseInt(parts[2], 10) - 1; // 0-indexed
-    if (!Number.isNaN(year) && !Number.isNaN(month)) {
+    if (!Number.isNaN(year) && Number.isNaN(month)) {
       start.setFullYear(year, month, 1);
       start.setHours(0, 0, 0, 0);

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:104:54
     const parts = timePeriod.split('_');
     const year = parseInt(parts[1], 10);
     const month = parseInt(parts[2], 10) - 1; // 0-indexed
-    if (!Number.isNaN(year) && !Number.isNaN(month)) {
-      start.setFullYear(year, month, 1);
-      start.setHours(0, 0, 0, 0);
-      end.setFullYear(year, month + 1, 0);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
+    if (!Number.isNaN(year) && !Number.isNaN(month)) {}
   }
 

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:107:29
     if (!Number.isNaN(year) && !Number.isNaN(month)) {
       start.setFullYear(year, month, 1);
       start.setHours(0, 0, 0, 0);
-      end.setFullYear(year, month + 1, 0);
+      end.setFullYear(year, month - 1, 0);
       end.setHours(23, 59, 59, 999);
       return { start, end };

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:114:40
   }
 
   // year_YYYY — full calendar year
-  if (timePeriod?.startsWith('year_')) {
-    const year = parseInt(timePeriod.slice(5), 10);
-    if (!Number.isNaN(year)) {
-      start.setFullYear(year, 0, 1);
-      start.setHours(0, 0, 0, 0);
-      end.setFullYear(year, 11, 31);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
-  }
+  if (timePeriod?.startsWith('year_')) {}
 
   // last_N_months

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:114:7
   }
 
   // year_YYYY — full calendar year
-  if (timePeriod?.startsWith('year_')) {
+  if (timePeriod?.endsWith('year_')) {
     const year = parseInt(timePeriod.slice(5), 10);
     if (!Number.isNaN(year)) {

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:115:27
 
   // year_YYYY — full calendar year
   if (timePeriod?.startsWith('year_')) {
-    const year = parseInt(timePeriod.slice(5), 10);
+    const year = parseInt(timePeriod, 10);
     if (!Number.isNaN(year)) {
       start.setFullYear(year, 0, 1);

[NoCoverage] ConditionalExpression
src/services/fabric/fabricUtils.ts:116:9
   // year_YYYY — full calendar year
   if (timePeriod?.startsWith('year_')) {
     const year = parseInt(timePeriod.slice(5), 10);
-    if (!Number.isNaN(year)) {
+    if (false) {
       start.setFullYear(year, 0, 1);
       start.setHours(0, 0, 0, 0);

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:116:30
   // year_YYYY — full calendar year
   if (timePeriod?.startsWith('year_')) {
     const year = parseInt(timePeriod.slice(5), 10);
-    if (!Number.isNaN(year)) {
-      start.setFullYear(year, 0, 1);
-      start.setHours(0, 0, 0, 0);
-      end.setFullYear(year, 11, 31);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
+    if (!Number.isNaN(year)) {}
   }
 

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:126:42
   }
 
   // last_N_months
-  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_months')) {
+  if (timePeriod?.startsWith('last_') && timePeriod.startsWith('_months')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:126:74
   }
 
   // last_N_months
-  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_months')) {
-    const n = parseInt(timePeriod.split('_')[1], 10);
-    if (!Number.isNaN(n)) {
-      start.setMonth(start.getMonth() - n, 1);
-      start.setHours(0, 0, 0, 0);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
-  }
+  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_months')) {}
 
   // last_N_weeks

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:128:27
   // last_N_months
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_months')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
-    if (!Number.isNaN(n)) {
-      start.setMonth(start.getMonth() - n, 1);
-      start.setHours(0, 0, 0, 0);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
+    if (!Number.isNaN(n)) {}
   }
 

[NoCoverage] BooleanLiteral
src/services/fabric/fabricUtils.ts:128:9
   // last_N_months
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_months')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
-    if (!Number.isNaN(n)) {
+    if (Number.isNaN(n)) {
       start.setMonth(start.getMonth() - n, 1);
       start.setHours(0, 0, 0, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:129:22
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_months')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {
-      start.setMonth(start.getMonth() - n, 1);
+      start.setMonth(start.getMonth() + n, 1);
       start.setHours(0, 0, 0, 0);
       end.setHours(23, 59, 59, 999);

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:129:7
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_months')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {
-      start.setMonth(start.getMonth() - n, 1);
+      start.setFullYear(start.getMonth() - n, 1);
       start.setHours(0, 0, 0, 0);
       end.setHours(23, 59, 59, 999);

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:137:73
   }
 
   // last_N_weeks
-  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_weeks')) {
-    const n = parseInt(timePeriod.split('_')[1], 10);
-    if (!Number.isNaN(n)) {
-      start.setDate(start.getDate() - n * 7);
-      start.setHours(0, 0, 0, 0);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
-  }
+  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_weeks')) {}
 
   // last_N_days

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:137:7
   }
 
   // last_N_weeks
-  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_weeks')) {
+  if (timePeriod?.endsWith('last_') && timePeriod.endsWith('_weeks')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {

[NoCoverage] StringLiteral
src/services/fabric/fabricUtils.ts:138:41
 
   // last_N_weeks
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_weeks')) {
-    const n = parseInt(timePeriod.split('_')[1], 10);
+    const n = parseInt(timePeriod.split("")[1], 10);
     if (!Number.isNaN(n)) {
       start.setDate(start.getDate() - n * 7);

[NoCoverage] ConditionalExpression
src/services/fabric/fabricUtils.ts:139:9
   // last_N_weeks
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_weeks')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
-    if (!Number.isNaN(n)) {
+    if (false) {
       start.setDate(start.getDate() - n * 7);
       start.setHours(0, 0, 0, 0);

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:140:39
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_weeks')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {
-      start.setDate(start.getDate() - n * 7);
+      start.setDate(start.getDate() - n / 7);
       start.setHours(0, 0, 0, 0);
       end.setHours(23, 59, 59, 999);

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:140:21
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_weeks')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {
-      start.setDate(start.getDate() - n * 7);
+      start.setDate(start.getDate() + n * 7);
       start.setHours(0, 0, 0, 0);
       end.setHours(23, 59, 59, 999);

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:148:72
   }
 
   // last_N_days
-  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_days')) {
-    const n = parseInt(timePeriod.split('_')[1], 10);
-    if (!Number.isNaN(n)) {
-      start.setDate(start.getDate() - n);
-      start.setHours(0, 0, 0, 0);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
-  }
+  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_days')) {}
 
   // this_month (default) or last_month

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:148:7
   }
 
   // last_N_days
-  if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_days')) {
+  if (timePeriod?.endsWith('last_') && timePeriod.endsWith('_days')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:150:27
   // last_N_days
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_days')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
-    if (!Number.isNaN(n)) {
-      start.setDate(start.getDate() - n);
-      start.setHours(0, 0, 0, 0);
-      end.setHours(23, 59, 59, 999);
-      return { start, end };
-    }
+    if (!Number.isNaN(n)) {}
   }
 

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:151:7
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_days')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {
-      start.setDate(start.getDate() - n);
+      start.setTime(start.getDate() - n);
       start.setHours(0, 0, 0, 0);
       end.setHours(23, 59, 59, 999);

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:151:21
   if (timePeriod?.startsWith('last_') && timePeriod.endsWith('_days')) {
     const n = parseInt(timePeriod.split('_')[1], 10);
     if (!Number.isNaN(n)) {
-      start.setDate(start.getDate() - n);
+      start.setDate(start.getDate() + n);
       start.setHours(0, 0, 0, 0);
       end.setHours(23, 59, 59, 999);

[Killed] MethodExpression
src/services/fabric/fabricUtils.ts:159:3
   }
 
   // this_month (default) or last_month
-  start.setDate(1);
+  start.setTime(1);
   start.setHours(0, 0, 0, 0);
   if (timePeriod === 'last_month') {
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Killed] EqualityOperator
src/services/fabric/fabricUtils.ts:161:7
   // this_month (default) or last_month
   start.setDate(1);
   start.setHours(0, 0, 0, 0);
-  if (timePeriod === 'last_month') {
+  if (timePeriod !== 'last_month') {
     start.setMonth(start.getMonth() - 1);
   }
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Killed] ConditionalExpression
src/services/fabric/fabricUtils.ts:161:7
   // this_month (default) or last_month
   start.setDate(1);
   start.setHours(0, 0, 0, 0);
-  if (timePeriod === 'last_month') {
+  if (true) {
     start.setMonth(start.getMonth() - 1);
   }
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Survived] ArithmeticOperator
src/services/fabric/fabricUtils.ts:162:20
   start.setDate(1);
   start.setHours(0, 0, 0, 0);
   if (timePeriod === 'last_month') {
-    start.setMonth(start.getMonth() - 1);
+    start.setMonth(start.getMonth() + 1);
   }
   end.setFullYear(start.getFullYear(), start.getMonth() + 1, 0);

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:162:5
   start.setDate(1);
   start.setHours(0, 0, 0, 0);
   if (timePeriod === 'last_month') {
-    start.setMonth(start.getMonth() - 1);
+    start.setFullYear(start.getMonth() - 1);
   }
   end.setFullYear(start.getFullYear(), start.getMonth() + 1, 0);

[Killed] ArithmeticOperator
src/services/fabric/fabricUtils.ts:164:40
   if (timePeriod === 'last_month') {
     start.setMonth(start.getMonth() - 1);
   }
-  end.setFullYear(start.getFullYear(), start.getMonth() + 1, 0);
+  end.setFullYear(start.getFullYear(), start.getMonth() - 1, 0);
   end.setHours(23, 59, 59, 999);
   return { start, end };
killedBy: FabricService returns structured query results for spending question
statusReason: expected 'no expenses found for this month.' to contain 'spent'

[Survived] StringLiteral
src/services/fabric/fabricUtils.ts:169:45
   return { start, end };
 }
 
-const MONTH_NAMES = ['January', 'February', 'March', 'April', 'May', 'June',
+const MONTH_NAMES = ['January', 'February', "", 'April', 'May', 'June',
   'July', 'August', 'September', 'October', 'November', 'December'];
 

[Survived] StringLiteral
src/services/fabric/fabricUtils.ts:170:21
 }
 
 const MONTH_NAMES = ['January', 'February', 'March', 'April', 'May', 'June',
-  'July', 'August', 'September', 'October', 'November', 'December'];
+  'July', 'August', "", 'October', 'November', 'December'];
 
 /**
