[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:178:7
  */
 export function formatPeriodLabel(timePeriod: string | undefined): string {
   if (!timePeriod) return 'this month';
-  if (timePeriod === 'today') return 'today';
+  if (false) return 'today';
   if (timePeriod === 'yesterday') return 'yesterday';
   if (timePeriod === 'this_week') return 'this week';

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:179:7
 export function formatPeriodLabel(timePeriod: string | undefined): string {
   if (!timePeriod) return 'this month';
   if (timePeriod === 'today') return 'today';
-  if (timePeriod === 'yesterday') return 'yesterday';
+  if (false) return 'yesterday';
   if (timePeriod === 'this_week') return 'this week';
   if (timePeriod === 'last_week') return 'last week';

[Survived] StringLiteral
src/services/fabric/fabricUtils.ts:179:22
 export function formatPeriodLabel(timePeriod: string | undefined): string {
   if (!timePeriod) return 'this month';
   if (timePeriod === 'today') return 'today';
-  if (timePeriod === 'yesterday') return 'yesterday';
+  if (timePeriod === "") return 'yesterday';
   if (timePeriod === 'this_week') return 'this week';
   if (timePeriod === 'last_week') return 'last week';

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:180:7
   if (!timePeriod) return 'this month';
   if (timePeriod === 'today') return 'today';
   if (timePeriod === 'yesterday') return 'yesterday';
-  if (timePeriod === 'this_week') return 'this week';
+  if (false) return 'this week';
   if (timePeriod === 'last_week') return 'last week';
   if (timePeriod === 'this_month') return 'this month';

[Survived] StringLiteral
src/services/fabric/fabricUtils.ts:180:22
   if (!timePeriod) return 'this month';
   if (timePeriod === 'today') return 'today';
   if (timePeriod === 'yesterday') return 'yesterday';
-  if (timePeriod === 'this_week') return 'this week';
+  if (timePeriod === "") return 'this week';
   if (timePeriod === 'last_week') return 'last week';
   if (timePeriod === 'this_month') return 'this month';

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:181:7
   if (timePeriod === 'today') return 'today';
   if (timePeriod === 'yesterday') return 'yesterday';
   if (timePeriod === 'this_week') return 'this week';
-  if (timePeriod === 'last_week') return 'last week';
+  if (false) return 'last week';
   if (timePeriod === 'this_month') return 'this month';
   if (timePeriod === 'last_month') return 'last month';

[Survived] StringLiteral
src/services/fabric/fabricUtils.ts:181:22
   if (timePeriod === 'today') return 'today';
   if (timePeriod === 'yesterday') return 'yesterday';
   if (timePeriod === 'this_week') return 'this week';
-  if (timePeriod === 'last_week') return 'last week';
+  if (timePeriod === "") return 'last week';
   if (timePeriod === 'this_month') return 'this month';
   if (timePeriod === 'last_month') return 'last month';

[Survived] ConditionalExpression
src/services/fabric/fabricUtils.ts:182:7
   if (timePeriod === 'yesterday') return 'yesterday';
   if (timePeriod === 'this_week') return 'this week';
   if (timePeriod === 'last_week') return 'last week';
-  if (timePeriod === 'this_month') return 'this month';
+  if (false) return 'this month';
   if (timePeriod === 'last_month') return 'last month';
   if (timePeriod === 'this_year') return 'this year';

[NoCoverage] ConditionalExpression
src/services/fabric/fabricUtils.ts:183:7
   if (timePeriod === 'this_week') return 'this week';
   if (timePeriod === 'last_week') return 'last week';
   if (timePeriod === 'this_month') return 'this month';
-  if (timePeriod === 'last_month') return 'last month';
+  if (false) return 'last month';
   if (timePeriod === 'this_year') return 'this year';
   if (timePeriod === 'last_year') return 'last year';

[NoCoverage] ConditionalExpression
src/services/fabric/fabricUtils.ts:184:7
   if (timePeriod === 'last_week') return 'last week';
   if (timePeriod === 'this_month') return 'this month';
   if (timePeriod === 'last_month') return 'last month';
-  if (timePeriod === 'this_year') return 'this year';
+  if (false) return 'this year';
   if (timePeriod === 'last_year') return 'last year';
 

[NoCoverage] StringLiteral
src/services/fabric/fabricUtils.ts:184:42
   if (timePeriod === 'last_week') return 'last week';
   if (timePeriod === 'this_month') return 'this month';
   if (timePeriod === 'last_month') return 'last month';
-  if (timePeriod === 'this_year') return 'this year';
+  if (timePeriod === 'this_year') return "";
   if (timePeriod === 'last_year') return 'last year';
 

[NoCoverage] EqualityOperator
src/services/fabric/fabricUtils.ts:185:7
   if (timePeriod === 'this_month') return 'this month';
   if (timePeriod === 'last_month') return 'last month';
   if (timePeriod === 'this_year') return 'this year';
-  if (timePeriod === 'last_year') return 'last year';
+  if (timePeriod !== 'last_year') return 'last year';
 
   if (timePeriod.startsWith('month_')) {

[NoCoverage] ConditionalExpression
src/services/fabric/fabricUtils.ts:185:7
   if (timePeriod === 'this_month') return 'this month';
   if (timePeriod === 'last_month') return 'last month';
   if (timePeriod === 'this_year') return 'this year';
-  if (timePeriod === 'last_year') return 'last year';
+  if (false) return 'last year';
 
   if (timePeriod.startsWith('month_')) {

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:187:40
   if (timePeriod === 'this_year') return 'this year';
   if (timePeriod === 'last_year') return 'last year';
 
-  if (timePeriod.startsWith('month_')) {
-    const parts = timePeriod.split('_');
-    const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] ?? '';
-    return `${monthName} ${parts[1]}`;
-  }
+  if (timePeriod.startsWith('month_')) {}
   if (timePeriod.startsWith('year_')) return timePeriod.slice(5);
 

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:187:7
   if (timePeriod === 'this_year') return 'this year';
   if (timePeriod === 'last_year') return 'last year';
 
-  if (timePeriod.startsWith('month_')) {
+  if (timePeriod.endsWith('month_')) {
     const parts = timePeriod.split('_');
     const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] ?? '';

[NoCoverage] LogicalOperator
src/services/fabric/fabricUtils.ts:189:23
 
   if (timePeriod.startsWith('month_')) {
     const parts = timePeriod.split('_');
-    const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] ?? '';
+    const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] && '';
     return `${monthName} ${parts[1]}`;
   }

[NoCoverage] ArithmeticOperator
src/services/fabric/fabricUtils.ts:189:35
 
   if (timePeriod.startsWith('month_')) {
     const parts = timePeriod.split('_');
-    const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] ?? '';
+    const monthName = MONTH_NAMES[parseInt(parts[2], 10) + 1] ?? '';
     return `${monthName} ${parts[1]}`;
   }

[NoCoverage] StringLiteral
src/services/fabric/fabricUtils.ts:190:12
   if (timePeriod.startsWith('month_')) {
     const parts = timePeriod.split('_');
     const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] ?? '';
-    return `${monthName} ${parts[1]}`;
+    return ``;
   }
   if (timePeriod.startsWith('year_')) return timePeriod.slice(5);

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:192:46
     const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] ?? '';
     return `${monthName} ${parts[1]}`;
   }
-  if (timePeriod.startsWith('year_')) return timePeriod.slice(5);
+  if (timePeriod.startsWith('year_')) return timePeriod;
 
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_months')) {

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:192:7
     const monthName = MONTH_NAMES[parseInt(parts[2], 10) - 1] ?? '';
     return `${monthName} ${parts[1]}`;
   }
-  if (timePeriod.startsWith('year_')) return timePeriod.slice(5);
+  if (timePeriod.endsWith('year_')) return timePeriod.slice(5);
 
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_months')) {

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:194:73
   }
   if (timePeriod.startsWith('year_')) return timePeriod.slice(5);
 
-  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_months')) {
-    return `the last ${timePeriod.split('_')[1]} months`;
-  }
+  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_months')) {}
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_weeks')) {
     return `the last ${timePeriod.split('_')[1]} weeks`;

[NoCoverage] LogicalOperator
src/services/fabric/fabricUtils.ts:194:7
   }
   if (timePeriod.startsWith('year_')) return timePeriod.slice(5);
 
-  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_months')) {
+  if (timePeriod.startsWith('last_') || timePeriod.endsWith('_months')) {
     return `the last ${timePeriod.split('_')[1]} months`;
   }

[NoCoverage] BlockStatement
src/services/fabric/fabricUtils.ts:197:72
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_months')) {
     return `the last ${timePeriod.split('_')[1]} months`;
   }
-  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_weeks')) {
-    return `the last ${timePeriod.split('_')[1]} weeks`;
-  }
+  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_weeks')) {}
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_days')) {
     return `the last ${timePeriod.split('_')[1]} days`;

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:197:7
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_months')) {
     return `the last ${timePeriod.split('_')[1]} months`;
   }
-  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_weeks')) {
+  if (timePeriod.endsWith('last_') && timePeriod.endsWith('_weeks')) {
     return `the last ${timePeriod.split('_')[1]} weeks`;
   }

[NoCoverage] StringLiteral
src/services/fabric/fabricUtils.ts:198:41
     return `the last ${timePeriod.split('_')[1]} months`;
   }
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_weeks')) {
-    return `the last ${timePeriod.split('_')[1]} weeks`;
+    return `the last ${timePeriod.split("")[1]} weeks`;
   }
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_days')) {

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:200:41
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_weeks')) {
     return `the last ${timePeriod.split('_')[1]} weeks`;
   }
-  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_days')) {
+  if (timePeriod.startsWith('last_') && timePeriod.startsWith('_days')) {
     return `the last ${timePeriod.split('_')[1]} days`;
   }

[NoCoverage] MethodExpression
src/services/fabric/fabricUtils.ts:200:7
   if (timePeriod.startsWith('last_') && timePeriod.endsWith('_weeks')) {
     return `the last ${timePeriod.split('_')[1]} weeks`;
   }
-  if (timePeriod.startsWith('last_') && timePeriod.endsWith('_days')) {
+  if (timePeriod.endsWith('last_') && timePeriod.endsWith('_days')) {
     return `the last ${timePeriod.split('_')[1]} days`;
   }

[Survived] ArithmeticOperator
src/services/fabric/fabricUtils.ts:210:17
 /** Return the start of the previous 7-day window before `weekStart`. */
 export function previousWeekRange(weekStart: Date, weekEnd: Date): DateRange {
   const start = new Date(weekStart);
-  start.setDate(start.getDate() - 7);
+  start.setDate(start.getDate() + 7);
   const end = new Date(weekEnd);
   end.setDate(end.getDate() - 7);

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:210:3
 /** Return the start of the previous 7-day window before `weekStart`. */
 export function previousWeekRange(weekStart: Date, weekEnd: Date): DateRange {
   const start = new Date(weekStart);
-  start.setDate(start.getDate() - 7);
+  start.setTime(start.getDate() - 7);
   const end = new Date(weekEnd);
   end.setDate(end.getDate() - 7);

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:212:3
   const start = new Date(weekStart);
   start.setDate(start.getDate() - 7);
   const end = new Date(weekEnd);
-  end.setDate(end.getDate() - 7);
+  end.setTime(end.getDate() - 7);
   return { start, end };
 }

[Survived] ArithmeticOperator
src/services/fabric/fabricUtils.ts:212:15
   const start = new Date(weekStart);
   start.setDate(start.getDate() - 7);
   const end = new Date(weekEnd);
-  end.setDate(end.getDate() - 7);
+  end.setDate(end.getDate() + 7);
   return { start, end };
 }

[Survived] MethodExpression
src/services/fabric/fabricUtils.ts:218:10
 
 /** Return ISO month key like "2026-03" for a given date. */
 export function monthKey(date: Date): string {
-  return date.toISOString().slice(0, 7);
+  return date.toISOString();
 }
 

[Survived] LogicalOperator
src/services/fabric/fabricUtils.ts:227:17
  */
 export function sumByCategory(transactions: AnchorTransaction[]): Record<string, number> {
   return transactions.reduce<Record<string, number>>((acc, tx) => {
-    const key = tx.category || 'General';
+    const key = tx.category && 'General';
     acc[key] = (acc[key] || 0) + tx.amountCents;
     return acc;

[NoCoverage] StringLiteral
src/services/fabric/fabricUtils.ts:227:32
  */
 export function sumByCategory(transactions: AnchorTransaction[]): Record<string, number> {
   return transactions.reduce<Record<string, number>>((acc, tx) => {
-    const key = tx.category || 'General';
+    const key = tx.category || "";
     acc[key] = (acc[key] || 0) + tx.amountCents;
     return acc;

[Survived] LogicalOperator
src/services/fabric/fabricUtils.ts:228:17
 export function sumByCategory(transactions: AnchorTransaction[]): Record<string, number> {
   return transactions.reduce<Record<string, number>>((acc, tx) => {
     const key = tx.category || 'General';
-    acc[key] = (acc[key] || 0) + tx.amountCents;
+    acc[key] = (acc[key] && 0) + tx.amountCents;
     return acc;
   }, {});

[Survived] ArithmeticOperator
src/services/fabric/fabricUtils.ts:228:16
 export function sumByCategory(transactions: AnchorTransaction[]): Record<string, number> {
   return transactions.reduce<Record<string, number>>((acc, tx) => {
     const key = tx.category || 'General';
-    acc[key] = (acc[key] || 0) + tx.amountCents;
+    acc[key] = (acc[key] || 0) - tx.amountCents;
     return acc;
   }, {});
