[Killed] ConditionalExpression
src/utils/platform.ts:21:7
 
 // Access Capacitor from global - it's available at runtime
 const getCapacitor = () => {
-  if (typeof window !== 'undefined' && window.Capacitor) {
+  if (false) {
     return window.Capacitor;
   }
killedBy: platform utilities getPlatform returns "ios" when running on iOS
statusReason: expected 'web' to be 'ios' // Object.is equality

[Survived] ConditionalExpression
src/utils/platform.ts:21:7
 
 // Access Capacitor from global - it's available at runtime
 const getCapacitor = () => {
-  if (typeof window !== 'undefined' && window.Capacitor) {
+  if (true) {
     return window.Capacitor;
   }

[Killed] LogicalOperator
src/utils/platform.ts:34:10
  */
 export function getPlatform(): Platform {
   const cap = getCapacitor();
-  return (cap?.getPlatform() as Platform) ?? 'web';
+  return cap?.getPlatform() as Platform && 'web';
 }
 
killedBy: platform utilities getPlatform returns "web" when Capacitor is not available
statusReason: expected undefined to be 'web' // Object.is equality

[Killed] BooleanLiteral
src/utils/platform.ts:42:37
  */
 export function isNative(): boolean {
   const cap = getCapacitor();
-  return cap?.isNativePlatform() ?? false;
+  return cap?.isNativePlatform() ?? true;
 }
 
killedBy: platform utilities isNative returns false when Capacitor is not available
statusReason: expected true to be false // Object.is equality

[NoCoverage] EqualityOperator
src/utils/platform.ts:49:10
  * Check if running in a web browser
  */
 export function isWeb(): boolean {
-  return getPlatform() === 'web';
+  return getPlatform() !== 'web';
 }
 

[NoCoverage] ConditionalExpression
src/utils/platform.ts:49:10
  * Check if running in a web browser
  */
 export function isWeb(): boolean {
-  return getPlatform() === 'web';
+  return true;
 }
 

[Killed] EqualityOperator
src/utils/platform.ts:56:10
  * Check if running on iOS
  */
 export function isIOS(): boolean {
-  return getPlatform() === 'ios';
+  return getPlatform() !== 'ios';
 }
 
killedBy: platform utilities isIOS returns false when not on iOS
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/utils/platform.ts:56:10
  * Check if running on iOS
  */
 export function isIOS(): boolean {
-  return getPlatform() === 'ios';
+  return false;
 }
 
killedBy: platform utilities isIOS returns true when on iOS
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/platform.ts:63:10
  * Check if running on Android
  */
 export function isAndroid(): boolean {
-  return getPlatform() === 'android';
+  return false;
 }
 
killedBy: platform utilities isAndroid returns true when on Android
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/utils/platform.ts:63:10
  * Check if running on Android
  */
 export function isAndroid(): boolean {
-  return getPlatform() === 'android';
+  return true;
 }
 
killedBy: platform utilities isAndroid returns false when not on Android
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/utils/platform.ts:71:48
  */
 export function isPluginAvailable(pluginName: string): boolean {
   const cap = getCapacitor();
-  return cap?.isPluginAvailable(pluginName) ?? false;
+  return cap?.isPluginAvailable(pluginName) ?? true;
 }
 
killedBy: platform utilities isPluginAvailable returns false when Capacitor is not available
statusReason: expected true to be false // Object.is equality

[NoCoverage] ConditionalExpression
src/utils/platform.ts:103:7
   const platform = getPlatform();
   const classes = [`platform-${platform}`];
 
-  if (isNative()) {
+  if (true) {
     classes.push('platform-native');
   }

[NoCoverage] ConditionalExpression
src/utils/platform.ts:103:7
   const platform = getPlatform();
   const classes = [`platform-${platform}`];
 
-  if (isNative()) {
+  if (false) {
     classes.push('platform-native');
   }

[NoCoverage] StringLiteral
src/utils/platform.ts:104:18
   const classes = [`platform-${platform}`];
 
   if (isNative()) {
-    classes.push('platform-native');
+    classes.push("");
   }
 
