[NoCoverage] StringLiteral
src/utils/stagingConsoleCapture.ts:25:38
 }
 
 const serializeArg = (value: unknown): string => {
-  if (value instanceof Error) return `${value.name}: ${value.message}`;
+  if (value instanceof Error) return ``;
   if (typeof value === 'string') return value;
   if (typeof value === 'number' || typeof value === 'boolean' || value === null || value === undefined) {

[NoCoverage] ConditionalExpression
src/utils/stagingConsoleCapture.ts:27:84
 const serializeArg = (value: unknown): string => {
   if (value instanceof Error) return `${value.name}: ${value.message}`;
   if (typeof value === 'string') return value;
-  if (typeof value === 'number' || typeof value === 'boolean' || value === null || value === undefined) {
+  if (typeof value === 'number' || typeof value === 'boolean' || value === null || false) {
     return String(value);
   }

[NoCoverage] ConditionalExpression
src/utils/stagingConsoleCapture.ts:27:66
 const serializeArg = (value: unknown): string => {
   if (value instanceof Error) return `${value.name}: ${value.message}`;
   if (typeof value === 'string') return value;
-  if (typeof value === 'number' || typeof value === 'boolean' || value === null || value === undefined) {
+  if (typeof value === 'number' || typeof value === 'boolean' || false || value === undefined) {
     return String(value);
   }

[NoCoverage] StringLiteral
src/utils/stagingConsoleCapture.ts:33:12
   try {
     return JSON.stringify(value);
   } catch {
-    return '[unserializable]';
+    return "";
   }
 };

[NoCoverage] UnaryOperator
src/utils/stagingConsoleCapture.ts:42:49
     const raw = window.localStorage.getItem(STORAGE_KEY);
     if (!raw) return [];
     const parsed = JSON.parse(raw) as ConsoleEntry[];
-    return Array.isArray(parsed) ? parsed.slice(-MAX_LOGS) : [];
+    return Array.isArray(parsed) ? parsed.slice(+MAX_LOGS) : [];
   } catch {
     return [];

[NoCoverage] MethodExpression
src/utils/stagingConsoleCapture.ts:42:36
     const raw = window.localStorage.getItem(STORAGE_KEY);
     if (!raw) return [];
     const parsed = JSON.parse(raw) as ConsoleEntry[];
-    return Array.isArray(parsed) ? parsed.slice(-MAX_LOGS) : [];
+    return Array.isArray(parsed) ? parsed : [];
   } catch {
     return [];

[Survived] BlockStatement
src/utils/stagingConsoleCapture.ts:48:50
   }
 };
 
-const saveLogs = (logs: ConsoleEntry[]): void => {
-  try {
-    window.localStorage.setItem(STORAGE_KEY, JSON.stringify(logs.slice(-MAX_LOGS)));
-  } catch {
-    // Best-effort only; do not block app
-  }
-};
+const saveLogs = (logs: ConsoleEntry[]): void => {};
 
 export const initStagingConsoleCapture = (appEnv: string = __APP_ENV__): void => {

[Survived] BlockStatement
src/utils/stagingConsoleCapture.ts:49:7
 };
 
 const saveLogs = (logs: ConsoleEntry[]): void => {
-  try {
-    window.localStorage.setItem(STORAGE_KEY, JSON.stringify(logs.slice(-MAX_LOGS)));
-  } catch {
+  try {} catch {
     // Best-effort only; do not block app
   }

[Survived] MethodExpression
src/utils/stagingConsoleCapture.ts:50:61
 
 const saveLogs = (logs: ConsoleEntry[]): void => {
   try {
-    window.localStorage.setItem(STORAGE_KEY, JSON.stringify(logs.slice(-MAX_LOGS)));
+    window.localStorage.setItem(STORAGE_KEY, JSON.stringify(logs));
   } catch {
     // Best-effort only; do not block app

[Survived] UnaryOperator
src/utils/stagingConsoleCapture.ts:50:72
 
 const saveLogs = (logs: ConsoleEntry[]): void => {
   try {
-    window.localStorage.setItem(STORAGE_KEY, JSON.stringify(logs.slice(-MAX_LOGS)));
+    window.localStorage.setItem(STORAGE_KEY, JSON.stringify(logs.slice(+MAX_LOGS)));
   } catch {
     // Best-effort only; do not block app

[Killed] ConditionalExpression
src/utils/stagingConsoleCapture.ts:57:7
 };
 
 export const initStagingConsoleCapture = (appEnv: string = __APP_ENV__): void => {
-  if (appEnv !== 'staging') return;
+  if (true) return;
   if (typeof window === 'undefined') return;
   if (window.__ANCHOR_CONSOLE_CAPTURE__) return;
killedBy: initStagingConsoleCapture captures console errors in staging
statusReason: expected 0 to be greater than 0

[Killed] EqualityOperator
src/utils/stagingConsoleCapture.ts:57:7
 };
 
 export const initStagingConsoleCapture = (appEnv: string = __APP_ENV__): void => {
-  if (appEnv !== 'staging') return;
+  if (appEnv === 'staging') return;
   if (typeof window === 'undefined') return;
   if (window.__ANCHOR_CONSOLE_CAPTURE__) return;
killedBy: initStagingConsoleCapture does not initialize outside staging
statusReason: expected { getLogs: [Function], …(2) } to be undefined

[Killed] ConditionalExpression
src/utils/stagingConsoleCapture.ts:58:7
 
 export const initStagingConsoleCapture = (appEnv: string = __APP_ENV__): void => {
   if (appEnv !== 'staging') return;
-  if (typeof window === 'undefined') return;
+  if (true) return;
   if (window.__ANCHOR_CONSOLE_CAPTURE__) return;
 
killedBy: initStagingConsoleCapture captures console errors in staging
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/utils/stagingConsoleCapture.ts:58:7
 
 export const initStagingConsoleCapture = (appEnv: string = __APP_ENV__): void => {
   if (appEnv !== 'staging') return;
-  if (typeof window === 'undefined') return;
+  if (false) return;
   if (window.__ANCHOR_CONSOLE_CAPTURE__) return;
 

[Killed] ConditionalExpression
src/utils/stagingConsoleCapture.ts:59:7
 export const initStagingConsoleCapture = (appEnv: string = __APP_ENV__): void => {
   if (appEnv !== 'staging') return;
   if (typeof window === 'undefined') return;
-  if (window.__ANCHOR_CONSOLE_CAPTURE__) return;
+  if (true) return;
 
   const original = {
killedBy: initStagingConsoleCapture captures console errors in staging
statusReason: expected 0 to be greater than 0

[Survived] ConditionalExpression
src/utils/stagingConsoleCapture.ts:59:7
 export const initStagingConsoleCapture = (appEnv: string = __APP_ENV__): void => {
   if (appEnv !== 'staging') return;
   if (typeof window === 'undefined') return;
-  if (window.__ANCHOR_CONSOLE_CAPTURE__) return;
+  if (false) return;
 
   const original = {

[Killed] BlockStatement
src/utils/stagingConsoleCapture.ts:71:64
 
   let buffer = loadLogs();
 
-  const push = (level: ConsoleLevel, args: unknown[]): void => {
-    const entry: ConsoleEntry = {
-      ts: new Date().toISOString(),
-      level,
-      message: args.map(serializeArg).join(' '),
-    };
-    buffer = [...buffer, entry].slice(-MAX_LOGS);
-    saveLogs(buffer);
-  };
+  const push = (level: ConsoleLevel, args: unknown[]): void => {};
 
   const wrap = (level: ConsoleLevel, fn: (...args: unknown[]) => void) => {
killedBy: initStagingConsoleCapture captures console errors in staging
statusReason: expected 0 to be greater than 0

[Killed] UnaryOperator
src/utils/stagingConsoleCapture.ts:77:39
       level,
       message: args.map(serializeArg).join(' '),
     };
-    buffer = [...buffer, entry].slice(-MAX_LOGS);
+    buffer = [...buffer, entry].slice(+MAX_LOGS);
     saveLogs(buffer);
   };
killedBy: initStagingConsoleCapture captures console errors in staging
statusReason: expected 0 to be greater than 0

[Survived] MethodExpression
src/utils/stagingConsoleCapture.ts:77:14
       level,
       message: args.map(serializeArg).join(' '),
     };
-    buffer = [...buffer, entry].slice(-MAX_LOGS);
+    buffer = [...buffer, entry];
     saveLogs(buffer);
   };

[Killed] BlockStatement
src/utils/stagingConsoleCapture.ts:82:36
   };
 
   const wrap = (level: ConsoleLevel, fn: (...args: unknown[]) => void) => {
-    return (...args: unknown[]) => {
-      push(level, args);
-      fn(...args);
-    };
+    return (...args: unknown[]) => {};
   };
 
killedBy: initStagingConsoleCapture captures console errors in staging
statusReason: expected 0 to be greater than 0

[NoCoverage] BlockStatement
src/utils/stagingConsoleCapture.ts:94:47
   console.error = wrap('error', original.error);
   console.debug = wrap('debug', original.debug);
 
-  window.addEventListener('error', (event) => {
-    push('error', [`window.error: ${event.message}`]);
-  });
+  window.addEventListener('error', (event) => {});
 
   window.addEventListener('unhandledrejection', (event) => {

[NoCoverage] ArrayDeclaration
src/utils/stagingConsoleCapture.ts:95:19
   console.debug = wrap('debug', original.debug);
 
   window.addEventListener('error', (event) => {
-    push('error', [`window.error: ${event.message}`]);
+    push('error', []);
   });
 

[NoCoverage] BlockStatement
src/utils/stagingConsoleCapture.ts:98:60
     push('error', [`window.error: ${event.message}`]);
   });
 
-  window.addEventListener('unhandledrejection', (event) => {
-    push('error', ['unhandledrejection', event.reason]);
-  });
+  window.addEventListener('unhandledrejection', (event) => {});
 
   window.__ANCHOR_CONSOLE_CAPTURE__ = {

[NoCoverage] ArrayDeclaration
src/utils/stagingConsoleCapture.ts:99:19
   });
 
   window.addEventListener('unhandledrejection', (event) => {
-    push('error', ['unhandledrejection', event.reason]);
+    push('error', []);
   });
 

[Killed] BlockStatement
src/utils/stagingConsoleCapture.ts:104:18
 
   window.__ANCHOR_CONSOLE_CAPTURE__ = {
     getLogs: () => [...buffer],
-    clear: () => {
-      buffer = [];
-      try {
-        window.localStorage.removeItem(STORAGE_KEY);
-      } catch {
-        // Best-effort only
-      }
-    },
+    clear: () => {},
     exportText: () => JSON.stringify(buffer, null, 2),
   };
killedBy: initStagingConsoleCapture clears stored logs
statusReason: expected [ { …(3) } ] to deeply equal []

[Killed] BlockStatement
src/utils/stagingConsoleCapture.ts:106:11
     getLogs: () => [...buffer],
     clear: () => {
       buffer = [];
-      try {
-        window.localStorage.removeItem(STORAGE_KEY);
-      } catch {
+      try {} catch {
         // Best-effort only
       }
killedBy: initStagingConsoleCapture clears stored logs
statusReason: expected '[{"ts":"2026-03-11T11:03:51.840Z","le…' to be null
